{
    "_id": "zJffmk1ndwbjk0GH",
    "name": "Additional Maneuvers (Scholar: Tactician)",
    "permission": {
        "default": 0,
        "lwoKvFakziGOHjXS": 3
    },
    "type": "classfeature",
    "data": {
        "description": {
            "value": "<p>Lastly at 3rd level, you gain access to new maneuvers which reflect your mastery in the field of combat. Whenever you learn a new maneuver, you can choose from any of the following as well. The maneuvers are listed in alphabetical order.</p>\n<hr />\n<blockquote>\n<h4><strong>BOLSTER</strong></h4>\n<p>On your turn, you can use a bonus action and expend one superiority die to bolster the resolve of one of your companions. When you do so, choose a friendly creature who can see or hear you. That creature gains temporary hit points equal to the superiority die roll + your Intelligence modifier.</p>\n<hr />\n<h4><strong>COMMANDER&rsquo;S STRIKE</strong></h4>\n<p>When you take the Attack action on your turn, you can forgo one of your attacks and use a bonus action to direct one of your companions to strike. When you do so, choose a friendly creature within 60 feet who can see or hear you and expend one superiority die. That creature can immediately use its reaction to make one weapon attack, adding your superiority die to the attack&rsquo;s damage roll.</p>\n<hr />\n<h4><strong>DISARMING ATTACK</strong></h4>\n<p>When you hit a creature with a weapon attack, you can expend one superiority die to attempt to disarm the target, forcing it to drop one item of your choice that it&rsquo;s holding. You add the superiority die to the attack&rsquo;s damage roll, and the target must make a Strength saving throw. On a failed save, it drops the object you choose. The object lands at its feet.</p>\n<hr />\n<h4><strong>DISTRACTING STRIKE</strong></h4>\n<p>When you hit a creature with a weapon attack, you can expend one superiority die to distract the creature, giving your allies an opening. You add the superiority die to the attack&rsquo;s damage roll. The next attack roll against the target by an attacker other than you has advantage if the attack is made before the start of your next turn.</p>\n<hr />\n<h4><strong>MANEUVERING ATTACK</strong></h4>\n<p>When you hit a creature with a weapon attack, you can expend one superiority die to maneuver one of your allies into a more advantageous position. You add the superiority die to the attack&rsquo;s damage roll, and you choose a friendly creature who can see or hear you.</p>\n<p>That creature can use its reaction to move up to half its speed without provoking opportunity attacks from the target of your attack.</p>\n<hr />\n<h4><strong>PUSHING ATTACK</strong></h4>\n<p>When you hit a creature with a weapon attack, you can expend one superiority die to attempt to drive the target back. You add the superiority die to the attack&rsquo;s damage roll, and if the target is Large or smaller, it must make a Strength saving throw. On a failed save, you push the target up to 15 feet away from you.</p>\n<hr />\n<h4><strong>RIPOSTE</strong></h4>\n<p>When a creature misses you with a melee attack, you can use your reaction and expend one superiority die to make a melee weapon attack against the creature. If you hit, you add the superiority die to the attack&rsquo;s damage roll.</p>\n<hr />\n<h4><strong>SCHOLAR&rsquo;S PARRY</strong></h4>\n<p>When a creature damages you with a weapon attack, you can use your reaction and expend one superiority die to reduce the damage by the number you roll on your superiority die + your Intelligence modifier.</p>\n<hr />\n<h4><strong>TARGETED ATTACK</strong></h4>\n<p>When you make a weapon attack roll, you can expend one superiority die to add it to the roll. You can use this maneuver before or after making the attack roll, but before any effects of the attack are applied.</p>\n<hr />\n<h4><strong>TRIP ATTACK</strong></h4>\n<p>When you hit a creature with a weapon attack, you can expend one superiority die to attempt to knock the target down. You add the superiority die to the attack&rsquo;s damage roll, and if the target is Large or smaller, it must make a Strength saving throw. On a failed save, you knock the target prone.</p>\n</blockquote>",
            "chat": "",
            "unidentified": ""
        },
        "source": "PHB",
        "activation": {
            "type": "",
            "cost": 0,
            "condition": ""
        },
        "duration": {
            "value": null,
            "units": ""
        },
        "target": {
            "value": null,
            "width": null,
            "units": "",
            "type": ""
        },
        "range": {
            "value": null,
            "long": null,
            "units": ""
        },
        "uses": {
            "value": 0,
            "max": 0,
            "per": null
        },
        "consume": {
            "type": "",
            "target": null,
            "amount": null
        },
        "ability": null,
        "actionType": "",
        "attackBonus": 0,
        "chatFlavor": "",
        "critical": null,
        "damage": {
            "parts": [],
            "versatile": ""
        },
        "formula": "",
        "save": {
            "ability": "",
            "dc": null,
            "scaling": "power"
        },
        "className": "",
        "requirements": "",
        "recharge": {
            "charged": false,
            "value": null
        }
    },
    "flags": {},
    "img": "icons/svg/mystery-man.svg",
    "effects": []
}