{
    "_id": "3wNWE9KjkFD76PuW",
    "name": "Droid Companion",
    "permission": {
        "default": 0,
        "lwoKvFakziGOHjXS": 3
    },
    "type": "classfeature",
    "data": {
        "description": {
            "value": "<p>Also at 3rd level, you learn to employ all the knowledge you&rsquo;ve accumulated to create and customize your own personalized droid companion.</p>\n<p>Choose your droid, which is detailed at the end of this discipline. Over the course of 8 hours, which can be done during a long rest, you can expend 500 cr worth of materials to finally finish your droid.</p>\n<p>If your droid is irreparably destroyed, or you want to interface with a different droid, you can spend an additional 250 credits and 1 hour to change the target of this feature. You may only have one droid companion at a time.</p>\n<p>Your droid gains a variety of benefits while it is interfaced with you:</p>\n<ul>\n<li>The droid obeys your commands as best it can. It acts on your turn, and you determine its actions, decisions, attitudes, and so on. If you are incapacitated or absent, your droid acts on its own.</li>\n<li>Your droid&rsquo;s level equals your engineer level, and for each engineer level you gain after 3rd, your droid companion gains an additional Hit Die and increases its hit points accordingly.</li>\n<li>Your droid has the proficiency bonus of a player character of the same level.</li>\n<li>Whenever you gain the Ability Score Improvement feature in this class, your droid&rsquo;s abilities also improve. Your droid can increase one ability score of your choice by 2, or it can increase two ability scores of your choice by 1. As normal, your droid can&rsquo;t increase an ability score above 20 using this feature unless its description specifies otherwise.</li>\n<li>Your droid can not wear armor, but you can have the armor professionally integrated into its chassis. Over the course of a long rest, you can expend materials equal to half the cost of the armor in order to integrate it into your droid. Your droid must be proficient in armor in order to have it integrated.</li>\n<li>Your droid is a valid target of the&nbsp;tracker droid interface&nbsp;tech power.</li>\n</ul>\n<p>Additionally, you can modify your droid. Your droid companion has 4 modification slots, and it gains more at higher levels, as shown in the Modification Slots column of the engineer table. For each modification installed, your tech point maximum is reduced by 1. Over the course of a long rest, you can replace or remove a number of modifications up to your Intelligence modifier (minimum of one).</p>\n<h1>GENERATING YOUR DROID</h1>\n<p>Choosing your droid companion is an integral part of being an Astrotech Engineer. The class of droid you choose determines their features. Class I through V droids are all appropriate options, with their statistics listed below.</p>\n<p>Once you&rsquo;ve selected your type of droid class, you assign your droid&rsquo;s ability scores using standard array (16, 14, 14, 12, 10, 8) as you see fit.</p>\n<hr />\n<h2>DROID FEATURES</h2>\n<p>All droids share the following features.</p>\n<blockquote>\n<div><strong>RESISTANCES AND VULNERABILITIES</strong></div>\n<div><hr />\n<ul>\n<li>Droid Resistances:&nbsp;Your droid is resistant to necrotic, poison, and psychic damage, and immune to poison and disease.</li>\n<li>Droid Vulnerabilities:&nbsp;Your droid is vulnerable to ion damage. Additionally, your droid has disadvantage on saving throws against effects that would deal ion or lightning damage.</li>\n</ul>\n</div>\n<div><strong>TRAITS</strong></div>\n<div><hr /></div>\n<ul>\n<li>\n<div>Creature Type:&nbsp;Droid</div>\n</li>\n<li>\n<div>Armor Integration:&nbsp;Your droid can not wear armor, but you can have the armor professionally integrated into its chassis. Over the course of a long rest, you can expend materials equal to half the cost of the armor in order to have it integrated. This work must be done by someone proficient with astrotech&rsquo;s implements. Your droid must be proficient in armor in order to have it integrated.</div>\n</li>\n<li>\n<div>Droid Systems:&nbsp;Your droid does not need to eat or drink.</div>\n</li>\n</ul>\n</blockquote>\n<h2>CLASS I DROID</h2>\n<blockquote>\n<div>Class I droids are programmed for the mathematical, medical, or physical sciences. Subcategories of the first degree are medical droids, biological science droids, physical science droids, and mathematics droids.</div>\n<div>As a class I droid, your droid companion has the following features.</div>\n<div><strong>HIT POINTS</strong></div>\n<div><hr />\n<ul>\n<li>Hit Dice:&nbsp;1d8 per class I droid level</li>\n<li>Hit Points at 1st Level:&nbsp;8 + your droid&rsquo;s Constitution modifier</li>\n<li>Hit Points at Higher Levels:&nbsp;1d8 (or 5) + your droid&rsquo;s Constitution modifier per class I droid level after 1st</li>\n</ul>\n</div>\n<div><strong>PROFICIENCIES</strong></div>\n<div><hr />\n<ul>\n<li>Armor:&nbsp;Light armor plating</li>\n<li>Weapons:&nbsp;Simple blasters, simple vibroweapons</li>\n<li>Tools:&nbsp;None</li>\n</ul>\n<hr />\n<ul>\n<li>Languages:&nbsp;Class I droids can speak, read, and write Galactic Basic and one language of your choice. They can understand spoken and written Binary, but can not speak it</li>\n<li>Saving Throws:&nbsp;Wisdom, Intelligence</li>\n<li>Skills:&nbsp;Two Intelligence, Wisdom, or Charisma skills of your choice</li>\n</ul>\n</div>\n<div><strong>FEATURES</strong></div>\n<div><hr /></div>\n<ul>\n<li>\n<div>Size:&nbsp;Medium</div>\n</li>\n<li>\n<div>Speed:&nbsp;25 ft.</div>\n</li>\n</ul>\n</blockquote>\n<h2>CLASS II DROID</h2>\n<blockquote>\n<div>Class II droids are programmed for engineering and other technical sciences. They differ from class I droids because they apply the science to real-life situations. Class II droids are rarely equipped with Basic vocabulators, instead communicating through Binary. There are five subcategories of class II droids. Astromech, exploration, environmental, engineering, and maintenance droids are all class II<br />droids.</div>\n<div>As a class II droid, your droid companion has the following features.</div>\n<div><strong>HIT POINTS</strong></div>\n<div><hr />\n<ul>\n<li>Hit Dice:&nbsp;1d6 per class II droid level</li>\n<li>Hit Points at 1st Level:&nbsp;6 + your droid&rsquo;s Constitution modifier</li>\n<li>Hit Points at Higher Levels:&nbsp;1d6 (or 4) + your droid&rsquo;s Constitution modifier per class II droid level after 1st</li>\n</ul>\n</div>\n<div><strong>PROFICIENCIES</strong></div>\n<div><hr />\n<ul>\n<li>Armor:&nbsp;Light armor, medium armor</li>\n<li>Weapons:&nbsp;Simple blasters and simple vibroweapons with the light property</li>\n<li>Tools:&nbsp;Your choice of demolition&rsquo;s kit, security kit, or slicer&rsquo;s kit</li>\n</ul>\n<hr />\n<ul>\n<li>Languages:&nbsp;Class II droids can speak, read, and write Binary. They can understand spoken and written Galactic Basic and one language of your choice, but can not speak it</li>\n<li>Saving Throws:&nbsp;Dexterity, Intelligence</li>\n<li>Skills:&nbsp;Two of your choice</li>\n</ul>\n</div>\n<div><strong>FEATURES</strong></div>\n<div><hr /></div>\n<ul>\n<li>\n<div>Size:&nbsp;Small</div>\n</li>\n<li>\n<div>Speed:&nbsp;25 ft.</div>\n</li>\n</ul>\n</blockquote>\n<h2>CLASS III DROID</h2>\n<blockquote>\n<div>Class III droids are programmed to interact with humans. They are said to be the most advanced droids ever invented. Protocol, servant, tutor, and child care droids are all class III droids.</div>\n<div>As a class III droid, your droid companion has the following features.</div>\n<div><strong>HIT POINTS</strong></div>\n<div><hr />\n<ul>\n<li>Hit Dice:&nbsp;1d8 per class III droid level</li>\n<li>Hit Points at 1st Level:&nbsp;8 + your droid&rsquo;s Constitution modifier</li>\n<li>Hit Points at Higher Levels:&nbsp;1d8 (or 5) + your droid&rsquo;s Constitution modifier per class III droid level after 1st</li>\n</ul>\n</div>\n<div><strong>PROFICIENCIES</strong></div>\n<div><hr />\n<ul>\n<li>Armor:&nbsp;Light armor</li>\n<li>Weapons:&nbsp;Simple blasters, simple vibroweapons</li>\n<li>Tools:&nbsp;None</li>\n</ul>\n<hr />\n<ul>\n<li>Languages:&nbsp;Class III droids can speak and understand all registered languages</li>\n<li>Saving Throws:&nbsp;Wisdom, Charisma</li>\n<li>Skills:&nbsp;None</li>\n</ul>\n</div>\n<div><strong>FEATURES</strong></div>\n<div><hr /></div>\n<ul>\n<li>\n<div>Size:&nbsp;Medium</div>\n</li>\n<li>\n<div>Speed:&nbsp;25 ft.</div>\n</li>\n</ul>\n</blockquote>\n<h2>CLASS IV DROID</h2>\n<blockquote>\n<div>Class IV droids are programmed for military and security purposes. Such droids tend to perform tasks of violence or combat might be expected. Almost all class IV droids carry weapons. Armed combat droids are among the first droids ever created. Security, gladiator, battle, and assassin droids are all class IV droids.</div>\n<div>As a class IV droid, your droid companion has the following features.</div>\n<div><strong>HIT POINTS</strong></div>\n<div><hr />\n<ul>\n<li>Hit Dice:&nbsp;1d8 per class IV droid level</li>\n<li>Hit Points at 1st Level:&nbsp;8 + your droid&rsquo;s Constitution modifier</li>\n<li>Hit Points at Higher Levels:&nbsp;1d8 (or 5) + your droid&rsquo;s Constitution modifier per class IV droid level after 1st</li>\n</ul>\n</div>\n<div><strong>PROFICIENCIES</strong></div>\n<div><hr />\n<ul>\n<li>Armor:&nbsp;All armor</li>\n<li>Weapons:&nbsp;All blasters, All vibroweapons</li>\n<li>Tools:&nbsp;None</li>\n</ul>\n<hr />\n<ul>\n<li>Languages:&nbsp;Class IV droids can speak, read, and write Galactic Basic and one language of your choice. They can understand spoken and written Binary, but can not speak it</li>\n<li>Saving Throws:&nbsp;Strength, Dexterity</li>\n<li>Skills:&nbsp;None</li>\n</ul>\n</div>\n<div><strong>FEATURES</strong></div>\n<div><hr /></div>\n<ul>\n<li>\n<div>Size:&nbsp;Medium</div>\n</li>\n<li>\n<div>Speed:&nbsp;30 ft.</div>\n</li>\n</ul>\n</blockquote>\n<h2>CLASS V DROID</h2>\n<blockquote>\n<div>Class V droids are programmed for menial and low-skill tasks. Such droids tend to perform basic tasks such as construction, lifting, maintenance, mining, sanitation, and transportation.</div>\n<div>As a class V droid, your droid companion has the following features.</div>\n<div><strong>HIT POINTS</strong></div>\n<div><hr />\n<ul>\n<li>Hit Dice:&nbsp;1d8 per class V droid level</li>\n<li>Hit Points at 1st Level:&nbsp;8 + your droid&rsquo;s Constitution modifier</li>\n<li>Hit Points at Higher Levels:&nbsp;1d8 (or 5) + your droid&rsquo;s Constitution modifier per class V droid level after 1st</li>\n</ul>\n</div>\n<div><strong>PROFICIENCIES</strong></div>\n<div><hr />\n<ul>\n<li>Armor:&nbsp;Light armor, medium armor</li>\n<li>Weapons:&nbsp;All vibroweapons, simple blasters</li>\n<li>Tools:&nbsp;One set of artisan&rsquo;s implements</li>\n</ul>\n<hr />\n<ul>\n<li>Languages:&nbsp;Class V droids can speak, read, and write Binary. They can understand spoken and written Galactic Basic and one language of your choice, but can not speak it</li>\n<li>Saving Throws:&nbsp;Strength, Constitution</li>\n<li>Skills:&nbsp;Athletics</li>\n</ul>\n</div>\n<div><strong>FEATURES</strong></div>\n<div><hr /></div>\n<ul>\n<li>\n<div>Size:&nbsp;Medium</div>\n</li>\n<li>\n<div>Speed:&nbsp;30 ft.</div>\n</li>\n</ul>\n</blockquote>\n<h1>ASTROTECH MODIFICATIONS</h1>\n<p>If a modification has prerequisites, you must meet them to install it. You can install the modification at the same time that you meet its prerequisites.</p>\n<hr />\n<blockquote>\n<h4><strong>ADVANCED POWER CORE</strong></h4>\n<p><em><strong>Prerequisite</strong>:&nbsp;7th level, d10 Hit Die</em><br />Your droid&rsquo;s hit points increase by an amount equal to its level + 1 and its Hit Die becomes a d12.</p>\n<hr />\n<h4><strong>ALARM PROTOCOL</strong></h4>\n<p>You install an alarm module in your droid, granting the following benefits:</p>\n<ul>\n<li>Your droid grants a +5 bonus to initiative to creatures within 5 feet of it.</li>\n<li>You and your droid can&rsquo;t be surprised while your droid is conscious.</li>\n</ul>\n<hr />\n<h4><strong>ANALYSIS PROTOCOL</strong></h4>\n<p><em><strong>Prerequisite</strong>:&nbsp;7th level, Class I Droid</em><br />Your droid can analyze a target, develop a plan on how to best overcome any potential obstacle, and execute that plan with ruthless efficiency. As a bonus action on your droid&rsquo;s turn, your droid can analyze a target it can see within 60 feet of it. For the next minute, or until it analyzes another target, it gains the following benefits:</p>\n<ul>\n<li>When it analyzes a hostile creature, its attack and damage rolls made with weapons with the finesse property or blaster weapons against that target may use its Intelligence modifier instead of Strength or Dexterity.</li>\n<li>When it analyzes a friendly creature, the target can end your droid&rsquo;s Analysis Protocol on them (no action required) to add half your droid&rsquo;s Intelligence modifier (rounded down, minimum of +1) to one attack roll, ability check, or saving throw. Once a friendly creature has benefited from this ability, they can not do so again until they complete a short or long rest.</li>\n</ul>\n<hr />\n<h4><strong>ARM CANNONS</strong></h4>\n<p>You install dual arm cannons in your droid. The arm cannons have 2 charges. As an action, your droid can use charges to cast the&nbsp;overload&nbsp;tech power, using 1 charge per level. The saving throw is made against your droid&rsquo;s tech save DC (8 + your droid&rsquo;s proficiency bonus + your droid&rsquo;s Intelligence modifier).</p>\n<p>You can choose this modification multiple times. Each time you do so, the arm cannons gain another charge, to a maximum of 4. The arm cannons regain all charges after a long rest.</p>\n<hr />\n<h4><strong>BACK-UP PROTOCOL</strong></h4>\n<p><em><strong>Prerequisite</strong>:&nbsp;7th level</em><br />You install an emergency protocol in your droid, prompting a quick reboot after critical damage is taken. If your droid would be reduced to 0 hit points, it instead is reduced to 1.</p>\n<p>Once your droid uses this feature, it must finish a short or long rest before it can use it again.</p>\n<hr />\n<h4><strong>CELERITY AUGMENT</strong></h4>\n<p>You augment your droid to move a little faster. Your droid&rsquo;s speed increases by 5 feet.</p>\n<p>You can choose this modification twice.</p>\n<hr />\n<h4><strong>CHARISMA CHIP</strong></h4>\n<p><em><strong>Prerequisite</strong>:&nbsp;Class III Droid</em><br />You install a charisma chip in your droid. When an ally your droid can see makes an ability check, attack roll, or saving throw, your droid can use its reaction to give them advantage on the roll. It can do so before or after they roll the d20, but before the GM says the roll succeeds or fails. Once your droid uses this ability, it can&rsquo;t use it again until it finishes a short or long rest.</p>\n<hr />\n<h4><strong>DARKVISION OPTICS</strong></h4>\n<p>Your droid has darkvision to a range of 60 feet. If your droid already has darkvision, this modification increases its range by 30 feet.</p>\n<hr />\n<h4><strong>DURABILITY MODULE</strong></h4>\n<p>You enhance your droid&rsquo;s durability, granting the following benefits:</p>\n<ul>\n<li>When your droid rolls a Hit Die to regain hit points, the minimum number of hit points your droid can regain from the roll equals twice your droid&rsquo;s Constitution modifier (minimum of 2).</li>\n<li>Your droid&rsquo;s hit point maximum increases by an amount equal to twice its level when you install this protocol. Whenever your droid gains a level thereafter, its hit point maximum increases by an additional 2 hit points.</li>\n</ul>\n<hr />\n<h4><strong>EMERGENCY MODE</strong></h4>\n<p><em><strong>Prerequisite</strong>:&nbsp;15th level</em><br /><em><strong>Prerequisite</strong>:&nbsp;Back-Up Protocol</em><br />You modify your droid&rsquo;s back-up protocol. When your droid&rsquo;s back-up protocol is initiated, it can use its reaction to make one attack roll against a target within range. If the target is the source of the damage that reduced your droid to 0, the attack roll has advantage.</p>\n<hr />\n<h4><strong>ENERGY SHIELD</strong></h4>\n<p>You install an energy shield in your droid, which has 1 charge. As an action, your droid can use 1 charge to cast the&nbsp;energy shield&nbsp;tech power.</p>\n<p>You can choose this modification multiple times. Each time you do so, the energy shield gains another charge, to a maximum of 3. The energy shield regains all expended charges after a long rest.</p>\n<hr />\n<h4><strong>EXPERTISE PROTOCOL</strong></h4>\n<p><em><strong>Prerequisite</strong>:&nbsp;5th level</em><br />You install a protocol in your droid that grants it expertise in a tool or skill in which it is proficient.</p>\n<hr />\n<h4><strong>FALSE COMBUSTION</strong></h4>\n<p><em><strong>Prerequisite</strong>:&nbsp;Class II Droid</em><br />As a reaction in response to taking damage, your droid can feign an explosion. For 1 minute, it appears to be destroyed to all outward inspection. A creature can use its action to inspect your droid and make an Intelligence (Investigation) check (DC = 8 + your droid&rsquo;s proficiency bonus + your droid&rsquo;s Intelligence modifier). If it succeeds, it becomes aware that your droid still functions.</p>\n<hr />\n<h4><strong>FIGHTING STYLE PROTOCOL</strong></h4>\n<p>Your droid adopts a particular style of fighting as its specialty. Choose one of the fighting style options, detailed in chapter 6. Your droid can&rsquo;t take a Fighting Style option more than once, even if it later gets to choose again.</p>\n<hr />\n<h4><strong>FLAMETHROWER</strong></h4>\n<p>You install a flamethrower in your droid. The flamethrower has 1 charge. As an action, your droid can cast the&nbsp;jet of flame&nbsp;tech power, though it does not scale with higher levels, or use 1 charge to cast the&nbsp;flame sweep&nbsp;tech power at 1st level. The saving throw is made against your droid&rsquo;s tech save DC (8 + your droid&rsquo;s proficiency bonus + your droid&rsquo;s Intelligence modifier).</p>\n<p>You can choose this modification multiple times. Each time you do so, the flamethrower gains another charge, to a maximum of 3. If the flamethrower has multiple charges, you can use multiple charges to cast&nbsp;flame sweep&nbsp;at a higher level, 1 point per charge. The flamethrower regains all expended charges after a long rest.</p>\n<hr />\n<h4><strong>FOUR-ARMED COMBATANT</strong></h4>\n<p><em><strong>Prerequisite</strong>:&nbsp;Class IV Droid</em><br />You install two additional arms to improve your droid&rsquo;s combat capabilities, granting it four arms which it can use independently of one another. Your droid can only gain the benefit of items held by two of its arms at any given time, and once per round your droid can switch which arms it is benefiting from (no action required).</p>\n<p>While your droid has at least 3 arms free, it has a climbing speed equal to its walking speed.</p>\n<hr />\n<h4><strong>HEAVY PLATING</strong></h4>\n<p><em><strong>Prerequisite</strong>:&nbsp;Medium Armor proficiency</em><br />Your droid gains proficiency in heavy armor. If your droid is already proficient in heavy armor, instead critical hits are treated as normal hits against it.</p>\n<hr />\n<h4><strong>LIGHT PLATING</strong></h4>\n<p>Your droid gains proficiency in light armor. If your droid is already proficient in light armor, instead your droid&rsquo;s speed increases by 5 feet while light armor is integrated.</p>\n<hr />\n<h4><strong>MARTIAL PROTOCOL</strong></h4>\n<p><em><strong>Prerequisite</strong>:&nbsp;7th level, Class IV Droid</em><br />Your droid has martial training that allows it to perform special combat maneuvers. It gains the following benefits:</p>\n<ul>\n<li>It learns two maneuvers of your choice from among those available to the fighter class. If a maneuver it uses requires its target to make a saving throw to resist the maneuver&rsquo;s effects, the saving throw DC equals 8 + your droid&rsquo;s proficiency bonus + your droid&rsquo;s Strength or Dexterity modifier (your choice).</li>\n<li>Your droid has two superiority dice, which are d4s. These dice are used to fuel its maneuvers. A superiority die is expended when your droid uses it. It regain all of its expended superiority dice when you finish a short or long rest.</li>\n</ul>\n<hr />\n<h4><strong>MEDIUM PLATING</strong></h4>\n<p><em><strong>Prerequisite</strong>:&nbsp;Light Armor proficiency</em><br />Your droid gains proficiency in medium armor. If your droid is already proficient in medium armor, the maximum Dexterity bonus your droid can add to AC increases to 3 from 2 while medium armor is integrated.</p>\n<hr />\n<h4><strong>MEMORY PROTOCOL</strong></h4>\n<p><em><strong>Prerequisite</strong>:&nbsp;Class I Droid</em><br />Your droid can recall anything it has read in the past month that it understood. This includes but is not limited to books, maps, signs, and lists.</p>\n<hr />\n<h4><strong>OBSERVANT PROTOCOL</strong></h4>\n<p><em><strong>Prerequisite</strong>:&nbsp;7th level</em><br /><em><strong>Prerequisite</strong>:&nbsp;Alarm Protocol</em><br />You modify the alarm module in your droid, granting the following benefits:</p>\n<ul>\n<li>If your droid can see a creature&rsquo;s mouth while it is speaking a language it understands, your droid can interpret what it&rsquo;s saying by reading its lips.</li>\n<li>Your droid is considered to have advantage when determining its passive Wisdom (Perception) and passive Intelligence (Investigation) scores.</li>\n</ul>\n<hr />\n<h4><strong>PERFORMANCE PROTOCOL</strong></h4>\n<p><em><strong>Prerequisite</strong>:&nbsp;7th level, Class III Droid</em><br />You modify your droid&rsquo;s charisma chip, granting the following benefits:</p>\n<ul>\n<li>Your droid has advantage on Charisma (Performance) checks.</li>\n<li>Your droid can also use its bonus action to motivate an ally within 30 feet of it. Until the start of your droid&rsquo;s next turn, the ally can add the droid&rsquo;s Charisma modifier (minimum of +1) to the first attack roll, ability check, or saving throw they make. Your droid can use this feature a number of time equal to its Charisma modifier, and it regains all expended uses after it completes a long rest.</li>\n</ul>\n<hr />\n<h4><strong>POWERFUL DROID</strong></h4>\n<p><em><strong>Prerequisite</strong>:&nbsp;Class V Droid</em><br />Your droid&rsquo;s carrying capacity and the weight it can push, drag, or lift doubles. If it would already double, it instead triples.</p>\n<hr />\n<h4><strong>POWERFUL GRIP</strong></h4>\n<p><em><strong>Prerequisite</strong>:&nbsp;7th level, Class V Droid</em><br />When your droid hits a creature with a melee weapon attack on its turn and has a free hand, it can use a bonus action to attempt to grapple the target. If it does so, and the grapple succeeds, your droid can make one additional attack against the target (no action required).</p>\n<hr />\n<h4><strong>PREMIUM POWER CORE</strong></h4>\n<p><em><strong>Prerequisite</strong>:&nbsp;d6 Hit Die</em><br />Your droid&rsquo;s hit points increase by an amount equal to its level + 1 and its Hit Die becomes a d8.</p>\n<hr />\n<h4><strong>PROFICIENCY PROTOCOL</strong></h4>\n<p>You install a protocol in your droid that grants it proficiency in a tool or skill. Your droid gains proficiency in a tool or skill of your choice.</p>\n<p>You can choose this modification multiple times.</p>\n<hr />\n<h4><strong>PROTOTYPE POWER CORE</strong></h4>\n<p><em><strong>Prerequisite</strong>:&nbsp;d8 Hit Die</em><br />Your droid&rsquo;s hit points increase by an amount equal to its level + 1 and its Hit Die becomes a d10.</p>\n<hr />\n<h4><strong>REPULSOR COIL</strong></h4>\n<p><em><strong>Prerequisite</strong>:&nbsp;7th level, Class II Droid</em><br />You install repulsor coils in your droid&rsquo;s legs. Your droid gains a flying speed equal to its walking speed.</p>\n<hr />\n<h4><strong>SENSOR AUGMENTATION</strong></h4>\n<p>You augment your droid with an advanced sensor, granting the following benefits:</p>\n<ul>\n<li>Your droid has advantage on Wisdom (Perception) and Intelligence (Investigation) checks made to detect the presence of secret doors.</li>\n<li>Your droid has advantage on saving throws made to avoid or resist traps.</li>\n<li>Your droid has resistance to the damage dealt by traps.</li>\n<li>Your droid can search for traps while traveling at a normal pace, instead of only at a slow pace.</li>\n</ul>\n<hr />\n<h4><strong>STUN RAY</strong></h4>\n<p>You install a stun ray in your droid. The stun ray has 1 charge. As an action, your droid can use 1 charge to cast the&nbsp;hold droid&nbsp;or&nbsp;paralyze humanoid&nbsp;tech power. The saving throw is made against your droid&rsquo;s tech save DC (8 + your droid&rsquo;s proficiency bonus + your droid&rsquo;s Intelligence modifier).</p>\n<p>You can choose this modification multiple times. Each time you do so, the stun ray gains another charge, to a maximum of 3. The stun ray regains all expended charges after a long rest.</p>\n<hr />\n<h4><strong>TECHCASTING PROTOCOL</strong></h4>\n<p>Your droid learns one at-will tech power and one 1st-level tech power, which it can cast at its lowest level once per long rest. Your droid&rsquo;s techcasting ability is Intelligence. It does not require use of a wristpad for these powers. At-will powers chosen in this way do not scale with higher levels.</p>\n<hr />\n<h4><strong>TOUGHNESS MODULE</strong></h4>\n<p><em><strong>Prerequisite</strong>:&nbsp;11th level</em><br /><em><strong>Prerequisite</strong>:&nbsp;Durability Module</em><br />You modify the durability module in your droid, granting the following benefit:</p>\n<ul>\n<li>Your droid becomes proficient in Constitution saving throws. If it is already proficient, it becomes proficient in another saving throw of your choice.</li>\n<li>Whenever your droid takes the Dodge action in combat, it can spend one Hit Die to heal itself. Roll the die, add its Constitution modifier, and it regains a number of hit points equal to the total (minimum of one).</li>\n</ul>\n<hr />\n<h4><strong>TRUESIGHT OPTICS</strong></h4>\n<p><em><strong>Prerequisite</strong>:&nbsp;11th level</em><br /><em><strong>Prerequisite</strong>:&nbsp;Darkvision Optics</em><br />Your droid can see through illusions and detect invisibility within 30 feet, as with truesight.</p>\n</blockquote>",
            "chat": "",
            "unidentified": ""
        },
        "source": "EC",
        "activation": {
            "type": "",
            "cost": 0,
            "condition": ""
        },
        "duration": {
            "value": null,
            "units": ""
        },
        "target": {
            "value": null,
            "width": null,
            "units": "",
            "type": ""
        },
        "range": {
            "value": null,
            "long": null,
            "units": ""
        },
        "uses": {
            "value": 0,
            "max": 0,
            "per": null
        },
        "consume": {
            "type": "",
            "target": null,
            "amount": null
        },
        "ability": null,
        "actionType": "",
        "attackBonus": 0,
        "chatFlavor": "",
        "critical": null,
        "damage": {
            "parts": [],
            "versatile": ""
        },
        "formula": "",
        "save": {
            "ability": "",
            "dc": null,
            "scaling": "power"
        },
        "className": "",
        "requirements": "",
        "recharge": {
            "charged": false,
            "value": null
        }
    },
    "flags": {},
    "img": "icons/svg/mystery-man.svg",
    "effects": []
}