{
    "_id": "f34HJgbp7fw5ryET",
    "name": "Elemental Master",
    "permission": {
        "default": 0,
        "lwoKvFakziGOHjXS": 3
    },
    "type": "classfeature",
    "data": {
        "description": {
            "value": "<p><strong><em>Monk: Kro Var Order:&nbsp;11th and 17th level</em></strong></p>\n<p>At 11th level, you gain one of the following features. You gain an additional option at 17th level.</p>\n<p>You can use these features a combined number of times equal to half your proficiency bonus, as shown in the monk table. You regain all expended uses when you complete a long rest.</p>\n<p>While you have no remaining uses of this feature, you can instead expend 3 focus points to use it. When you do so, your maximum focus points are reduced by 3 until you complete a long rest.</p>\n<hr />\n<blockquote>\n<h3><strong>Earth Reaches for Sky</strong></h3>\n<p><strong><em>Prerequisite:&nbsp;Crushing Hand of the Mountain or Patient Bantha Listens</em></strong></p>\n<p>As an action, you can choose a point you can see on the ground within 120 feet. A fountain of churned earth and stone erupts in a 20-foot cube centered on that point. Each creature in that area must make a Dexterity saving throw. A creature takes 3d12 kinetic damage on a failed save, or half as much damage on a successful one. Additionally, the ground in that area becomes difficult terrain until cleared. Each 5-foot-square portion of the area requires at least 1 minute to clear by hand.</p>\n<hr />\n<h3><strong>Ride the Wind</strong></h3>\n<p><strong>Prerequisite:&nbsp;<em>Curtain of Unyielding Wind or Rush of the Shyrack</em></strong></p>\n<p>As an action, you can gain a flying speed equal to your movement speed for 10 minutes. You can hover while this technique is active, but when it ends, you fall if you are still aloft, unless you can stop the fall.</p>\n<hr />\n<h3><strong>River of Hungry Flame</strong></h3>\n<p><em><strong>Prerequisite:&nbsp;Burning Ember Flourish or Hatchling's Flame</strong></em></p>\n<p>As an action, you can create a wall of fire on a solid surface within 120 feet. You can make the wall up to 60 feet long, 20 feet high, and 1 foot thick, or a ringed wall up to 20 feet in diameter, 20 feet high, and 1 foot thick. The wall is opaque and lasts for 1 minute.</p>\n<p>When the wall appears, each creature within its area must make a Dexterity saving throw. On a failed save, a creature takes 5d8 fire damage, or half as much damage on a successful save.</p>\n<p>One side of the wall, chosen by you when you use this feature, deals 5d8 fire damage to each creature that ends its turn within 10 feet of that side of the wall. A creature takes the same damage when it enters the wall for the first time on a turn or ends its turn there. The other side of the wall deals no damage.</p>\n<hr />\n<h3><strong>Shape the Flowing River</strong></h3>\n<p><em><strong>Prerequisite:&nbsp;Shape the Raincloud or Swarming Ice Rabbit</strong></em></p>\n<div>As an action, you can control any freestanding water within 300 feet of you inside an area you choose that is a cube up to 100 feet on a side. You can choose from any of the following effects when you use this feature. As an action on your turn, you can repeat the same effect or choose a different one.</div>\n<div>&nbsp;</div>\n&nbsp;&nbsp;<strong>Flood</strong>.&nbsp;You cause the water level of all standing water in the area to rise by as much as 20 feet. If the area includes a shore, the flooding water spills over onto dry land. If you choose an area in a large body of water, you instead create a 20-foot tall wave that travels from one side of the area to the other and then crashes down. Any Huge or smaller creatures in the wave's path are carried with it to the other side. Any Huge or smaller creatures struck by the wave have a 25 percent chance of being knocked prone. The water level remains elevated until the feature ends or you choose a different effect. If this effect produced a wave, the wave repeats on the start of your next turn while the flood effect lasts.\n<div>&nbsp;</div>\n&nbsp;&nbsp;<strong>Part Water</strong>.&nbsp;You cause water in the area to move apart and create a trench. The trench extends across the feature's area, and the separated water forms a wall to either side. The trench remains until the feature ends or you choose a different effect. The water then slowly fills in the trench over the course of the next round until the normal water level is restored.\n<div>&nbsp;</div>\n&nbsp;&nbsp;<strong>Redirect Flow</strong>.&nbsp;You cause flowing water in the area to move in a direction you choose, even if the water has to flow over obstacles, up walls, or in other unlikely directions. The water in the area moves as you direct it, but once it moves beyond the feature's area, it resumes its flow based on the terrain conditions. The water continues co move in the direction you chose until the feature ends or you choose a different effect.\n<div>&nbsp;</div>\n&nbsp;&nbsp;<strong>Whirlpool</strong>.&nbsp;This effect requires a body of water at least 50 feet square and 25 feet deep. You cause a whirlpool to form in the center of the area. The whirlpool forms a vortex that is 5 feet wide at the base, up to 50 feet wide at the top, and 25 feet tall. Any creature or object in the water and within 25 feet of the vortex is pulled 10 feet toward it. A creature can swim away from the vortex by making a Strength (Athletics) check against your feature save DC. When a creature enters the vortex for the first time on a turn or starts its turn there, it must make a Strength saving throw. On a failed save, the creature takes 2d8 kinetic damage and is caught in the vortex until the feature ends. On a successful save, the creature takes half damage, and isn't caught in the vortex. A creature caught in the vortex can use its action to try to swim away from the vortex as described above, but has disadvantage on the Strength (Athletics) check to do so. The first time each turn that an object enters the vortex, the object takes 2d8 kinetic damage; this damage occurs each round it remains in the vortex.</blockquote>",
            "chat": "",
            "unidentified": ""
        },
        "source": "EC",
        "activation": {
            "type": "",
            "cost": 0,
            "condition": ""
        },
        "duration": {
            "value": null,
            "units": ""
        },
        "target": {
            "value": null,
            "width": null,
            "units": "",
            "type": ""
        },
        "range": {
            "value": null,
            "long": null,
            "units": ""
        },
        "uses": {
            "value": 0,
            "max": 0,
            "per": null
        },
        "consume": {
            "type": "",
            "target": null,
            "amount": null
        },
        "ability": null,
        "actionType": "",
        "attackBonus": 0,
        "chatFlavor": "",
        "critical": null,
        "damage": {
            "parts": [],
            "versatile": ""
        },
        "formula": "",
        "save": {
            "ability": "",
            "dc": null,
            "scaling": "power"
        },
        "className": "",
        "requirements": "",
        "recharge": {
            "charged": false,
            "value": null
        }
    },
    "flags": {},
    "img": "icons/svg/mystery-man.svg",
    "effects": []
}