{
    "_id": "3wmpa2PloRYvU2na",
    "name": "Out of Touch",
    "permission": {
        "default": 0,
        "lwoKvFakziGOHjXS": 3
    },
    "type": "classfeature",
    "data": {
        "description": {
            "value": "<p>At 7th level, as an action, you can step out of sync with the rest of the universe for 1 minute. At the start of each of your turns, roll a d20. If you roll 11 or higher, you and everything your are wearing or carrying are completely invisible to all beings, except for those with truesight. On a roll of 10 or lower, you instead appear as an indistinguishably blurred form roughly your normal height and weight, though a being with truesight sees you normally. Regardless of your appearance, for the duration, your speed doubles, you gain a flying speed equal to your walking speed, and you can move through creatures and objects willingly though you can not affect them and they can not affect you. You can end this feature early on your turn (no action required). When this effect ends, if you are inside a solid object or creature, you are immediately shunted to the nearest unoccupied space that you can occupy and take force damage equal to twice the number of feet you are moved.</p>\n<p>This effect ends early if you are incapacitated or die. Once you&rsquo;ve used this feature, you must complete a short or long rest before you can use it again.</p>\n<p>&nbsp;</p>",
            "chat": "",
            "unidentified": ""
        },
        "source": "EC",
        "activation": {
            "type": "action",
            "cost": 0,
            "condition": ""
        },
        "duration": {
            "value": 1,
            "units": "minute"
        },
        "target": {
            "value": null,
            "width": null,
            "units": "",
            "type": ""
        },
        "range": {
            "value": null,
            "long": null,
            "units": ""
        },
        "uses": {
            "value": 1,
            "max": 1,
            "per": "sr"
        },
        "consume": {
            "type": "",
            "target": "",
            "amount": null
        },
        "ability": null,
        "actionType": "",
        "attackBonus": 0,
        "chatFlavor": "",
        "critical": null,
        "damage": {
            "parts": [],
            "versatile": ""
        },
        "formula": "",
        "save": {
            "ability": "",
            "dc": null,
            "scaling": "power"
        },
        "className": "",
        "recharge": {
            "value": null,
            "charged": false
        },
        "requirements": ""
    },
    "flags": {},
    "img": "icons/svg/mystery-man.svg",
    "effects": []
}