{
    "_id": "TlH3uqCgobccF5zp",
    "name": "Projected Barrier (Scout: Bulwark)",
    "permission": {
        "default": 0,
        "lwoKvFakziGOHjXS": 3
    },
    "type": "classfeature",
    "data": {
        "description": {
            "value": "<p>Beginning at 7th level, you&rsquo;ve learned how to manipulate your barrier to create new effects. As an action, you can spend three of your barrier&rsquo;s hit points to create a unique effect. You have three such effects: Projected Sphere, Projected Maelstrom, and Projected Wave. When you use your Projected Barrier, you choose which effect to create.</p>\n<p>Some Projected Barrier Effects require saving throws. When you use such an effect from this class, the DC equals your tech save DC.</p>\n<p>If your barrier&rsquo;s hit points are reduced to 0, any Projected Barrier features immediately end.</p>\n<hr />\n<blockquote>\n<h4><strong>PROJECTED SPHERE</strong></h4>\n<p>You create a protective spherical barrier barrier in a 5-foot-radius sphere a point you can see within 30 feet that lasts until the start of your next turn. Creatures within the barrier have three-quarters cover from attacks originating from outside the barrier. You can maintain the barrier by spending an additional barrier hit point at the start of each of your turns (no action required).</p>\n<hr />\n<h4><strong>PROJECTED MAELSTROM</strong></h4>\n<p>You create an unstable energy maelstrom in a 5-foot cube at a point you can see within 30 feet that lasts until the start of your next turn. A creature takes 4d4 energy damage when it enters the area for the first time on a turn or starts its turn there. You can maintain the barrier by spending an additional barrier hit point at the start of each of your turns (no action required).</p>\n<p>This feature&rsquo;s damage increases by 1d4 when you reach 11th level (5d4) and 17th level (6d4).</p>\n<hr />\n<h4><strong>PROJECTED WAVE</strong></h4>\n<p>You create a wave of barrier energy in a 15-foot cone. Each creature within the cone must make a Dexterity saving throw. On a failed save, a creature takes 2d6 energy damage and is pushed back to the edge of the cone. On a success, they take half damage and aren&rsquo;t pushed.</p>\n<p>This feature&rsquo;s damage increases by 1d6 when you reach 11th level (3d6) and 17th level (4d6).</p>\n</blockquote>",
            "chat": "",
            "unidentified": ""
        },
        "source": "PHB",
        "activation": {
            "type": "",
            "cost": 0,
            "condition": ""
        },
        "duration": {
            "value": null,
            "units": ""
        },
        "target": {
            "value": null,
            "width": null,
            "units": "",
            "type": ""
        },
        "range": {
            "value": null,
            "long": null,
            "units": ""
        },
        "uses": {
            "value": 0,
            "max": 0,
            "per": null
        },
        "consume": {
            "type": "",
            "target": null,
            "amount": null
        },
        "ability": null,
        "actionType": "",
        "attackBonus": 0,
        "chatFlavor": "",
        "critical": null,
        "damage": {
            "parts": [],
            "versatile": ""
        },
        "formula": "",
        "save": {
            "ability": "",
            "dc": null,
            "scaling": "power"
        },
        "className": "",
        "requirements": "",
        "recharge": {
            "charged": false,
            "value": null
        }
    },
    "flags": {},
    "img": "icons/svg/mystery-man.svg",
    "effects": []
}