{
    "_id": "6dNqHrdwSTmPLbu8",
    "name": "Turret Companion",
    "permission": {
        "default": 0,
        "lwoKvFakziGOHjXS": 3
    },
    "type": "classfeature",
    "data": {
        "description": {
            "value": "<p>When you choose this technique at 3rd level, you learn to apply your knowledge of artillery to construct your own portable turret.</p>\n<p>You start with a Small turret, which is detailed at the end of this technique. Over the course of 8 hours, which can be done during a long rest, you can expend 500 cr worth of materials to finish your turret.</p>\n<p>If your turret is irreparably destroyed, you can spend an additional 500 cr worth of material and 8 hours to create a new turret. You may only have one turret companion at a time.</p>\n<p>Your turret has the following benefits:</p>\n<ul>\n<li>Your turret has a remote control, which you can use to direct it on your turn while within 120 feet of it. Your turret takes no actions unless you tell it to or an upgrade says otherwise.</li>\n<li>Your turret&rsquo;s level equals your scout level, and for each scout level you gain after 3rd, your turret companion gains an additional Hit Die and increases its hit points accordingly.</li>\n<li>Your turret has the proficiency bonus of a player character of the same level.</li>\n<li>Whenever you gain the Ability Score Improvement feature in this class, your turret&rsquo;s abilities also improve. Your turret can increase one ability score of your choice by 2, or it can increase two ability scores of your choice by 1. As normal, your turret can&rsquo;t increase an ability score above 20 using this feature unless its description specifies otherwise.</li>\n<li>Your turret is a valid target of the&nbsp;tracker droid interface&nbsp;tech power.</li>\n<li>When you would make a weapon attack, you can let your turret attack instead.</li>\n</ul>\n<p>Your turret has two modes: deployed and undeployed. Your turret can take no actions while undeployed. You can deploy or undeploy your turret at any time on your turn (no action required), but the effect doesn&rsquo;t occur until the start of your next turn.</p>\n<hr />\n<h2>GENERATING YOUR TURRET</h2>\n<p>Your turret is a portable companion that you can upgrade over time.</p>\n<p>Your turret uses your Intelligence, Wisdom, and Charisma scores. You assign your turret&rsquo;s Strength, Dexterity, and Constitution scores using a limited standard array (16, 14, 12) as you see fit.</p>\n<hr />\n<h2>TURRET FEATURES</h2>\n<p>All turrets share the following traits.</p>\n<h4><strong>HIT POINTS</strong></h4>\n<hr />\n<ul>\n<li>Hit Dice:&nbsp;1d6 per turret companion level</li>\n<li>Hit Points at 1st Level:&nbsp;6 + your turret&rsquo;s Constitution modifier</li>\n<li>Hit Points at Higher Levels:&nbsp;1d6 (or 4) + your turret&rsquo;s Constitution modifier per turret level after 1st</li>\n</ul>\n<h4><strong>RESISTANCES AND VULNERABILITIES</strong></h4>\n<hr />\n<ul>\n<li>Turret Resistances:&nbsp;Your turret is resistant to necrotic, poison, and psychic damage, and immune to poison and disease.</li>\n<li>Turret Vulnerabilities:&nbsp;Your turret is vulnerable to ion damage. Additionally, your turret has disadvantage on saving throws against effects that would deal ion or lightning damage.</li>\n</ul>\n<h4><strong>FEATURES</strong></h4>\n<hr />\n<ul>\n<li>Armor Class:&nbsp;Your turret uses its Intelligence score for its Armor Class.</li>\n<li>Integrated Weaponry:&nbsp;Your turret has an integrated vibroweapon and blaster with which it can make weapon attacks. Neither weapon can be removed while your turret is not disabled. Your turret&rsquo;s vibroweapon deals 1d8 kinetic damage on a hit. Your turret&rsquo;s blaster has the ammunition (range 100/400) and reload 20 properties, and it deals 1d6 kinetic or energy damage on it a hit, depending on its loaded ammunition. It can use both slug cartridges and power cells for ammunition. Your turret can&rsquo;t reload itself. You can choose which weapon your turret uses each time it attacks (no action required).</li>\n<li>Turret Upgrades:&nbsp;Your turret companion has four turret upgrades of your choice. It gains an additional upgrade at 5th level (5), 8th level (6), 11th level (7), 14th level (8), and 17th level (9). Whenever you gain a level in this class, you can exchange one upgrade for another one.</li>\n<li>Size:&nbsp;Small</li>\n<li>Speed:&nbsp;Your turret has two modes: undeployed and deployed. While undeployed, your turret&rsquo;s speed equals your own and it can take no actions. While deployed, your turret has a speed of 25 feet and can take actions.</li>\n<li>Type:&nbsp;Construct</li>\n</ul>\n<h1>TURRET UPGRADES</h1>\n<p>If an upgrade has prerequisites, you must meet them to install it. You can install the upgrade at the same time that you meet its prerequisites.</p>\n<hr />\n<blockquote>\n<h4><strong>AUGMENTING BARRIER</strong></h4>\n<p><em><strong>Prerequisite</strong>:&nbsp;5th level</em><br />As an action, you can reduce your turret&rsquo;s speed and have it create a barrier that surrounds in a radius depending on its size. A Small turret&rsquo;s speed is reduced to 10 feet and has a 5-foot radius, a Medium turret&rsquo;s speed is reduced to 5 feet and has a 10-foot radius, and a Large turret&rsquo;s speed is to reduce to 0 and has a 15-foot radius. While active, when damage is dealt by a tech power originating from inside the barrier against a target outside the barrier, that tech power gains a bonus to damage equal to half your Intelligence modifier (rounded up).</p>\n<p>This barrier lasts for 1 minute. You can end it early as a bonus action on your turn. Once you&rsquo;ve used this feature, you must complete a short or long rest before you can use it again.</p>\n<hr />\n<h4><strong>AUTORELOAD</strong></h4>\n<p>You can preload your turret&rsquo;s blaster with additional ammunition. You can preload two additional power cells, or you can replace each power cell with 20 slug cartridges. Once on each of your turns, you can reload your turret without using an action. Once you&rsquo;ve expended the preloaded ammunition, you can&rsquo;t reload your turret&rsquo;s blaster in this way again until you reload it with an action.</p>\n<hr />\n<h4><strong>CLIMBING TURRET</strong></h4>\n<p>Your turret gains a climbing speed equal to its deployed walking speed.</p>\n<hr />\n<h4><strong>CLOAKING BARRIER</strong></h4>\n<p><em><strong>Prerequisite</strong>:&nbsp;5th level</em><br />As an action, you can reduce your turret&rsquo;s speed and have it create a barrier that surrounds in a radius depending on its size. A Small turret&rsquo;s speed is reduced to 10 feet and has a 5-foot radius, a Medium turret&rsquo;s speed is reduced to 5 feet and has a 10-foot radius, and a Large turret&rsquo;s speed is to reduce to 0 and has a 15-foot radius. While active, this barrier creates an area that is lightly obscured. Wisdom (Perception) checks that originate outside the barrier take a -10 penalty when attempting to detect anything inside the barrier.</p>\n<p>This barrier lasts for 1 minute. You can end it early as a bonus action on your turn. Once you&rsquo;ve used this feature, you must complete a short or long rest before you can use it again.</p>\n<hr />\n<h4><strong>DEPLOYMENT ACCELERATOR</strong></h4>\n<p>Your turret now deploys and undeploys instantly, but you can only do so once on each of your turns.</p>\n<hr />\n<h4><strong>DISGUISED TURRET</strong></h4>\n<p>Your turret can collapse into an innocuous looking container while undeployed. You have advantage on Charisma (Deception) checks to hide the nature of your turret while it is undeployed.</p>\n<hr />\n<h4><strong>HOVERING TURRET</strong></h4>\n<p>Your turret can hover 5 feet over the ground while deployed. It ignores difficult terrain while hovering in this way.</p>\n<hr />\n<h4><strong>INTEGRATED GRENADE LAUNCHER</strong></h4>\n<p>You integrate a grenade launcher into your turret.</p>\n<p>You can choose this upgrade multiple times. Each time you do so, the weapon&rsquo;s reload number increases by 1.</p>\n<hr />\n<h4><strong>INTEGRATED PROJECTOR</strong></h4>\n<p>You integrate a vapor projector into your turret.</p>\n<p>You can choose this upgrade multiple times. Each time you do so, the weapon&rsquo;s reload number increases by 1.</p>\n<hr />\n<h4><strong>INTEGRATED ROCKET LAUNCHER</strong></h4>\n<p>You integrate a rocket launcher into your turret.</p>\n<p>You can choose this upgrade multiple times. Each time you do so, the weapon&rsquo;s reload number increases by 1.</p>\n<hr />\n<h4><strong>LONGBOW</strong></h4>\n<p>Your turret&rsquo;s blaster&rsquo;s range increases by 50/200. Additionally, when you cast a tech power with a range of 5 feet or greater, and your turret is the target of your&nbsp;tracker droid interface&nbsp;tech power, you can cast it as if you were in your turret&rsquo;s space, and the range increases to 150 feet.</p>\n<hr />\n<h4><strong>PHALANX BARRIER</strong></h4>\n<p><em><strong>Prerequisite</strong>:&nbsp;5th level</em><br />As an action, you can reduce your turret&rsquo;s speed and have it create a barrier that surrounds in a radius depending on its size. A Small turret&rsquo;s speed is reduced to 10 feet and has a 5-foot radius, a Medium turret&rsquo;s speed is reduced to 5 feet and has a 10-foot radius, and a Large turret&rsquo;s speed is to reduce to 0 and has a 15-foot radius. While active, ranged weapon attacks originating from outside the barrier that pass through it have disadvantage. Ranged weapon attacks originating from inside the barrier are unaffected.</p>\n<p>This barrier lasts for 1 minute. You can end it early as a bonus action on your turn. Once you&rsquo;ve used this feature, you must complete a short or long rest before you can use it again.</p>\n<hr />\n<h4><strong>RAM ATTACHMENT</strong></h4>\n<p>You integrate a battering ram into your turret. When your turret makes a Strength check to break down physical doors, it gains a bonus to the check, depending on its size. A Small turret gains a +1 bonus, a Medium turret gains a +2 bonus, and a Large turret gains a +5 bonus. You can help your turret, giving it advantage on the check.</p>\n<hr />\n<h4><strong>RECURRING ACTION</strong></h4>\n<p><em><strong>Prerequisite</strong>:&nbsp;9th level</em><br />Your turret gains the ability to repeat attacks without direction. At the start of each of your turns, if your turret made an attack since the start of your previous turn, you can have it repeat its most recent attack (no action required). This attack targets the same space as the most recent attack made by your turret, regardless of whether or not a creature occupies that space.</p>\n<h4><strong>REJUVENATING BARRIER</strong></h4>\n<p><em><strong>Prerequisite</strong>:&nbsp;5th level</em><br />As an action, you can reduce your turret&rsquo;s speed and have it create a barrier that surrounds in a radius depending on its size. A Small turret&rsquo;s speed is reduced to 10 feet and has a 5-foot radius, a Medium turret&rsquo;s speed is reduced to 5 feet and has a 10-foot radius, and a Large turret&rsquo;s speed is to reduce to 0 and has a 15-foot radius. While active, friendly creatures that enter this barrier for the first time or start their turn there regain hit points equal to your Intelligence modifier, and gain temporary hit points equal to your Intelligence modifier. This feature can restore a creature to no more than half of its hit point maximum.</p>\n<p>This barrier lasts for 1 minute. You can end it early as a bonus action on your turn. Once you&rsquo;ve used this feature, you must complete a short or long rest before you can use it again.</p>\n<hr />\n<h4><strong>SENTRY</strong></h4>\n<p>You add an overwatch suite to your turret companion. When you cast the&nbsp;alarm&nbsp;tech power, you can choose to have your turret notified when the alarm is triggered. If you do so, when the alarm is triggered, your turret immediately makes a number of weapon attacks against the triggering creature up to your turret&rsquo;s proficiency bonus. If multiple creatures trigger the alarm simultaneously, your turret targets each creature randomly.</p>\n<hr />\n<h4><strong>SIZE: LARGE</strong></h4>\n<p><em><strong>Prerequisite</strong>:&nbsp;Size: Medium</em><br />Your turret&rsquo;s size is Large. Its hit points increase by an amount equal to its level + 1, its Hit Die becomes a d10, its vibroweapon and blaster damages increase to 1d12 and 1d10, respectively, and its deployed walking speed decreases to 15 feet.</p>\n<hr />\n<h4><strong>SIZE: MEDIUM</strong></h4>\n<p>Your turret&rsquo;s size is Medium. Its hit points increase by an amount equal to its level + 1, its Hit Die becomes a d8, its vibroweapon and blaster damages increase to 1d10 and 1d8, respectively, and its deployed walking speed decreases to 20 feet.</p>\n<hr />\n<h4><strong>SUPPRESSING FIRE</strong></h4>\n<p><em><strong>Prerequisite</strong>:&nbsp;11th level</em><br />When a creature within 30 feet of you moves at least 5 feet, you can use your reaction to have your turret make a ranged weapon attack with its blaster against the creature. If the attack hits, the creature gains 1 slowed level until the start of your next turn.</p>\n<hr />\n<h4><strong>TURRET COVERAGE</strong></h4>\n<p>As an action, you can have your turret anchor itself to the ground or recover itself. While anchored, its speed is reduce to 0, it has resistance to energy and kinetic damage, and it provides cover to creatures within 5 feet of it, depending on its size. A Small turret provides one-quarter cover, a Medium turret provides half cover, and a Large turret provides three-quarters cover. If an attack would miss a creature by an amount less than or equal to the bonus to AC granted by your turret&rsquo;s cover, your turret instead takes the damage.</p>\n</blockquote>",
            "chat": "",
            "unidentified": ""
        },
        "source": "EC",
        "activation": {
            "type": "",
            "cost": 0,
            "condition": ""
        },
        "duration": {
            "value": null,
            "units": ""
        },
        "target": {
            "value": null,
            "width": null,
            "units": "",
            "type": ""
        },
        "range": {
            "value": null,
            "long": null,
            "units": ""
        },
        "uses": {
            "value": 0,
            "max": 0,
            "per": null
        },
        "consume": {
            "type": "",
            "target": null,
            "amount": null
        },
        "ability": null,
        "actionType": "",
        "attackBonus": 0,
        "chatFlavor": "",
        "critical": null,
        "damage": {
            "parts": [],
            "versatile": ""
        },
        "formula": "",
        "save": {
            "ability": "",
            "dc": null,
            "scaling": "power"
        },
        "className": "",
        "requirements": "",
        "recharge": {
            "charged": false,
            "value": null
        }
    },
    "flags": {},
    "img": "icons/svg/mystery-man.svg",
    "effects": []
}