{
    "_id": "0uOEM0HhAAwu71gM",
    "name": "Voodoo Doll",
    "permission": {
        "default": 0,
        "s2rjv4MJWWDF4RjH": 3
    },
    "type": "classfeature",
    "data": {
        "description": {
            "value": "<p><em><strong>Occultist Pursuit</strong>:&nbsp;9th level</em></p>\n<p>Over the course of an hour, which can be done during a short rest, you can perform a ritual to construct an effigy of a creature. In order to do so, you must have at least heard of or seen the creature before, and the target must be in the same system as you. At the end of the hour, the creature must make a Wisdom saving throw against your maneuver save DC. This saving throw is modified by how well you know the target and the sort of physical connection you have to it, as shown in the Knowledge Save Modifier and Connection Save Modifier tables below.</p>\n<h3>Knowledge Save Modifier</h3>\n<table>\n<tbody>\n<tr>\n<td>Secondhand (you have heard of the target)</td>\n<td align=\"right\">+5</td>\n</tr>\n<tr>\n<td>firsthand (you have met the target</td>\n<td align=\"right\">+0</td>\n</tr>\n<tr>\n<td>Familiar (you know the target well)</td>\n<td align=\"right\">-5</td>\n</tr>\n</tbody>\n</table>\n<h3>Connection Save Modifier</h3>\n<table>\n<tbody>\n<tr>\n<td>Likeness or picture</td>\n<td align=\"right\">-2</td>\n</tr>\n<tr>\n<td>Curse of Objurgation</td>\n<td align=\"right\">-3</td>\n</tr>\n<tr>\n<td>Possession or garment</td>\n<td align=\"right\">-4</td>\n</tr>\n<tr>\n<td>Body part, lock of hair, bit of nail, or the like</td>\n<td align=\"right\">-10</td>\n</tr>\n</tbody>\n</table>\n<p>On a successful save, the target isn't affected, and you can't use this ritual against it again for 24 hours. On a failed save, the ritual creates a Tiny doll that is linked to the target. The doll remains linked for 24 hours, or for 10 minutes after you first use it. It disintegrates at the end of this duration. For the duration, you can see and hear the target through the doll as if you were within 5 feet of the creature.</p>\n<p>Additionally, as an action while the doll is in your possession, you can expend a Hit Die to torment the target, choosing an effect from the following options:</p>\n<ul>\n<li><strong>Burn</strong>:&nbsp;The target must succeed on a Wisdom saving throw. On a failed save, the target believes it is burning. While burning in this way, the target has has disadvantage on attack rolls made with Strength or Dexterity. This effect lasts for 1 hour.</li>\n<li><strong>Pain</strong>:&nbsp;The target must succeed on a Constitution saving throw or be wracked with pain for 1 hour. While in pain in this way, the target takes an additional 1d4 psychic damage whenever it takes damage.</li>\n<li><strong>Stab</strong>:&nbsp;The target must succeed on a Dexterity saving throw or gain 2 slowed levels and fall prone. The slowed levels effect lasts for 1 hour.</li>\n</ul>\n<p>The target can only be under 1 effect at a time. When you use a new effect, any existing effects end. Placing an effect on a target requires maintaining your concentration, as if concentrating on a power.</p>\n<p>You can use this feature twice. You regain all expended uses when you finish a long rest.</p>",
            "chat": "",
            "unidentified": ""
        },
        "source": "EC",
        "activation": {
            "type": "none",
            "cost": null,
            "condition": ""
        },
        "duration": {
            "value": null,
            "units": ""
        },
        "target": {
            "value": null,
            "width": null,
            "units": "",
            "type": ""
        },
        "range": {
            "value": null,
            "long": null,
            "units": ""
        },
        "uses": {
            "value": 2,
            "max": "2",
            "per": "lr"
        },
        "consume": {
            "type": "",
            "target": "",
            "amount": null
        },
        "ability": null,
        "actionType": "",
        "attackBonus": 0,
        "chatFlavor": "",
        "critical": null,
        "damage": {
            "parts": [],
            "versatile": ""
        },
        "formula": "",
        "save": {
            "ability": "",
            "dc": null,
            "scaling": "power"
        },
        "className": "",
        "recharge": {
            "value": null,
            "charged": false
        },
        "requirements": "Occultist 9"
    },
    "flags": {},
    "img": "systems/sw5e/packs/Icons/Class%20Features/SCLR-ARCH-Passive.webp",
    "effects": []
}