{
    "_id": "oOTB2Grnl3gqyDhp",
    "name": "Aqinos Form",
    "permission": {
        "default": 0,
        "IpSq6HI4edO6e0Yw": 3
    },
    "type": "archetype",
    "data": {
        "className": "Guardian",
        "description": {
            "value": "<h1>Aqinos Form</h1>\n<p>Aqinos Form, also known as Adaptation Form, is named after a Jedi Master who sought to merge technology with Force use. Those guardians who focus on Aqinos Form adopt these tenets to employ clever exploits using technology and the aid of a droid companion.</p>\n<h2>Bonus Proficiencies</h2>\n<p><em><strong>Aqinos Form:</strong> 3rd level</em></p>\n<p>You gain proficiency in astrotech's implements and the Technology skill.</p>\n<h2>Form Basics</h2>\n<p><em><strong>Aqinos Form:</strong> 3rd level</em></p>\n<p>You learn the basics of the chosen form. You gain the Aqinos lightsaber form, detailed in the Lightsaber Forms section of the Customisation Options document for Expanded Content. If you already know this form, you can instead choose another lightsaber form.</p>\n<h2>Techcasting Secrets</h2>\n<p><em><strong>Aqinos Form:</strong> 3rd level</em></p>\n<p>You have learned to blend your technological aptitude with the Force. Choose two tech powers of no higher level than your Max Power Level, as shown in the guardian table. The chosen powers count as both universal force powers and tech powers for you, but are not included in the number in the Powers Known column of the guardian table.</p>\n<p>You learn two additional powers at 5th, 9th, 13th, and 17th level. Whenever you gain a level in this class, you can choose one of the tech powers you know and replace it with another tech power of no higher level than your Max Power Level.</p>\n<h2>DROID COMPANION</h2>\n<p><em><strong>Aqinos Form:</strong> 3rd, 11th, and 17th level</em></p>\n<p>You learn to employ all the knowledge you've accumulated to create, customise, and bond with your own droid companion.</p>\n<p>Create your droid companion as detailed in the Companions section of the Customisation Options document for Expanded Content. You must have astrotech's implements in order to create your droid.</p>\n<p>If your companion is irreparably destroyed, or you want a companion, you must first break the bond with your current companion. Bonding with a new companion takes 8 hours spent in an appropriate location. You may only have one companion at a time.</p>\n<p>In addition to its traits and features, your droid companion gains additional benefits while it is bonded to you:</p>\n<ul>\n<li>\n<p>Your companion is a valid target of the <em>tracker droid interface</em> tech power.</p>\n</li>\n<li>\n<p>Your companion gains two additional traits. It gains one more additional trait when you reach 11th level in this class. For each companion trait in excess of your proficiency bonus, your force point maximum is reduced by 2. Over the course of a long rest, you can replace or remove a number of companion traits equal to half your Intelligence modifier (rounded up, minimum of one).</p>\n</li>\n</ul>\n<p>Lastly, while bonded and within 10 feet of you, your companion can cast the tech powers you know without expending tech points. If your companion casts an at will power in this way, it does not scale normally at higher levels. Instead, if it would scale at 5th level, it instead scales at 11th level, and if it would scale at 11th level, it instead scales at 17th level. If your companion casts a power of 2nd level or higher, it consumes a number of uses of this feature equal to that power&rsquo;s level.</p>\n<p>At 11th level, your droid companion must be within 30 feet of you to benefit from this feature. At 17th level, your droid companion must be within 60 feet.</p>\n<p>You can use this feature a number of times equal to your proficiency bonus, as shown in the guardian table. You regain all expended uses when you finish a long rest.</p>\n<h2>Channel the Force</h2>\n<p><em><strong>Aqinos Form:</strong></em> <em>7th level</em></p>\n<p>You learn your choice of the Cause Harm or Lend Aid Channel the Force options, and when you use either of these options, you gain additional benefits.</p>\n<h3>Cause Harm</h3>\n<p>You can choose to deal ion damage instead of necrotic.</p>\n<h3>Lend Aid</h3>\n<p>Droids and constructs are now valid targets.</p>\n<h2>Adaptive Calibration</h2>\n<p><em><strong>Aqinos Form:</strong> 15th level</em></p>\n<p>When you reduce a hostile creature to 0 hit points with a tech power, or you restore hit points to a friendly creature that is at 0 hit points with a tech power, you regain an expended use of your Channel the Force, and you gain temporary force points equal to the power's level.</p>\n<h2>Master of Adaptation</h2>\n<p><em><strong>Aqinos Form:</strong> 20th level</em></p>\n<p>Your masteries of the Force and technology have achieved equilibrium. Your Constitution and Wisdom or Charisma (your choice) scores increase by 2. Your maximum for those scores increases by 2. Additionally, you can use your action to gain the following benefits for 1 minute:</p>\n<ul>\n<li>\n<p>You have resistance to ion damage, and you can't have disadvantage on saving throws against ion or lightning damage.</p>\n</li>\n<li>\n<p>You can't have disadvantage on attack rolls you make as a part of a tech power, and enemies can't have advantage on saving throws against your tech powers.</p>\n</li>\n<li>\n<p>You add your governing ability modifier (minimum of +1) to any damage or healing you do with tech powers you cast that don't already include that modifier.</p>\n</li>\n</ul>\n<p>While you are conscious and your droid is within 60 feet of you and conscious, it also gains these benefits.</p>\n<p>This effect ends early if you are incapacitated or die. Once you use this feature, you can't use it again until you finish a long rest.</p>"
        },
        "source": "EC",
        "classCasterType": "Forcecaster, Techcaster"
    },
    "flags": {
        "core": {
            "sourceId": "Item.EDwAUYQ5NDuDYkeC"
        }
    },
    "img": "systems/sw5e/packs/Icons/Archetypes/Aqinos%20Form.webp",
    "effects": []
}