{
    "_id": "HOGXsFNkpWruE1Wd",
    "name": "Archaeologist Pursuit",
    "permission": {
        "default": 0,
        "IpSq6HI4edO6e0Yw": 3
    },
    "type": "archetype",
    "data": {
        "className": "Scholar",
        "description": {
            "value": "<h1>Archaeologist Pursuit</h1>\n<p>Archaeologists are those who study the remnants of historical civilizations. Those scholars who choose the Archaeologist Pursuit are driven by a desire to uncover the past, forming a connection to the lives of those that came before, and unlocking within themselves a connection not just to history, but to the Force, itself.</p>\n<h2>Bonus Proficiencies</h2>\n<p>You gain proficiency with archaeologist kits and in the Lore skill.</p>\n<h2>Forcecasting</h2>\n<p>When you choose this pursuit at 3rd level, you have learned powers from your studies of civilizations that were also once close to the Force. See chapter 11 for the general rules of forcecasting and chapter 11 for the force powers list.</p>\n<h3>Force Powers Known</h3>\n<p>You learn 4 force powers of your choice, and you learn more at higher levels, as shown in the Force Powers Known column of the Archaeologist Pursuit Forcecasting table. You may not leam a force power of a level higher than your Max Power Level, and you may learn a force power at the same time you leam its prerequisite.</p>\n<h3>Force Points</h3>\n<p>You have a number of force points equal to your scholar level, as shown in the Force Points column of the Archaeologist Pursuit Forcecasting table, + your Wisdom or Charisma modifier (your choice). You use these force points to cast force powers. You regain all expended force points when you finish a long rest.</p>\n<h3>Max Power Level</h3>\n<p>Many force powers can be overpowered, consuming more force points to create a greater effect You can overpower these abilities to a maximum level, which increases at higher levels, as shown in the Max Power Level column of the Archaeologist Pursuit Forcecasting table.</p>\n<p>You may only cast force powers at 4th-level once. You regain the ability to do so after a long rest</p>\n<h3>Forcecasting Ability</h3>\n<p>Your forcecasting ability varies based on the alignment of the powers you cast You use your Wisdom for light side powers, Charisma for dark side powers, and Wisdom or Charisma for universal powers (your choice). You use this ability score modifier whenever a power refers to your forcecasting ability. Additionally, you use this ability score modifier when setting the saving throw DC for a force power you cast and when making an attack roll with one.</p>\n<p><strong>Force save DC</strong> = 8 + your proficiency bonus + your forcecasting ability modifier</p>\n<p><strong>Force attack modifier</strong> = your proficiency bonus + your forcecasting ability modifier</p>\n<p>&nbsp;</p>\n<div class=\"classtable\">\n<blockquote>\n<h3>Archaeologist Pursuit Forcecasting</h3>\n<table>\n<thead>\n<tr>\n<th>Level</th>\n<th>Force Powers Known</th>\n<th>Force Points</th>\n<th>Max Power Level</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>3rd</td>\n<td>4</td>\n<td>3</td>\n<td>1st</td>\n</tr>\n<tr>\n<td>4th</td>\n<td>6</td>\n<td>4</td>\n<td>1st</td>\n</tr>\n<tr>\n<td>5th</td>\n<td>7</td>\n<td>5</td>\n<td>1st</td>\n</tr>\n<tr>\n<td>6th</td>\n<td>8</td>\n<td>6</td>\n<td>1st</td>\n</tr>\n<tr>\n<td>7th</td>\n<td>10</td>\n<td>7</td>\n<td>2nd</td>\n</tr>\n<tr>\n<td>8th</td>\n<td>11</td>\n<td>8</td>\n<td>2nd</td>\n</tr>\n<tr>\n<td>9th</td>\n<td>12</td>\n<td>9</td>\n<td>2nd</td>\n</tr>\n<tr>\n<td>10th</td>\n<td>13</td>\n<td>10</td>\n<td>2nd</td>\n</tr>\n<tr>\n<td>11th</td>\n<td>14</td>\n<td>11</td>\n<td>2nd</td>\n</tr>\n<tr>\n<td>12th</td>\n<td>15</td>\n<td>12</td>\n<td>2nd</td>\n</tr>\n<tr>\n<td>13th</td>\n<td>17</td>\n<td>13</td>\n<td>3rd</td>\n</tr>\n<tr>\n<td>14th</td>\n<td>18</td>\n<td>14</td>\n<td>3rd</td>\n</tr>\n<tr>\n<td>15th</td>\n<td>19</td>\n<td>15</td>\n<td>3rd</td>\n</tr>\n<tr>\n<td>16th</td>\n<td>20</td>\n<td>16</td>\n<td>3rd</td>\n</tr>\n<tr>\n<td>17th</td>\n<td>22</td>\n<td>17</td>\n<td>4th</td>\n</tr>\n<tr>\n<td>18th</td>\n<td>23</td>\n<td>18</td>\n<td>4th</td>\n</tr>\n<tr>\n<td>19th</td>\n<td>24</td>\n<td>19</td>\n<td>4th</td>\n</tr>\n<tr>\n<td>20th</td>\n<td>25</td>\n<td>20</td>\n<td>4th</td>\n</tr>\n</tbody>\n</table>\n</blockquote>\n</div>\n<p>&nbsp;</p>\n<h2>Archaic Diagnostics</h2>\n<p>Also at 3rd level, when you are the target of your Critical Analysis feature, you can use Intelligence instead of Wisdom or Charisma as your forcecasting ability modifier.</p>\n<h2>Additional Maneuvers</h2>\n<p>Lastly at 3rd level, you gain access to new maneuvers which reflect the progress of your studies into ancient civilizations. Whenever you learn a new maneuver, you can choose from any of the following as well. The maneuvers are listed in alphabetical order.</p>\n<h3>Force Resonance</h3>\n<p>Immediately after you deal damage to a target with a force attack, you can expend a superiority die and target a second creature that you can see within 30 feet of the first creature. Roll the die, and the second creature takes force damage equal to the roll + your forcecasting modifier.</p>\n<h3>Fortune and Glory</h3>\n<p>When you would make a weapon attack against a target within 30 feet, you can instead manipulate the Force to expend a superiority die and make a Sleight of Hand check using your universal forcecasting ability to plant something on the target, conceal an object on the target, lift the target&rsquo;s purse, or take something from its pocket. Roll the superiority die, and add the result to the check.</p>\n<h3>Fossil Fueled</h3>\n<p>When you would spend force points to cast a force power, you can instead expend a superiority die to cast the power. When you do so, you take necrotic damage equal to the number roll + your forcecasting modifier + twice the power&rsquo;s level. This damage cannot be reduced in anyway.</p>\n<p>For each additional time you use this maneuver without taking a short or long rest, roll an additional superiority die of damage.</p>\n<h3>One with the Force</h3>\n<p>Once per turn, when you make a Constitution saving throw to maintain concentration on a force power, you can expend a superiority die and add the number rolled to the saving throw.</p>\n<h3>Overwhelming Wit</h3>\n<p>Once per round, when a creature succeeds on a force power you cast that requires a Wisdom or Charisma saving throw, you can expend a superiority die to make a universal forcecasting ability check with proficiency, substituting the result of the roll for the save DC for that power.</p>\n<h3>Mind Over Mystery</h3>\n<p>When you are forced to make a saving throw against a force power or effect you can see, you can expend a superiority die to change the saving throw to an Intelligence saving throw.</p>\n<h3>Short Round</h3>\n<p>When you cast a force power of 1st-level or higher that has a casting time of 1 action, you can expend a superiority die to change the casting time to 1 bonus action for this casting.</p>\n<h3>Strikeforce</h3>\n<p>When you make a melee weapon attack against a creature, you can expend one superiority die and add the number rolled to the attack roll. On a hit, the target takes additional force damage equal to the number rolled.</p>\n<h3>You Call This Archaeology?</h3>\n<p>When you or an ally that you can see reduces a hostile creature to 0 hit points, you can use a reaction and expend a superiority die to give that yourself or that ally temporary hit points equal to the number rolled + your forcecasting modifier.</p>\n<h2>Force Carving</h2>\n<p>Beginning at 6th level, you have unlocked more control over the Force, allowing you to choose wisely who it affects. When you cast a force power that affects other creatures that you can see, you can choose a number of them equal to 1 + the power's level. The chosen creatures automatically succeed on their saving throws against the power, and they take no damage if they would normally take half damage on a successful save.</p>\n<h2>Psychometric Analysis</h2>\n<p>Starting at 9th level, your strength in the Force and your ability to read the objects around you intensifies. You can use your Critical Analysis to analyze an object of Huge size or smaller that you can see within range. When you do so, you learn whether or not the object is enhanced, cursed, and how old it is.</p>\n<p>Additionally, you can end your Critical Analysis on the object (no action required) to ask it a single question and receive an answer, usually in the form of an auditory or visual hallucination. For example, touching the rusted, broken remains of a lightsaber and asking how it got there may result in a brief vision of a disgruntled Jedi Knight casting it to the ground on that spot. An object \"questioned\" in this way can only provide information relating to its past. The GM has the final say on what objects can be questioned, and to what extent</p>\n<p>You can use this feature four times. You gain an additional use at 13th and 17th level. You regain all expended uses when you complete a long rest</p>\n<h2>Knowledge is Power</h2>\n<p>Once you've reached 17th level, you gain the ability to steal the knowledge of how to cast a power from another forcecaster. When a hostile creature casts a force power that affects a friendly creature within range of your Critical Analysis feature, and you use your reaction target that friendly creature with your Critical Analysis feature, you can force the creature casting the power to make an Wisdom or Charisma saving throw (your choice) against your universal force save DC. On a successful save, the power is cast as normal.</p>\n<p>On a failed save, you negate the power&rsquo;s effects, and you steal the knowledge of that power if it is at least 1 st level and of a level you can cast For the next 8 hours, you know the power and can cast it using your force points. The creature cannot cast that power again until the 8 hours have passed.</p>\n<p>Once you've used this feature, you cannot use it again until you finish a long rest</p>\n<h2>Discoveries (Archaeologist)</h2>\n<p>When you select this pursuit, you gain access to new discoveries which reflect your studies into historical civilations. Whenever you leam a new discovery, you can choose from any of the following as well. The discoveries are listed in alphabetical order.</p>\n<h3>Archive Research</h3>\n<p>Your expeditions have turned up a bevy of knowledge on the force. You leam three at-will force powers of your choice, which don't count against your number of force powers known.</p>\n<h3>Force Combat Knowledge</h3>\n<p>Your research into Jedi and Sith combat techniques has allowed you to gain proficiency in simple lightweapons. When you are the target of your Critical Analysis, you use your choice of your Intelligence or Strength modifier for the attack and damage rolls with simple lightweapons. You must use the same modifier for both rolls.</p>\n<p>Additionally, you gain knowledge of one lightsaber form of your choice.</p>\n<h3>It Belongs in a Museum</h3>\n<p>Your knowledge of antiquities is unparalleled. When you make an Intelligence (Lore) check or an ability check with your archaeologist kit, you may treat any roll of a 9 or lower as a 10.</p>\n<h3>Localized Survey</h3>\n<p><em><strong>Prerequisite:</strong> 13th level</em></p>\n<p>Your affinity for the Force allows you to key in to the recent past of an area you enter. When you would expend a use of your Psychometric Analysis, you can instead choose to target your immediate vicinity (up to a 50-foot cube) and investigate for at least 1 minute. For each minute you investigate, you see visions of recent events in the area going back a number of days equal to your scholar level, you leam about one significant event, beginning with the most recent</p>\n<p>You can investigate in this way for a number of minutes equal to your scholar level and must maintain concentration during that time, as if you were concentrating on a power.</p>\n<p>Once you&rsquo;ve used this feature, you can't use it again until you complete a short or long rest</p>\n<h3>Making This Up As You Go</h3>\n<p><em><strong>Prerequisite:</strong> 17th level</em></p>\n<p>You may now cast force powers at 4th-level twice between rests.</p>\n<h3>Telekinetic Ministrations</h3>\n<p><em><strong>Prerequisite:</strong> 9th level</em></p>\n<p>You can cast the @Compendium[sw5e.forcepowers.mnwPexAofsIOp8dD]{Telekinesis} force power at 5th level without spending force points.</p>\n<p>Once you&rsquo;ve used this feature, you must complete a long rest before you can use it again.</p>\n<h3>The Years and the Mileage</h3>\n<p>Your archaeological studies have taken you all across the galaxy. While you are the target of your Critical Analysis feature, you can use your universal forcecasting ability instead of Wisdom when making Insight or Survival checks.</p>\n<h3>Tomb of the Ancients</h3>\n<p><em><strong>Prerequisite:</strong> 5th level</em></p>\n<p>As a reaction when you take damage, you can entomb yourself in the Force until the end of your next turn. For the duration, you have resistance to the triggering damage, you gain temporary hit points equal to 1d10 + your universal forcecasting ability modifier + your scholar level to potentially absorb the attack, and your speed is reduced to 0.</p>\n<p>Once you use this invocation, you can't use it again until you finish a short or long rest.</p>"
        },
        "source": "EC",
        "classCasterType": "Forcecaster"
    },
    "flags": {
        "core": {
            "sourceId": "Item.RlEF6kyTDA8V0S3B"
        }
    },
    "img": "systems/sw5e/packs/Icons/Archetypes/Archaeologist%20Pursuit.webp",
    "effects": []
}