{
    "_id": "Mbe9qsurpJ0mb4F2",
    "name": "Armstech Engineering",
    "permission": {
        "default": 0,
        "IpSq6HI4edO6e0Yw": 3
    },
    "type": "archetype",
    "data": {
        "className": "Engineer",
        "description": {
            "value": "<h1>Armstech Engineering</h1>\n<p>Those engineers who choose the Armstech Engineeering discipline focus on the skill of constructing and modifying blasters and vibroweapons.</p>\n<h2>Bonus Proficiencies</h2>\n<p>When you choose this discipline at 3rd level, you gain proficiency in armstech's tools, medium armor, martial blasters, and martial vibroweapons. Additionally, when you engage in crafting with armstech's tools, the rate at which you craft doubles.</p>\n<h2>Modified Weaponry</h2>\n<p>Also at 3rd level, you learn to modify one unenhanced weapon with which you are proficient utilizing your armstech experience. Over the course of a long rest, you can expend materials equal to half the cost of a weapon in order to modify it. You must have the weapon, materials, and armstech's tools in order to perform this modification.</p>\n<p>Your modified weapon is enhanced, requires attunement, can only be used by you, and counts as a tech focus for your tech powers while you are attuned to it. Your modified weapon has 4 modification slots, and it gains more at higher levels, as shown in the Modification Slots column of the engineer class table. For each modification installed, your tech point maximum is reduced by 1. Over the course of a long rest, you can replace or remove a number of modifications up to your Intelligence modifier (minimum of one).</p>\n<p>Some modification effects require saving throws. When you use such an effect from this class, the DC equals your tech save DC.</p>\n<p>At 9th level, you can maintain two modified weapons. Each modified weapon has modification slots as shown in the Modification Slots column of the engineer class table.</p>\n<h2>Close Call</h2>\n<p>Lastly at 3rd level, when you make an attack roll with your modified weapon and miss, you can expend one use of your Potent Aptitude to attempt to turn that miss into a hit. Roll the die and add it to the attack roll.</p>\n<h2>Armstech's Strike</h2>\n<p>Beginning at 6th level, once per round, when you deal damage to a creature with your modified weapon, you can increase the damage by 1d6. The damage is of the same type as the weapon's damage.</p>\n<p>The damage increases to 2d6 at 11th level and 3d6 at 17th level.</p>\n<h2>Targeting Matrix</h2>\n<p>At 14th level, when you cast a tech power that allows you to force creatures in an area to make a saving throw, you can instead make an attack roll with your modified weapon against a single target that would be in the range of the power. On a hit, the target suffers the effects as though they failed their saving throw. If the power would affect more than one creature, it instead affects only one.</p>\n<p>You can use this feature a number of times equal to your Intelligence modifier (a minimum of once). You regain any expended uses when you finish a long rest.</p>\n<h2>Armstech's Salvo</h2>\n<p>Starting at 18th level, when you use your Targeting Matrix feature, and the tech power would affect more than one creature, you can instead attack each affected creature that would be in the range of the power. Make a separate attack roll for each target. On a hit, each target suffers the effects as though they failed their saving throw.</p>\n<h2>Armstech Modifications</h2>\n<p>If a modification has prerequisites, you must meet them to install it. You can install the modification at the same time that you meet its prerequisites.</p>\n<h3>Accuracy Focus</h3>\n<p><em><strong>Prerequisite:</strong> 5th level, Blaster</em> <br />You gain a +1 bonus to attack rolls made with this weapon. This bonus increases to +2 at 9th level and +3 at 13th level.</p>\n<h3>Amplifying Barrel</h3>\n<p><em><strong>Prerequisite:</strong> 5th level, Blaster</em> <br />You gain a +1 bonus to damage rolls made with this weapon. This bonus increases to +2 at 9th level and +3 at 13th level.</p>\n<h3>Bayonet</h3>\n<p><em><strong>Prerequisite:</strong> Blaster</em> <br />You affix a short blade to the barrel of your modified blaster weapon, allowing you to make a melee weapon attack with it. The blade is a melee weapon with the finesse property that you are proficient with, and deals 1d6 kinetic damage.</p>\n<h3>Burst Core</h3>\n<p><em><strong>Prerequisite:</strong> Blaster</em> <br />Your weapon gains the burst property, with a burst number equal to its reload number.</p>\n<h3>Booming Strikes</h3>\n<p><em><strong>Prerequisite:</strong> 7th level</em> <br />You pack extra power into your modified weapon. Once per turn, when you hit with the weapon, you can deal an additional 1d6 damage. If you do so, the weapon makes a loud boom which can be heard 100 feet away. If you are hidden, Intelligence (Investigation) and Wisdom (Perception) checks made to locate you that rely on sound have advantage.</p>\n<h3>Celerity Oscillator</h3>\n<p>Once per turn, when you deal damage with your modified weapon, your walking speed increases by 10 feet until the start of your next turn, and the damaged creature can't make opportunity attacks against you for the rest of your turn.</p>\n<h3>Collapsible Frame</h3>\n<p><em><strong>Prerequisite:</strong> Vibroweapon</em> <br />You install an expandable hilt on your modified weapon. Your modified weapon gains the reach property.</p>\n<h3>Contoured Grip</h3>\n<p><em><strong>Prerequisite:</strong> 5th level, Vibroweapon</em> <br />You gain a +1 bonus to attack rolls made with this weapon. This bonus increases to +2 at 9th level and +3 at 13th level.</p>\n<h3>Expanded Magazine</h3>\n<p><em><strong>Prerequisite:</strong> Blaster</em> <br />Your modified weapon can be more efficiently reloaded. You can reload your modified weapon once without using an action. You can't use this feature again until you reload the weapon with an action.</p>\n<h3>Flashlight</h3>\n<p>You affix a targeted light to your weapon. As a bonus action, you can toggle the light on or off. While on, your weapon sheds bright light in a 60-foot cone.</p>\n<h3>Harpoon Reel</h3>\n<p>You install a secondary firemode that launches a harpoon attached to a tightly coiled cord. With this harpoon, you can make a ranged weapon attack with a range of 30/60. On a hit, it deals 1d6 kinetic damage. This attack can target a surface, object, or creature.</p>\n<p>A creature struck by this attack is impaled by the harpoon. As an action, a creature can attempt to remove the harpoon. Removing the harpoon requires a Strength check. While the harpoon is stuck in the target, you are connected to the target by a 60 foot cable.</p>\n<p>While connected in this manner, you can use your bonus action to activate the reel, pulling yourself to the location if the target is your size or larger. A creature or object smaller than you is pulled to you. Alternatively, you can opt to release the cable (no action required).</p>\n<p>Once you've used this feature, you can't use it again until you recover and reinsert the harpoon as an action.</p>\n<h3>Imbue Weapon</h3>\n<p><em><strong>Prerequisite:</strong> 9th level</em> <br />You modify your weapon to carry a charge. Over the course of a short rest, you can cast an at-will tech power, channeling it into your weapon. The next time you hit with your weapon, the stored power is released. If the power would require an attack roll, make a tech attack roll. If the power would require a saving throw, the target must make the saving throw as normal. On a hit, or a failure, the target suffers the power's normal effects.</p>\n<h3>Improved Burst Core</h3>\n<p><em><strong>Prerequisite:</strong> 9th level</em> <br /><em><strong>Prerequisite:</strong> Burst Core</em> <br />Your weapon's burst number is reduced to half its reload number.</p>\n<h3>Integrated Magazine</h3>\n<p><em><strong>Prerequisite:</strong> Expanded Magazine</em> <br />Your modified weapon can be more efficiently reloaded. You can reload your modified weapon twice without using an action. You can't use this feature again until you reload the weapon with an action.</p>\n<h3>Jagged Oscillator</h3>\n<p><em><strong>Prerequisite:</strong> Vibroweapon</em> <br />When you critically hit with the weapon, you deal an additional 1d8 kinetic damage.</p>\n<h3>Keen Oscillator</h3>\n<p><em><strong>Prerequisite:</strong> 5th level</em> <br /><em><strong>Prerequisite:</strong> Jagged Oscillator</em> <br />Your weapon now scores a critical hit on a roll of 19 or 20.</p>\n<h3>Neutronium Edge</h3>\n<p><em><strong>Prerequisite:</strong> 5th level, Vibroweapon</em> <br />You gain a +1 bonus to damage rolls made with this weapon. This bonus increases to +2 at 9th level and +3 at 13th level.</p>\n<h3>Overcharge Weapon</h3>\n<p><em><strong>Prerequisite:</strong> 11th level</em> <br /><em><strong>Prerequisite:</strong> Booming Strikes</em> <br />You gain the ability to channel your tech power to enhance your weapon's damage. You can expend one tech slot to deal additional damage to the target. The extra damage is 1d6 for a 1st-level tech slot, plus 1d6 for each slot level higher than 1st, to a maximum of 5d6. The damage is the same type as the weapon damage. If you also use your Booming Strikes with an attack, you add this damage to the extra damage of your Booming Strikes.</p>\n<h3>Power Loop</h3>\n<p><em><strong>Prerequisite:</strong> 7th level</em> <br />When you hit with the weapon, you can choose channel the energy generated, gaining temporary hit points equal to half the damage dealt.</p>\n<p>Once you've used this feature, you must complete a long rest before you can use it again.</p>\n<h3>Recoil Dampener</h3>\n<p><em><strong>Prerequisite:</strong> Blaster with the strength property</em> <br />You install a recoil dampener in your modified blaster, removing the strength property from it.</p>\n<h3>Returning Weapon Guard</h3>\n<p><em><strong>Prerequisite:</strong> Vibroweapon</em> <br />You install a retractible chain in your modified vibroweapon. If the weapon does not already have the thrown property, it gains it with a range of 20/60. Additionally, it gains the returning property.</p>\n<h3>Screening Weapon</h3>\n<p>You modify your modified weapon with a sound dampening module. When you make a weapon attack with your weapon while hidden, Investigation and Perception checks made to locate you that rely on sound have disadvantage.</p>\n<h3>Siege Weapon</h3>\n<p>You modify your weapon to be more effective against barriers. Your weapon deals double damage against structures.</p>\n<h3>Shock Absorber</h3>\n<p>You add a reclamation device to your modified weapon to gather energy from the surroundings when it is present. While wielding your modified weapon, you can cast the <em>absorb energy</em> tech power and the power's extra damage applies to both melee and ranged weapon attacks.</p>\n<h3>Shock Harpoon</h3>\n<p><em><strong>Prerequisite:</strong> 9th level</em> <br /><em><strong>Prerequisite:</strong> Harpoon Reel</em> <br />After hitting a creature with the harpoon fire mode, you can use the connection to deliver an at-will tech power. As a bonus action, you can cast an at-will tech power at the target as if you were standing in the</p>\n<p>target's space. If the power requires a saving throw, the target has disadvantage.</p>\n<p>Once you've used this feature, you can't use it again until you recover the harpoon.</p>\n<h3>Shocking Oscillator</h3>\n<p><em><strong>Prerequisite:</strong> 9th level, Vibroweapon</em> <br />When you hit with the weapon, you can create an electronic burst. Each creature in a 15-foot cone centered on the creature you hit must make a Dexterity saving throw against your tech save DC, taking 1d8 lightning damage on a failed save or half as much on a successful one.</p>\n<p>Once you've used this feature, you must complete a long rest before you can use it again.</p>\n<h3>Snap Fire</h3>\n<p><em><strong>Prerequisite:</strong> 9th level, Blaster</em> <br />You modify your modified blaster weapon for quick shots. You can use your reaction to take a opportunity attack with your modified weapon if an enemy comes within 10 feet of you. You have disadvantage on this attack.</p>\n<h3>Stabilizer Cell</h3>\n<p><em><strong>Prerequisite:</strong> Vibroweapon with the dexterity property</em> <br />You install a stabilizer cell in your modified vibroweapon, removing the dexterity property from it.</p>\n<h3>Staggering Oscillator</h3>\n<p><em><strong>Prerequisite:</strong> Vibroweapon</em> <br />When you hit with the weapon, you can force the target to make a Strength saving throw. On a failed save, the creature is pushed back 10 feet and knocked prone.</p>\n<p>Once you've used this feature, you must complete a short or long rest before you can use it again.</p>\n<h3>Tracker</h3>\n<p><em><strong>Prerequisite:</strong> 5th level</em> <br />You add a tracking mechanism to your modified weapon. The tracker has 3 charges. As an action you can use 1 charge to cast <em>target lock</em>. As an action you can use 2 charges to cast <em>detect invisibility</em>.</p>\n<p>The tracker regains all expended charges after a long rest.</p>\n<h3>Truelight</h3>\n<p><em><strong>Prerequisite:</strong> 11th level</em> <br /><em><strong>Prerequisite:</strong> Flashlight</em> <br />When toggled on, your flashlight now automatically dispels illusions and can detect invisibility, as with truesight.</p>\n<h3>Venomous Oscillator</h3>\n<p><em><strong>Prerequisite:</strong> 9th level, Vibroweapon</em> <br />As a bonus action, you can coat your weapon in a thin layer of poison for 1 minute. The next time you hit with the weapon, the creature must make a Constitution saving throw against your tech save DC. On a failed save, a creature takes 1d10 poison damage and becomes poisoned for 1 minute.</p>\n<p>Once you've used this feature, you must complete a long rest before you can use it again.</p>"
        },
        "source": "PHB",
        "activation": {
            "cost": null,
            "type": ""
        },
        "actionType": "",
        "damage": {
            "parts": []
        },
        "armorproperties": {
            "parts": []
        },
        "weaponproperties": {
            "parts": []
        },
        "classCasterType": "Techcaster"
    },
    "flags": {
        "dynamiceffects": {
            "equipActive": true,
            "alwaysActive": false,
            "effects": [
                {
                    "modSpecKey": "data.traits.toolProf.value",
                    "value": "arms",
                    "mode": "+",
                    "targetSpecific": false,
                    "id": 1,
                    "itemId": "Mbe9qsurpJ0mb4F2",
                    "active": false,
                    "_targets": [],
                    "label": "Traits Tool Prof"
                },
                {
                    "modSpecKey": "data.traits.armorProf.value",
                    "value": "med",
                    "mode": "+",
                    "targetSpecific": false,
                    "id": 2,
                    "itemId": "Mbe9qsurpJ0mb4F2",
                    "active": false,
                    "_targets": [],
                    "label": "Traits Armor Prof"
                },
                {
                    "modSpecKey": "data.traits.weaponProf.custom",
                    "value": "martial blasters",
                    "mode": "+",
                    "targetSpecific": false,
                    "id": 3,
                    "itemId": "Mbe9qsurpJ0mb4F2",
                    "active": false,
                    "_targets": [],
                    "label": "Traits Weapon Prof. Custom"
                },
                {
                    "modSpecKey": "data.traits.weaponProf.custom",
                    "value": "martial vibroweapons",
                    "mode": "+",
                    "targetSpecific": false,
                    "id": 4,
                    "itemId": "Mbe9qsurpJ0mb4F2",
                    "active": false,
                    "_targets": []
                }
            ]
        }
    },
    "img": "systems/sw5e/packs/Icons/Archetypes/Armstech%20Engineering.webp",
    "effects": []
}