{
    "_id": "UsIUJiNPmFWbEgjK",
    "name": "Audiotech Engineering",
    "permission": {
        "default": 0,
        "IpSq6HI4edO6e0Yw": 3
    },
    "type": "archetype",
    "data": {
        "className": "Engineer",
        "description": {
            "value": "<h1>Audiotech Engineering</h1>\n<p>Those engineers who choose the Audiotech Engineering focus on using a specially modified instrument to use music to assist their allies and disrupt their enemies.</p>\n<h2>Bonus Proficiencies</h2>\n<p>When you choose this discipline at 3rd level, you gain proficiency in three musical instruments of your choice, as well as the Performance skill. Additionally, you can use Intelligence instead of Charisma when you make a Performance check while wielding your modified instrument.</p>\n<h2>Modified Instrument</h2>\n<p>Also at 3rd level, you learn to modify an instrument utilizing your audiotech knowledge. Over the course of a long rest, you can expend 500 cr worth of materials to modify a single instrument. You must have the instrument, materials, and tinker's tools in order to perform this modification.</p>\n<p>Your modified instrument is enhanced, requires attunement, can only be used by you, and counts as a tech focus for your tech powers while you are attuned to it. Your modified instrument has 4 modification slots, and it gains more at higher levels, as shown in the Modification Slots column of the engineer class table. For each modification installed, your tech point maximum is reduced by 1. Over the course of a long rest, you can replace or remove a number of modifications up to your Intelligence modifier (minimum of one).</p>\n<p>Some modification effects require saving throws. When you use such an effect from this class, the DC equals your tech save DC.</p>\n<h2>Potent Amplitude</h2>\n<p>Lastly at 3rd level, as an action while wielding your modified instrument, you can begin performing an enhanced song, which lasts for 1 minute. While playing a song, you gain access to a new use for your Potent Aptitude, as determined by the song, listed below. You can end your song at any time, no action required.</p>\n<p>Whenever you take damage while playing your song, you must make a Constitution saving throw to continue playing. The DC equals 10 or half the damage you take, which number is higher. If you take damage from multiple sources, you must make a separate saving throw for each source of damage.</p>\n<p>When you cast a damage dealing tech power while playing your song that requires an attack roll or saving throw, you can cause that power to instead deal sonic damage. If you do so, instead of an attack roll or saving throw, the power instead requires a Constitution saving throw.</p>\n<p>Your song ends early if you are incapacitated or die, or if you are no longer holding your modified instrument.</p>\n<p>You can initiate playing an enhanced song twice. You regain all expended songs when you finish a short or long rest.</p>\n<h3>Song of Battle</h3>\n<p>When an ally within 60 feet of you that can hear you deals damage to a creature, you can use your reaction to expend one use of your Potent Aptitude, adding the result of the die to the damage dealt.</p>\n<h3>Song of Support</h3>\n<p>When an ally within 60 feet of you that can hear you makes a saving throw against a harmful effect, you can use your reaction to expend one use of your Potent Aptitude, adding the result of the die to their saving throw.</p>\n<h3>Song of Disruption</h3>\n<p>When an enemy within 60 feet of you that can hear you makes a saving throw, you can use your reaction to expend one use of your Potent Aptitude, subtracting the result of the die from their saving throw.</p>\n<h2>Concussive Blast</h2>\n<p>Beginning at 6th level, you add your Intelligence modifier (a minimum of +1) to any damage you deal with tech powers and class features that deal sonic damage.</p>\n<h2>Smooth Rhythm</h2>\n<p>At 14th level, whenever you use your Potent Aptitude while your playing an enhanced song, you can roll a d6 and use it instead of expending a Potent Aptitude Dice.</p>\n<h2>Legendary Coda</h2>\n<p>Starting at 18th level, you've gained mastery over your modified instrument. As an action, you can end your enhanced song in a triumphant blast of power with an effect determined by the song you are playing.</p>\n<p>Once you've used this feature, you must complete a long rest before you can use it again.</p>\n<h3>Battle Crescendo</h3>\n<p>Choose up to 10 creatures of your choice that you can see and that can hear your song. Each must make a Constitution saving throw. On a failed save, a target takes 14d6 sonic damage and is stunned. On a success, it takes half damage and isn't stunned. If a creature is killed by this power, its head explodes.</p>\n<h3>Support Crescendo</h3>\n<p>Choose up to 10 creatures of your choice that you can see and that can hear your song. Once in the next minute, each creature can, as a free action in response to taking damage, choose to halve that damage. Additionally, if the damage would reduce them to 0 hit points, they are instead reduced to 1.</p>\n<h3>Disruption Crescendo</h3>\n<p>Choose up to 10 creatures of your choice that you can see and that can hear your song. Each creature must succeed on a Constitution saving throw or be paralyzed for 1d4+1 turns. If a creature affected by this feature is damaged in any way, the effect ends for that creature.</p>\n<h2>Audiotech Modifications</h2>\n<p>If a modification has prerequisites, you must meet them to install it. You can install the modification at the same time that you meet its prerequisites.</p>\n<h3>Advanced Battle Enhancement</h3>\n<p><em><strong>Prerequisite:</strong> 15th level</em> <br /><em><strong>Prerequisite:</strong> Prototype Battle Enhancement</em> <br />While playing your Song of Battle, your tech powers and class features ignore resistance to sonic damage, and immunity to sonic damage is instead treated as resistance from any creature within range of your song that can hear you.</p>\n<p>Additionally, when you use your Battle Song Enhancement feature, you create a fourth burst.</p>\n<h3>Advanced Disruption Enhancement</h3>\n<p><em><strong>Prerequisite:</strong> 15th level</em> <br /><em><strong>Prerequisite:</strong> Prototype Disruption Enhancement</em> <br />While playing your Song of Disruption, any hostile creature within range of your song that can hear you must make a Constitution saving throw at the end of each of its turns to maintain concentration on the power.</p>\n<h3>Advanced Support Enhancement</h3>\n<p><em><strong>Prerequisite:</strong> 15th level</em> <br /><em><strong>Prerequisite:</strong> Prototype Support Enhancement</em> <br />While playing your Song of Support, allies add your Intelligence modifier to their death saving throws (minimum of +1). If this amount would increase the roll of the d20 to 20 or greater, the creature regains 1 hit point.</p>\n<h3>Battle Song Enhancement</h3>\n<p><em><strong>Prerequisite:</strong> 5th level</em> <br />While playing your Song of Battle, as an action, you can send forth busts of directed sonic energy, make two ranged power attacks. These attacks can target the same creature different ones. Make separate attack rolls for each burst. The attack has a range equal to the radius of your song, and deals 1d8 sonic damage on a hit.</p>\n<h3>Disruption Song Enhancement</h3>\n<p><em><strong>Prerequisite:</strong> 5th level</em> <br />While playing your Song of Disruption, as an action, you can choose a number of creatures concentrating on a power equal to your Intelligence modifier (a minimum of one) within range of your song that can hear you, and force them to make a Concentration saving throw. If you cause at least one creature to lose concentration on a power using this feature, you can use your reaction to make all creatures that lost concentration take damage equal to your Intelligence modifier.</p>\n<h3>Enthralling Performance</h3>\n<p><em><strong>Prerequisite:</strong> 13th level</em> <br /><em><strong>Prerequisite:</strong> Hypnotic Melody</em> <br />For the duration of an enhanced song you play, whenever any creature that can hear your song tries to attack you for the first time on a turn, the attacker must make a Charisma saving throw. On a failed save, it can't attack you on this turn, and it must choose a new target for its attack or the attack is wasted. On a successful save, it can attack you on this turn, but it has disadvantage on any saving throw it makes against your powers or features on your next turn.</p>\n<p>Once you've used this feature, you must complete a long rest before you can use it again.</p>\n<h3>Finding My Way</h3>\n<p><em><strong>Prerequisite:</strong> Rush</em> <br />While you are playing an enhanced song, when a creature makes a melee attack roll against you, you can use your reaction to move 5 feet without provoking opportunity attacks, imposing disadvantage on the roll.</p>\n<p>You can use this feature a number of times equal to your Intelligence modifier (a minimum of once). You regain all expended uses when you complete a short or long rest.</p>\n<h3>Hypnotic Melody</h3>\n<p>As an action while wielding your modified instrument, you can begin to play a song woven with subtle hypnotic influence. Choose a number of creature up to your Intelligence modifier. If those creatures listen to this song for a full minute, they must succeed on a Wisdom saving throw or become charmed by you for 1 minute. Creatures that succeed the saving throw are not aware that you attempted to influence them, nor are creatures that failed their saving throw once the power ends.</p>\n<p>Once you've used this feature, you can't use it again until you finish a short or long rest.</p>\n<h3>Inaudible Casting</h3>\n<p><em><strong>Prerequisite:</strong> 7th level</em> <br /><em><strong>Prerequisite:</strong> Simple Melodies</em> <br />When you cast a tech power or make use of a feature that requires playing your modified instrument, you can choose to do so quietly. Creatures have disadvantage on Intelligence (Investigation) and Wisdom (Perception) checks that rely on sound to determine you cast a tech power.</p>\n<h3>Long Range Noise</h3>\n<p><em><strong>Prerequisite:</strong> 13th level</em> <br />The radius of your songs increases to 120 feet. Additionally, any tech power you cast with your modified instrument that deals sonic damage and has a range of 10 feet or greater gains a range of 120 feet.</p>\n<h3>Magnifying Device</h3>\n<p><em><strong>Prerequisite:</strong> 5th level</em> <br />You gain a +1 bonus to tech attack rolls. This bonus increases to +2 at 11th level and +3 at 17th level.</p>\n<h3>Overwhelming Soundwaves</h3>\n<p><em><strong>Prerequisite:</strong> 15th level</em> <br />While playing, creatures of your choice treat a 15-foot-radius sphere around you as difficult terrain. Additionally, as an action, you can cause each affected creature to make a Constitution saving throw, taking 3d8 sonic damage on a failed save.</p>\n<h3>Prototype Battle Enhancement</h3>\n<p><em><strong>Prerequisite:</strong> 9th level</em> <br /><em><strong>Prerequisite:</strong> Battle Song Enhancement</em> <br />While playing your Song of Battle, when you cast a tech power or use a class feature that affects other creatures within the radius of your song, you can choose a number of them equal to 1 + the power's level. The chosen creatures automatically succeed on their saving throws against the power, and they take no damage if they would normally take half damage on a successful save.</p>\n<p>Additionally, when you use your Battle Song Enhancement feature, you create a third burst.</p>\n<h3>Prototype Disruption Enhancement</h3>\n<p><em><strong>Prerequisite:</strong> 9th level</em> <br /><em><strong>Prerequisite:</strong> Disruption Song Enhancement</em> <br />While playing your Song of Disruption, when a creature you can see that can hear you attempts to cast a power, you can use your reaction to cast the @Compendium[sw5e.techpowers.9Vg5TEwWdVh3NVym]{Tech Override}&nbsp;power at 3rd level. When you cast this power using this feature, the power works against both tech and force powers, and when you make the techcasting ability check as a part of this casting, you add double your proficiency bonus to the check, instead of your normal proficiency bonus.</p>\n<p>Once you've used this feature, you must complete a short or long rest before you can use it again.</p>\n<h3>Prototype Support Enhancement</h3>\n<p><em><strong>Prerequisite:</strong> 9th level</em> <br /><em><strong>Prerequisite:</strong> Support Song Enhancement</em> <br />While playing your Song of Support, when you use your Song of Support's Potent Amplitude feature, the target instead takes no damage if they succeed on the saving throw, and only half damage if they fail.</p>\n<h3>Restful Melody</h3>\n<p>Over the course of a short rest, you can play a rejuvenating song to assist in the recovery of your allies. If you or any friendly creatures who can hear your performance regain hit points at the end of the short rest, each of those creatures regains an extra 1d6 hit points.</p>\n<p>The extra hit points increase when you reach certain levels in this class: to 1d8 at 9th level, to 1d 10 at 13th level, and to 1d12 at 17th level.</p>\n<h3>Rush</h3>\n<p>While you are playing an enhanced song, your speed increases by 10 feet, and opportunity attacks made against you have disadvantage.</p>\n<h3>Sharp Noise</h3>\n<p>As an action while wielding your modified instrument, choose a creature you can see. If it can hear you, it must succeed on a Constitution saving throw or take 1d4 sonic damage and have disadvantage on its next attack roll before the end of its next turn.</p>\n<p>This feature's damage increases by 1d4 when you reach 5th level (2d4), 11th level (3d4), and 17th level (4d4).</p>\n<h3>Shock Mount</h3>\n<p><em><strong>Prerequisite:</strong> 5th level</em> <br />You gain a +1 bonus to your tech save DC. This bonus increases to +2 at 11th level and +3 at 17th level.</p>\n<h3>Simple Melodies</h3>\n<p>When you are holding your modified instrument, and not actively playing a song, any tech power that you could cast that could have its damage type altered by your Potent Amplitude feature can be cast as if used with Potent Amplitude.</p>\n<p>You can use this feature a number of times equal to your Intelligence modifier (a minimum of once). You regain all expended uses when you complete a short or long rest.</p>\n<h3>Sonar Pulse</h3>\n<p>As an action while wielding your modified instrument, you can release a wave of sound that provides feedback on your surroundings. For the next minute, you have advantage on Wisdom (Perception) and Intelligence (Investigation) checks to search for hidden doors, traps, or invisible creatures.</p>\n<p>Once you've used this feature, you can't use it again until you finish a short or long rest.</p>\n<h3>Song Flow</h3>\n<p><em><strong>Prerequisite:</strong> 11th level</em> <br />While playing an enhanced song, you can use your bonus action to change from one song to another.</p>\n<h3>Support Song Enhancement</h3>\n<p><em><strong>Prerequisite:</strong> 5th level</em> <br />While playing your Song of Support, when you cast a tech power that restores hit points or grants temporary hit points, the amount restored or granted is increased by an amount equal to your Intelligence modifier (minimum of +1).</p>\n<h3>Weapon Integration</h3>\n<p>You can integrate a single weapon that weighs no more than 8 lb. into your instrument. While integrated, that weapon gains the hidden property.</p>"
        },
        "source": "EC",
        "activation": {
            "cost": null,
            "type": ""
        },
        "actionType": "",
        "damage": {
            "parts": []
        },
        "armorproperties": {
            "parts": []
        },
        "weaponproperties": {
            "parts": []
        },
        "classCasterType": "Techcaster"
    },
    "flags": {
        "dynamiceffects": {
            "equipActive": true,
            "alwaysActive": false,
            "effects": [
                {
                    "modSpecKey": "data.traits.toolProf.value",
                    "value": "music",
                    "mode": "+",
                    "targetSpecific": false,
                    "id": 2,
                    "itemId": "UsIUJiNPmFWbEgjK",
                    "active": false,
                    "_targets": [],
                    "label": "Traits Tool Prof"
                },
                {
                    "modSpecKey": "data.traits.toolProf.value",
                    "value": "music",
                    "mode": "+",
                    "targetSpecific": false,
                    "id": 3,
                    "itemId": "UsIUJiNPmFWbEgjK",
                    "active": false,
                    "_targets": [],
                    "label": "Traits Tool Prof"
                },
                {
                    "modSpecKey": "data.traits.toolProf.value",
                    "value": "music",
                    "mode": "+",
                    "targetSpecific": false,
                    "id": 4,
                    "itemId": "UsIUJiNPmFWbEgjK",
                    "active": false,
                    "_targets": [],
                    "label": "Traits Tool Prof"
                },
                {
                    "modSpecKey": "data.traits.toolProf.value",
                    "value": "aud",
                    "mode": "+",
                    "targetSpecific": false,
                    "id": 5,
                    "itemId": "UsIUJiNPmFWbEgjK",
                    "active": false,
                    "_targets": []
                }
            ]
        }
    },
    "img": "systems/sw5e/packs/Icons/Archetypes/Audiotech%20Engineering.webp",
    "effects": []
}