{
    "_id": "uqpzyWm3JoIJlHrb",
    "name": "Biochem Engineering",
    "permission": {
        "default": 0,
        "IpSq6HI4edO6e0Yw": 3
    },
    "type": "archetype",
    "data": {
        "className": "Engineer",
        "description": {
            "value": "<h1>Biochem Engineering</h1>\n<p>Those engineers who choose the Biochem Engineering discipline focus on utilizing their vast knowledge of medicine and chemistry to supply allies with potent healing and enemies with debilitating poisons and acids.</p>\n<h2>Bonus Proficiencies</h2>\n<p>When you choose this discipline at 3rd level you gain proficiency in the Medicine skill, biochemist's kits, and poisoner's kits. additionally, when you engage in crafting with biochemist's kits and poisoner's kits, the rate at which you craft doubles.</p>\n<h2>Modified Biochemist's Pack</h2>\n<p>Also at 3rd level, you learn to modify and combine your biochemist's kit and poisoner's kit, creating a mobile laboratory using your chemistry expertise. Over the course of a long rest, you can expend 500 cr worth of materials to create your modified biochemist's pack. You must have a biochemist's kit, a poisoner's kit, and materials in order to perform this modification.</p>\n<p>Your biochemist's pack is enhanced, requires attunement, can only be used by you, and counts as a tech focus for your tech powers while you are attuned to it. Your modified biochemist's pack has 4 modification slots, and it gains more at higher levels, as shown in the Modification Slots column of the engineer class table. For each modification installed, your tech point maximum is reduced by 1. Over the course of a long rest, you can replace or remove a number of modifications up to your Intelligence modifier (minimum of one).</p>\n<p>Some modification effects require saving throws. When you use such an effect from this class, the DC equals your tech save DC.</p>\n<p>Your modified biochemist's pack comes equipped with a chemical distribution system, complete with three chemical mixtures: corrosive, invigorating, and noxious. As an action, you can activate your distributor and target a creature within 30 feet, with an effect determined by the mixture.</p>\n<h3>Corrosive Mixture</h3>\n<p>Your distributor emits a burst of acid. The target must make a Dexterity saving throw. On a failed save, a creature takes 1d6 + your Intelligence modifier acid damage. This mixture's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6).</p>\n<h3>Invigorating Mixture</h3>\n<p>Your distributor emits a bolt of kolto. The target gains 1d6 + your Intelligence modifier temporary hit points, which last until the end of your next turn. The temporary hit points granted by this mixture increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6).</p>\n<h3>Noxious Mixture</h3>\n<p>Your distributor emits a cloud of poison. The target must make a Constitution saving throw. On a failed save, a creature takes 1d6 + your Intelligence modifier poison damage. This mixture's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6).</p>\n<h2>Biochemist's Touch</h2>\n<p>Lastly at 3rd level, whenever you grant temporary hit points, or deal acid or poison damage using a tech power or class feature, you may expend one use of your Potent Aptitude to increase the potency. When you do so, the amount of temporary hit points you grant or damage you deal is increased by the amount rolled on the die. The damage is the same type as the original damage.</p>\n<h2>Potent Mixtures</h2>\n<p>Beginning at 6th level, when you cast a tech power of 1st-level or higher that grants temporary hit points, or deals acid or poison damage, you add your Intelligence modifier (a minimum of +1) to the roll.</p>\n<h2>Epicenter</h2>\n<p>At 14th level, as a reaction when you take damage from a creature within 15 feet of you that you can see, you can use one of your mixtures. The effects of the mixture release in a 15-foot-radius sphere centered on you, and if the mixture requires a saving throw, you automatically succeed on it. Additionally, the affected area is difficult terrain to creatures other than you until the end of your next turn.</p>\n<p>Once you've used this feature, you must complete a short or long rest before you can use it again.</p>\n<h2>Masterful Mixtures</h2>\n<p>Starting at 18th level, when you deal acid or poison damage using a tech power or class feature, you ignore resistance and treat immunity as resistance.</p>\n<h2>Biochem Modifications</h2>\n<p>If a modification has prerequisites, you must meet them to install it. You can install the modification at the same time that you meet its prerequisites.</p>\n<h3>Biochemist's Amplifer</h3>\n<p><em><strong>Prerequisite:</strong> 5th level</em> <br />You gain a +1 bonus to tech attack rolls. This bonus increases to +2 at 11th level and +3 at 17th level.</p>\n<h3>Biochemist's Inhibitor</h3>\n<p><em><strong>Prerequisite:</strong> 5th level</em> <br />You gain a +1 bonus to your tech save DC. This bonus increases to +2 at 11th level and +3 at 17th level.</p>\n<h3>Chemical Counteragents</h3>\n<p>You may choose one type of damage that benefits from your Biochemist's Touch and Potent Mixtures features. While wearing your modified biochemist's pack you have resistance to that type of damage.</p>\n<p>You can select this modification multiple times. Each time you do so, you must choose a different damage type.</p>\n<h3>Countertoxin</h3>\n<p>When you or an ally within 30 feet of you is suffering from the poisoned condition, you may use your reaction on your turn to end the poisoned condition on that creature. The creature also gains immunity to the poisoned condition for one minute.</p>\n<p>You can use this feature a number of times equal to your Intelligence modifier (a minimum of once). You regain all expended uses when you complete a short or long rest.</p>\n<h3>Detachable Distribution System</h3>\n<p>You upgrade your distributor with a secondary, detachable distributor. As a bonus action, you can throw your detachable distributor at a point within range. Your detachable distributor has a range equal to 30 feet + your Strength modifier x 5. Your detachable distributor works for 1 minute before coming inert. Once it does so, you can't use it again until you recover it as an action.</p>\n<p>Additionally, while your detachable distributor is within 100 feet of you, when you use your action to activate your distributor, you can choose to affect each creature within 5 feet of your detachable distributor. You can use this feature a number of times equal to your Intelligence modifier (a minimum of once). You regain all expended uses when you complete a short or long rest.</p>\n<h3>Drone Distribution System</h3>\n<p>You upgrade your distributor, interfacing it with the target of your @Compendium[sw5e.techpowers.PopHJSVZq9t1FFf5]{Tracker Droid Interface}&nbsp;power. When you use your action to activate your distributor, while your tracker droid is within 100 feet of you, you can choose to have your tracker droid deliver the mixture. Your tracker droid must use its reaction to deliver the mixture.</p>\n<p>You can use this feature a number of times equal to your Intelligence modifier (a minimum of once). You regain all expended uses when you complete a short or long rest.</p>\n<h3>Expanded Chemicals: Combustibles</h3>\n<p><em><strong>Prerequisite:</strong> 5th level</em> <br />You add additional chemicals to your modified biochemist's pack. When you deal fire damage with a tech power or class feature, you can use your Biochemist's Touch and Potent Mixture features.</p>\n<p>Additionally, when a creature fails their Dexterity saving throw against your Corrosive Mixtures feature, you can choose to instead deal fire damage. If you do so, each creature within 5 feet of the target takes fire damage equal to your Intelligence modifier. You can use this feature a number of times equal to your Intelligence modifier (a minimum of once). You regain all expended uses when you complete a short or long rest.</p>\n<h3>Expanded Chemicals: Cryogenics</h3>\n<p><em><strong>Prerequisite:</strong> 5th level</em> <br />You add additional chemicals to your modified biochemist's pack. When you deal cold damage with a tech power or class feature, you can use your Biochemist's Touch and Potent Mixture features.</p>\n<p>Additionally, when a creature fails their Constitution saving throw against your Noxious Mixtures feature, you can choose to instead deal cold damage. If you do so, its speed is reduced by 10 feet until the start of your next turn. You can use this feature a number of times equal to your Intelligence modifier (a minimum of once). You regain all expended uses when you complete a short or long rest.</p>\n<h3>Expanded Chemicals: Restorative</h3>\n<p><em><strong>Prerequisite:</strong> 5th level</em> <br />You add additional chemicals to your modified biochemist's pack. When you restore hit points with a tech power or class feature, you can use your Biochemist's Touch and Potent Mixture features.</p>\n<p>Additionally, when you use your Invigorating Mixture to grant temporary hit points to a creature, you can choose to restore that many hit points to the same creature. You can use this feature a number of times equal to your Intelligence modifier (a minimum of once). You regain all expended uses when you complete a short or long rest.</p>\n<h3>Expanded Mixtures: Adhesive</h3>\n<p>You've created a new mixture from your chemicals that you can use when you activate your distributor. When you do so, the target creature must make a Strength saving throw. If the creature is Large or larger, it has advantage on the saving throw. On a failed save, a creature's speed is reduced to 0 until the start of your next turn. As an action on their turn, an affected creature can repeat this saving throw, ending the effect on a success.</p>\n<h3>Expanded Mixtures: Blinding</h3>\n<p>You've created a new mixture from your chemicals that you can use when you activate your distributor. When you do so, the target creature must make a Constitution saving throw. On a failed save, a creature is blinded until the start of your next turn.</p>\n<h3>Expanded Mixtures: Hallucinogenic</h3>\n<p>You've created a new mixture from your chemicals that you can use when you activate your distributor. When you do so, the target creature must make an Intelligence saving throw. On a failed save, the target loses the ability to distinguish friend from foe, regarding all creatures it can see as enemies until the end of your next turn. Each time the target takes damage, it can repeat the saving throw, ending the effect on itself on a success.</p>\n<p>Whenever the affected creature chooses another creature as a target, it must choose the target at random from among the creatures it can see within range of the attack, power, or other ability it's using. If an enemy provokes an opportunity attack from the affected creature, the creature must make that attack if it is able to.</p>\n<p>This feature has no effect on droids or constructs.</p>\n<h3>Explosive Distribution System</h3>\n<p>You upgrade your distributor, granting it the ability to create a volley. When you use your action to activate your distributor, you can choose to affect each creature in a 10-foot-radius sphere centered on a point you can see within 30 feet.</p>\n<p>You can use this feature a number of times equal to your Intelligence modifier (a minimum of once). You regain all expended uses when you complete a short or long rest.</p>\n<h3>Injection Apparatus</h3>\n<p>You install a wrist mounted injection apparatus into your modified biochemist's pack. It is a simple vibroweapon with the finesse and light properties, and deals 1d4 kinetic damage on a hit. Your injection apparatus does not fill the hand slot, but you can't use it while the hand is full.</p>\n<p>When you hit with the weapon, you can activate your distributor to deploy one of your mixtures. If you do so, the target has disadvantage on the saving throw against your mixture.</p>\n<h3>Inoculation</h3>\n<p>You gain immunity to the poisoned and diseased conditions.</p>\n<h3>Integrated EVA Functionality</h3>\n<p>You make several additions to your modified biochemist's pack, you are protected from hazardous conditions, as if wearing an EVA suit, for as long as you are wearing your modified biochemist's pack.</p>\n<h3>Kolto Aerosol</h3>\n<p><em><strong>Prerequisite:</strong> 9th level</em> <br />You add a special dispersal system to your modified biochemist's pack. This system slowly disperses small amounts of kolto in the air. If creatures spend the entirety of a long rest within 30 feet of you, they regain all expended Hit Dice, instead of only half. Additionally, they are cured of any poisons or diseases that are suffering from.</p>\n<h3>Long-Range Distribution System</h3>\n<p>You upgrade your distributor, improving the range. When you use your action to activate your distributor, you can choose to increase the range to 60 feet.</p>\n<p>You can use this feature a number of times equal to your Intelligence modifier (a minimum of once). You regain all expended uses when you complete a short or long rest.</p>\n<h3>Luminous Gel</h3>\n<p>You've added a light-emitting gel to your modified biochemist's pack. As an action, you can coat an item, object, or location up to 5-foot-square with this gel. When you do so, the gel sheds bright light in a 10-foot radius and dim light for an additional 10 feet. The gel lasts for 1 hour before losing its potency. You can end this effect as a bonus action.</p>\n<h3>Oil Spill</h3>\n<p>As an action, you can cast the <em>oil slick</em> tech power without expending tech points. Casting the power in this way does not require concentration, and the oil will remain in place for the full duration of the power.</p>\n<p>Once you've used this feature, you must complete a short or long rest before you can use it again.</p>\n<h3>Persistent Chemicals</h3>\n<p><em><strong>Prerequisite:</strong> 7th level</em> <br />Whenever you use your Biochemist's Touch feature, you may select one creature that was damaged. At the start of each of that creature's turns, it must make a Constitution saving throw. On a failed save, it takes damage of the triggering type equal to your Intelligence modifier and has disadvantage on attack rolls until the start of its next turn. On a success, this feature ends, and the creature becomes immune to it for one day.</p>\n<p>Once you've used this feature, you must complete a short or long rest before you can use it again.</p>\n<h3>Piercing Gel</h3>\n<p><em><strong>Prerequisite:</strong> 11th level</em> <br /><em><strong>Prerequisite:</strong> Luminous Gel</em> <br />Your luminous gel now automatically dispels illusions and can detect invisibility, as with truesight.</p>\n<h3>Self-Injection Module</h3>\n<p>You install a special kolto injector into your modified biochemist's pack that can inject you with kolto in response to pain. When you take damage, you can use your reaction and expend a Hit Die to regain health as long as the damage would not reduce your hit points to 0.</p>\n<h3>Smart Dispersal System</h3>\n<p>When you activate your distributor, you can choose a number of creature equal to your Intelligence modifier. Those creature automatically succeed on their saving throws against your mixtures.</p>\n<h3>Spray Distribution System</h3>\n<p>You upgrade your distributor, granting it the ability to spray in a cone. When you use your action to activate your distributor, you can choose to affect each creature in a 15-foot cone.</p>\n<p>You can use this feature a number of times equal to your Intelligence modifier (a minimum of once). You regain all expended uses when you complete a short or long rest.</p>"
        },
        "source": "EC",
        "activation": {
            "cost": null,
            "type": ""
        },
        "actionType": "",
        "damage": {
            "parts": []
        },
        "armorproperties": {
            "parts": []
        },
        "weaponproperties": {
            "parts": []
        },
        "classCasterType": "Techcaster"
    },
    "flags": {
        "dynamiceffects": {
            "equipActive": false,
            "alwaysActive": false
        }
    },
    "img": "systems/sw5e/packs/Icons/Archetypes/Biochem%20Engineering.webp",
    "effects": []
}