{
    "_id": "2yiTq2k7xFpjcLVv",
    "name": "Biotech Engineering",
    "permission": {
        "default": 0,
        "IpSq6HI4edO6e0Yw": 3
    },
    "type": "archetype",
    "data": {
        "className": "Engineer",
        "description": {
            "value": "<h1>Biotech Engineering</h1>\n<p>Those engineers who choose the Biotech Engineering discipline focus on the skill of modifying and upgrading the body through the use of cybernetic limbs and implants.</p>\n<h2>Bonus Proficiencies</h2>\n<p>When you choose this discipline at 3rd level you gain proficiency in biotech's tools. Additionally, when you engage in crafting with biotech's tools, the rate at which you craft doubles.</p>\n<h2>Modified Self</h2>\n<p>Also at 3rd level, you&rsquo;ve learned to make modifications to your body, cybernetically augmenting yourself. Over the course of a long rest, you can modify yourself with cybernetic augmentations. You must have biotech's tools in order to perform this modification.</p>\n<p>While you have at least one cybernetic augmentation installed, your body counts as a tech focus for your tech powers. Additionally, you have 4 modification slots, and you gain more at higher levels, as shown in the Modification Slots column of the engineer class table. For each modification installed in excess of your proficiency bonus, your tech point maximum is reduced by 1. Over the course of a long rest, you can replace or remove a number of modifications up to your Intelligence modifier (minimum of one).</p>\n<p>Some modification effects require saving throws. When you use such an effect from this class, the DC equals your tech save DC.</p>\n<h2>Quick-Release Stimulant</h2>\n<p>Lastly at 3rd level, when you are dealt damage by an attack while you have at least one cybernetic augmentation installed, you can use your reaction and expend one use of your Potent Aptitude to reduce the damage you take. The damage is reduced by an amount equal to 1d10 + your Constitution modifier + your engineer level. If you reduce the damage to 0, you can gain temporary hit points equal to the remaining damage reduction.</p>\n<h2>Overclock Body</h2>\n<p>Beginning at 6th level, you've learned to use your body as a conduit for your tech powers. When you cast a tech power, you can choose to pay up to half the cost of the tech power using your hit points instead of your tech points. When you do so, your maximum hit points are reduced by the same amount. This effect is cumulative, and it lasts until you complete a long rest.</p>\n<h2>More Machine Than Man</h2>\n<p>At 14th level, while you have temporary hit points, when you are subjected to an effect that allows you to make a saving throw to take only half damage, you instead take no damage if you succeed on a saving throw, and only half damage if you fail.</p>\n<h2>Focused Augmentation</h2>\n<p>Starting at 18th level, you add your Intelligence modifier to Constitution saving throws you make to maintain concentration.</p>\n<p>Additionally, when you cast a power that requires concentration and would affect only one target, you can target an additional creature with that power.</p>\n<h2>Biotech Modifications</h2>\n<p>If a modification has prerequisites, you must meet them to install it. You can install the modification at the same time that you meet its prerequisites.</p>\n<h3>Active Camouflage Core</h3>\n<p><em><strong>Prerequisite:</strong> 13th level</em></p>\n<p>As an action, you can activate this augmentation to cast the infiltrate tech power targeting yourself. Intelligence is your tech casting ability for this power, and if you cast it using this augmentation, it does not require concentration.</p>\n<h3>Anti-Dazzle Ocular Implant</h3>\n<p>This augmentation replaces your eyes.</p>\n<p>You are immune to the blinded condition, and you can enable or disable your ability to see anytime. Additionally, your eyes are equipped with a holorecorder device. You can perfectly recall anything you've sees in the last 7 days.</p>\n<h3>Auto-Defibrillator</h3>\n<p><em><strong>Prerequisite:</strong> 5th level</em></p>\n<p><em><strong>Prerequisite:</strong> Hardy Torso Prothesis</em></p>\n<p>The Constitution score of your Hardy Torso Prosthesis increases by 2. Additionally, when you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. You can't use this feature again until you finish a long rest. &lt;h3</p>\n<p>This augmentation replaces an arm.</p>\n<p>When you make an ability check, attack roll, or saving throw using Strength using only this arm, your Strength score is treated as 15. When you make an ability check, attack roll, or saving throw using Strength using more than just this arm, you take the average of the arm's Strength score and your own.</p>\n<p>You can choose this modification multiple times.</p>\n<h3>Celerity Leg Prosthesis</h3>\n<p>This augmentation replaces both legs.</p>\n<p>When determining your bonus to AC and saving throws from Dexterity, your Dexterity score is treated as 15. Additionally, you can substitute this score for your own whenever you make an ability check or attack roll that uses your legs. If your Dexterity score is already equal to or greater than 15, it has no effect on you.</p>\n<h3>Detachable Eye</h3>\n<p>This augmentation replaces an eye.</p>\n<p>As an action, you can remove or replace this eye. While removed, the eye sprouts eight small legs, has a speed of 15 feet, an AC of 10, and 1 hit point As an action on each of your turns, you can move the eye up to its speed as long as it is within 30 feet of you. You can see through both the detached eye and your remaining eye at the same time, or you can use your action to see through only one eye or the other.</p>\n<p>You can choose this modification multiple times.</p>\n<h3>Detachable Hand</h3>\n<p>This augmentation replaces a hand.</p>\n<p>As an action, you can attach or detach this hand. While detached, the hand has a speed of 15 feet, an AC of 10, and 1 hit point. As an action on each of your turns, you can control the hand as long as it is within 30 feet of you. You can use the hand to manipulate an object, open an unlocked door or container, stow or retrieve an item from an open container, or pour the contents out of a container. You can move the hand up to its speed each time you use it</p>\n<p>You can choose this modification multiple times.</p>\n<h3>Frailcasting Inhibitor</h3>\n<p><em><strong>Prerequisite:</strong> 5th level</em></p>\n<p>While using your body as a tech focus, you gain a +1 bonus to the tech save DC of powers you cast that requires a Strength or Constitution saving throw. This bonus increases to +2 at 9th level and +3 at 13th level.</p>\n<h3>Hardy Torso Prosthesis</h3>\n<p>This augmentation replaces your torso.</p>\n<p>Your Constitution score becomes 13. If your Constitution score is already equal to or greater than 13, it has no effect on you. Additionally, you have advantage on saving throws against poison.</p>\n<h3>Harpoon Hand</h3>\n<p>This augmentation replaces a hand.</p>\n<p>You modify your hand, granting it the ability to transform into a harpoon. With this hand, you can make a ranged weapon attack with a range of 30/60. On a hit, it deals 1d6 kinetic damage. This attack can target a surface, object, or creature.</p>\n<p>A creature struck by this attack is impaled by the harpoon. As an action, a creature can attempt to remove the harpoon. Removing the harpoon requires a Strength check. While the harpoon is stuck in the target, you are connected to the target by a 60 foot cable.</p>\n<p>While the harpoon is deployed, you can use your bonus action to activate the reel, pulling yourself to the location if the target is larger than you. A creature or object your size or smaller is pulled to you. Alternatively, you can opt to release the cable (no action required).</p>\n<p>Once you've used this feature, you can&rsquo;t use your hand again until you recover and reinsert it as an action.</p>\n<p>You can choose this modification multiple times.</p>\n<h3>Integrated Subdermal Armor</h3>\n<p><em><strong>Prerequisite:</strong> 5th level</em></p>\n<p>When you aren't wearing armor, your AC becomes 13 + your Dexterity modifier.</p>\n<h3>Iridonian Grav-Lev Hand</h3>\n<p>This augmentation replaces a hand.</p>\n<p>Your unarmed strikes with this arm deal 1 d4 ion damage, and you count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift Additionally, you deal double damage to energy-based structures with your unarmed strikes.</p>\n<p>You can choose this modification multiple times.</p>\n<h3>Magnetic Forearm Enhancement</h3>\n<p>This augmentation replaces a forearm.</p>\n<p>Unarmed strikes with this hand have the reach property.</p>\n<p>You can choose this modification multiple times.</p>\n<h3>Mighty Prowess Enabler</h3>\n<p><em><strong>Prerequisite:</strong> 5th level</em></p>\n<p><em><strong>Prerequisite:</strong> Brawny Arm Prothesis</em></p>\n<p>The Strength score of your Brawny Arm Prosthesis increases by 2. Additionally, you are considered proficient with any weapon you wield with this arm. If the weapon requires two hands to use, and you are not already proficient with it, you only add half your proficiency bonus to attack rolls you make with it, unless you wield it in two of these hands.</p>\n<p>You can choose this modification multiple times.</p>\n<h3>Nighthawk Ocular Implant</h3>\n<p>This augmentation replaces your eyes.</p>\n<p>You can activate or deactivate this implant as a bonus action. While active, you gain darkvision to a range of 120 feet.</p>\n<h3>Powered Harpoon Hand</h3>\n<p><em><strong>Prerequisite:</strong> 9th level</em></p>\n<p><em><strong>Prerequisite:</strong> Harpoon Hand</em></p>\n<p>While your harpoon hand is deployed, when you cast a tech power with a range of touch, your hook can deliver the power as if it had cast it.</p>\n<h3>Rendcasting Inhibitor</h3>\n<p><em><strong>Prerequisite:</strong> 5th level</em></p>\n<p>While using your body as a tech focus, you gain a +1 bonus to the tech save DC of powers you cast that requires a Dexterity or Intelligence saving throw. This bonus increases to +2 at 9th level and +3 at 13th level.</p>\n<h3>Skills Enhancement Package</h3>\n<p><em><strong>Prerequisite:</strong> 13th level</em></p>\n<p>When you make an ability check using a skill you are proficient in, you can roll a d4 and add the result to your total.</p>\n<h3>Sound Dampeners</h3>\n<p>This augmentation replaces your ears.</p>\n<p>You are immune to the deafened condition, and you can enable or disable your ability to hear anytime. Additionally, your ears are equipped with a person translator that allows you to understand up to 15 languages different, however, you cannot speak them. The languages can be changed out while interfaced with a protocol droid or appropriate computer.</p>\n<h3>Surveillance Implant</h3>\n<p>This augmentation replaces your face.</p>\n<p>This implant includes a headcomm with a scrambler that automatically encodes messages sent to a specified recipient commlink or receiver.</p>\n<h3>Survival And Surveillance Implant</h3>\n<p><em><strong>Prerequisite:</strong> 9th level</em></p>\n<p>This augmentation replaces your eyes and face.</p>\n<p>This implant contains several tools for long-term survival and reconnaissance. As a bonus action, you can activate one of the below modes that enable you to use several of these tools at once. Activating a different mode deactivates any currently active mode.</p>\n<ul>\n<li>Communications Mode: This communications suite includes a headcomm with a scrambler that automatically encodes messages sent to a specified recipient commlink or receiver. While this mode is active, you cannot be deafened.</li>\n<li>Interceptor Mode: This is a jamming and electronic warfare suite that includes a comm jammer, a holotrace device and pocket scrambler.</li>\n<li>Respirator Mode: This includes a basic respirator that grants advantage on saving throws made to avoid being poisoned and resistance to poison damage.</li>\n</ul>\n<h3>Swift Gait Attuner</h3>\n<p><em><strong>Prerequisite:</strong> 5th level</em></p>\n<p><em><strong>Prerequisite:</strong> Celerity Leg Prothesis</em></p>\n<p>The Dexterity score of your Celerity Leg Prosthesis increases by 2. Additionally, you gain proficiency in Dexterity saving throws.</p>\n<p>You can choose this modification multiple times.</p>\n<h3>Vector Amplifier</h3>\n<p><em><strong>Prerequisite:</strong> 5th level</em></p>\n<p>While using your body as a tech focus, you gain a +1 bonus to melee tech attack rolls. This bonus increases to +2 at 9th level and +3 at 13th level.</p>\n<h3>Vector Rangefinder</h3>\n<p><em><strong>Prerequisite:</strong> 5th level</em></p>\n<p>While using your body as a tech focus, you gain a +1 bonus to ranged tech attack rolls. This bonus increases to +2 at 9th level and +3 at 13th level.</p>\n<h3>Voice Synthesizer</h3>\n<p><em><strong>Prerequisite:</strong> 5th level</em></p>\n<p>This augmentation replaces your throat.</p>\n<p>This augmentation allows you to synthesize and perfectly mimic any voice that you have heard in the last month, and the synthesizer can translate verbal communications between up to 5 languages. The languages can be changed out while interfaced with a protocol droid or appropriate computer. Additionally, you can add your Intelligence modifier to any Charisma (Deception) check made to lie to another creature.</p>\n<h3>Weapon Integration</h3>\n<p>This augmentation replaces a forearm.</p>\n<p>You can integrate a single weapon that weighs no more than 8 lb. into your forearm. While integrated, you can use a bonus action to hide or reveal the weapon, which can only be used while revealed. While hidden, the weapon has the hidden property. While revealed, the weapon has the fixed property.</p>\n<p>You can choose this modification multiple times.</p>\n<h3>Withercasting Inhibitor</h3>\n<p><em><strong>Prerequisite:</strong> 5th level</em></p>\n<p>While using your body as a tech focus, you gain a +1 bonus to the tech save DC of powers you cast that requires a Wisdom or Charisma saving throw. This bonus increases to +2 at 9th level and +3 at 13th level.</p>"
        },
        "source": "EC",
        "classCasterType": "Techcaster"
    },
    "flags": {
        "core": {
            "sourceId": "Item.wzj7DowWJZfxWwq7"
        }
    },
    "img": "systems/sw5e/packs/Icons/Archetypes/Biotech%20Engineering.webp",
    "effects": []
}