{
    "_id": "m0oQQxDCTO6nqWnz",
    "name": "Cybertech Engineering",
    "permission": {
        "default": 0,
        "IpSq6HI4edO6e0Yw": 3
    },
    "type": "archetype",
    "data": {
        "className": "Engineer",
        "description": {
            "value": "<h1>Cybertech Engineering</h1>\n<p>Those engineers who choose the Cybertech Engineering discipline focus on the ability to craft reusable consumables and items that augment and complement their techcasting abilities.</p>\n<h2>Bonus Proficiencies</h2>\n<p>When you choose this discipline at 3rd level, you gain proficiency in cybertech's tools. additionally, when you engage in crafting with cybertech's tools, the rate at which you craft doubles.</p>\n<h2>Cybertech Contraptions</h2>\n<p>Also at 3rd level, you learn modify gadgets and wristpads utilizing your cybertech knowledge. Over the course of a long rest, you can expend 500 cr worth of materials to modify your wristpad. You must have a wristpad, materials, and cybertech's tools in order to perform this modification.</p>\n<p>Your wristpad requires attunement, can only be used by you, and counts as a tech focus for your tech powers while you are attuned to it. Your modified wristpad has 4 modification slots, and it gains more at higher levels, as shown in the Modification Slots column of the engineer class table. For each modification installed, your tech point maximum is reduced by 1. Over the course of a long rest, you can replace or remove a number of modifications up to your Intelligence modifier (minimum of one).</p>\n<p>Some modification effects require saving throws. When you use such an effect from this class, the DC equals your tech save DC.</p>\n<h2>Potent Techcasting</h2>\n<p>Lastly at 3rd level, when you miss with a tech attack roll, or a creature succeeds on a saving throw against a tech power you cast, you can expend one use of your Potent Aptitude to overwhelm them. Roll the die, and either add it to the attack roll or subtract it from their saving throw.</p>\n<h2>Adaptable Applications</h2>\n<p>Beginning at 6th level, when you cast a tech power of 1st level or higher, you can choose to deal additional damage or provide additional healing with that power. The additional damage or healing equals half your engineer level (rounded down).</p>\n<p>You can use this feature a number of times equal to your Intelligence modifier (a minimum of once). You regain all expended uses when you complete a long rest.</p>\n<h2>Combat Contrivances</h2>\n<p>At 14th level, when you use your action to a cast a 1st-level or higher tech power, you can use your bonus action to gain temporary hit points equal to the level of the tech power + your Intelligence modifier.</p>\n<h2>Perfected Purposing</h2>\n<p>Starting at 18th level, when you cast a tech power, you can choose to deal maximum damage or provide maximum healing with that power.</p>\n<p>Once you've used this feature, you must complete a short or long rest before you can use it again.</p>\n<h2>Cybertech Modifications</h2>\n<p>If a modification has prerequisites, you must meet them to install it. You can install the modification at the same time that you meet its prerequisites.</p>\n<h3>Advanced Biotic Amplifier</h3>\n<p><em><strong>Prerequisite:</strong> 15th level</em> <br /><em><strong>Prerequisite:</strong> Prototype Biotic Amplifier</em> <br />You further fine tune your biotic amplifier. While wielding this amplifier, when a creature gains temporary hit points from your biotic amplifier, it instead gains four times as many. This amount can't exceed the number of hit points regained.</p>\n<h3>Advanced Corrosive Amplifier</h3>\n<p><em><strong>Prerequisite:</strong> 15th level</em> <br /><em><strong>Prerequisite:</strong> Prototype Corrosive Amplifier</em> <br />You further fine tune your Corrosive Amplifier. When you activate this amplifier, the next attack roll made by that creature before the end of its next turn has disadvantage.</p>\n<h3>Advanced Cryo Amplifier</h3>\n<p><em><strong>Prerequisite:</strong> 15th level</em> <br /><em><strong>Prerequisite:</strong> Prototype Cryo Amplifier</em> <br />You further fine tune your Cryo Amplifier. When you activate this amplifier, the creature is restrained until the end of your next turn.</p>\n<h3>Advanced Explosive Amplifier</h3>\n<p><em><strong>Prerequisite:</strong> 15th level</em> <br /><em><strong>Prerequisite:</strong> Prototype Explosive Amplifier</em> <br />You further fine tune your Explosive Amplifier. When a creature takes fire damage while ignited, the creature has disadvantage on the next Dexterity saving throw it makes before the start of your next turn.</p>\n<h3>Arakyd Vector</h3>\n<p><em><strong>Prerequisite:</strong> 5th level</em> <br />You gain a +1 bonus to tech attack rolls. This bonus increases to +2 at 11th level and +3 at 17th level.</p>\n<h3>Augmented Explosive</h3>\n<p>You can augment a single grenade, mine, or thermal detonator to regain its charge. An augmented explosive can only be used by you, and it uses your tech save DC instead of its own. Once you've activated an explosive, it can't be activated again until you finish a short or long rest.</p>\n<p>You can select this modification multiple times. Each time you do so, you can maintain an additional augmented explosive, to a maximum equal to your Intelligence modifier.</p>\n<h3>Belasco Dynamics</h3>\n<p><em><strong>Prerequisite:</strong> 5th level</em> <br />You gain a +1 bonus to your tech save DC. This bonus increases to +2 at 11th level and +3 at 17th level.</p>\n<h3>Biotic Amplifier</h3>\n<p>You integrate a biotic amplifier in your wristpad that increases the potency of your healing tech powers. While wielding this amplifier, when a creature regains hit points from a tech power you cast, you can grant them temporary hit points equal to the amount of tech points spent. This amount can't exceed the number of hit points restored.</p>\n<p>You can use this amplifier a number of times equal to your Intelligence modifier. You regain all expended uses when you complete a short or long rest.</p>\n<h3>Climbing Gloves</h3>\n<p>You craft a set of gloves with a powerful assisted grip. While wearing these gloves, you have a climbing speed of 20 feet, and you have advantage on Strength saving throws and Strength (Athletics) checks that involve climbing.</p>\n<h3>Corrosive Amplifier</h3>\n<p>You integrate a booster in your wristpad that enhances your tech powers that deal acid damage. While wielding this amplifier, when a creature takes acid damage from a tech power you cast, you can choose to deal additional acid damage equal to your Intelligence modifier.</p>\n<p>You can use this amplifier a number of times equal to your Intelligence modifier (a minimum of once). You regain all expended uses when you complete a short or long rest.</p>\n<h3>Cryo Amplifier</h3>\n<p>You integrate a booster in your wristpad that enhances your tech powers that deal cold damage. While wielding this amplifier, when a creature takes cold damage from a tech power you cast, you can choose to deal additional cold damage equal to your Intelligence modifier.</p>\n<p>You can use this amplifier a number of times equal to your Intelligence modifier (a minimum of once). You regain all expended uses when you complete a short or long rest.</p>\n<h3>Darkvision Goggles</h3>\n<p>You craft a pair of sight-enhancing goggles. While wearing these goggles, you have darkvision to a range of 60 feet. If you already have darkvision, this modification increases its range by 30 feet.</p>\n<h3>Explosive Amplifier</h3>\n<p>You integrate a booster in your wristpad that enhances your tech powers that deal fire damage. While wielding this amplifier, when a creature takes fire damage from a tech power you cast, you can choose to deal additional fire damage equal to your Intelligence modifier.</p>\n<p>You can use this amplifier a number of times equal to your Intelligence modifier (a minimum of once). You regain all expended uses when you complete a short or long rest.</p>\n<h3>Imaging Amplifier</h3>\n<p>You integrate a booster in your wristpad that enhances your illusionary tech powers. While wielding this amplifier, when a creature attempts an Intelligence (Investigation) check against a tech power you cast to discern the illusion for what it is, you can force the creature to have disadvantage on the roll (no action required). Alternatively, when you cast the <em>mirror image</em> tech power, you create a fourth duplicate. While you have four duplicates, you must roll a 5 or higher on the d20 roll to change an attack's target to a duplicate.</p>\n<p>You can use this amplifier a number of times equal to your Intelligence modifier (a minimum of once). You regain all expended uses when you complete a short or long rest.</p>\n<h3>Jet Boots</h3>\n<p><em><strong>Prerequisite:</strong> 7th level</em> <br />You find tune your augmented boots to give you temporary, limited flight. Activating or deactivating the boots requires a bonus action and, while active, you have a flying speed of 30 feet.</p>\n<p>The rocket boots last for 1 minute before deactivating. Once the boots have been activated, they can't be activated again until you finish a short or long rest.</p>\n<h3>Mechanical Arm</h3>\n<p>You create a mechanical arm which mounts to your shoulder, which you can use independently. You can only gain the benefit of items held by two of your arms at any given time.</p>\n<p>You can choose this modification twice.</p>\n<h3>Prototype Biotic Amplifier</h3>\n<p><em><strong>Prerequisite:</strong> 7th level</em> <br /><em><strong>Prerequisite:</strong> Biotic Amplifier</em> <br />You fine tune your biotic amplifier. While wielding this amplifier, when a creature gains temporary hit points from your biotic amplifier, it instead gains twice as many. This amount can't exceed the number of hit points regained.</p>\n<h3>Prototype Corrosive Amplifier</h3>\n<p><em><strong>Prerequisite:</strong> 7th level</em> <br /><em><strong>Prerequisite:</strong> Corrosive Amplifier</em> <br />You fine tune your Corrosive Amplifier. When you activate this amplifier, the next attack roll made against that creature before the end of its next turn has advantage.</p>\n<h3>Prototype Cryo Amplifier</h3>\n<p><em><strong>Prerequisite:</strong> 7th level</em> <br /><em><strong>Prerequisite:</strong> Cryo Amplifier</em> <br />You fine tune your Cryo Amplifier. When you activate this amplifier, the creature's speed is reduced by 10 feet until the end of your next turn. If the tech power already reduces the creature's speed, that amount is instead increased by 5 feet.</p>\n<h3>Prototype Explosive Amplifier</h3>\n<p><em><strong>Prerequisite:</strong> 7th level</em> <br /><em><strong>Prerequisite:</strong> Explosive Amplifier</em> <br />You fine tune your Explosive Amplifier. When you activate this amplifier, the creature is also ignited for 1 minute. At the start of each of its turns, the creature takes additional fire damage equal to your Intelligence modifier and then makes a Dexterity saving throw against your tech save DC, ending this effect on a success.</p>\n<p>If the target or a creature within 5 feet of it uses an action to put out the flames, or if some other effect douses the flames, the effect ends.</p>\n<h3>Powered Grappling Hook</h3>\n<p><em><strong>Prerequisite:</strong> 9th level</em> <br /><em><strong>Prerequisite:</strong> Wrist-Mounted Grappling Hook</em> <br />While your wrist-mounted grappling hook is deployed, when you cast a tech power with a range of touch, your hook can deliver the power as if it had cast it.</p>\n<h3>Sentry Turret</h3>\n<p>You learn how to craft small sentry turrets shaped like globes that can adhere to any surface. As an action or bonus action (your choice), you can throw a sentry to a point you can see within range (30 feet + your Strength modifier x 5). At the end of each of your turns, a deployed sentry automatically targets a hostile creature within 10 feet of it. If multiple targets are available, one is chosen at random. The target must make a Dexterity saving throw. On a failed save, it takes 1d4 energy damage and its speed is reduced by 5 until the end of your next turn.</p>\n<p>The sentries have 1 hit point, an armor class of 10, and can be repaired over the course of a long rest. Each sentry lasts for 1 minute before deactivating. You can maintain a number of sentries equal to your Intelligence modifier. Once a sentry has been activated, it can't be activated again until you finish a short or long rest.</p>\n<h3>Truesight Goggles</h3>\n<p><em><strong>Prerequisite:</strong> 11th level</em> <br /><em><strong>Prerequisite:</strong> Darkvision Goggles</em> <br />You modify your goggles with a toggle allowing you to briefly gain enhanced sight. As a bonus action, you can activate the truesight feature of your goggles. When toggled on, for the next minute your goggles now automatically dispel illusions and can detect invisibility, as with truesight.</p>\n<p>Once you've used this feature, you must complete a short or long rest before you can use it again.</p>\n<h3>Wrist-Mounted Grappling Hook</h3>\n<p>You craft a wrist-mounted grappling hook weapon attached to a tightly coiled cord. With this contraption, you can make a ranged weapon attack with a range of 30/60. On a hit, it deals 1d4 kinetic damage. This attack can target a surface, object, or creature.</p>\n<p>A creature struck by this attack is impaled by the hook. As an action, a creature can attempt to remove the hook. Removing the hook requires a Strength check. While the hook is stuck in the target, you are connected to the target by a 60 foot cable.</p>\n<p>While the hook is deployed, you can use your bonus action to activate the reel, pulling yourself to the location if the target is your size or larger. A creature or object smaller than you is pulled to you. Alternatively, you can opt to release the cable (no action required).</p>\n<p>Once you've used this feature, you can't use it again until you recover and reinsert the hook as an action.</p>"
        },
        "source": "EC",
        "activation": {
            "cost": null,
            "type": ""
        },
        "actionType": "",
        "damage": {
            "parts": []
        },
        "armorproperties": {
            "parts": []
        },
        "weaponproperties": {
            "parts": []
        },
        "classCasterType": "Techcaster"
    },
    "flags": {
        "dynamiceffects": {
            "equipActive": false,
            "alwaysActive": false
        }
    },
    "img": "systems/sw5e/packs/Icons/Archetypes/Cybertech%20Engineering.webp",
    "effects": []
}