{
    "_id": "ZDNCB88TzeMFGY6i",
    "name": "Deadeye Technique",
    "permission": {
        "default": 0,
        "IpSq6HI4edO6e0Yw": 3
    },
    "type": "archetype",
    "data": {
        "className": "Scout",
        "description": {
            "value": "<h1>Deadeye Technique</h1>\n<p>Some scouts becomes legends written in blaster burns. Followers of the Deadeye Technique the art of the blaster shot and utilize their incredible focus to make shots that most would deem impossible. When everything depends on one shot, you want a Deadeye pulling the trigger.</p>\n<p>Due to their uncanny focus, Deadeyes can make shots that other marksmen would never dare to attempt. Deadeyes know how to make the most of ranged weapons and can use them to greater effect than other Scouts.</p>\n<h2>Focused Superiority</h2>\n<p>When you choose this technique at 3rd level, you learn maneuvers that are fueled by special dice called superiority dice.</p>\n<h3>Maneuvers</h3>\n<p>You know two maneuvers of your choice, which are detailed under \"Maneuvers\" below, and you earn more at higher levels, as shown in the Maneuvers Known column of the Deadeye Technique Focused Superiority table. Many maneuvers enhance an attack in some way. You can use only one maneuver per attack, and you may only use each maneuver once per turn.</p>\n<p>Each time you learn new maneuvers, you can also replace one maneuver you know with a different one.</p>\n<h3>Superiority Dice</h3>\n<p>You have two superiority dice, which are d6s, and you earn more at higher levels, as shown in the Superiority Dice column of the Deadeye Technique Focused Superiority table. A superiority die is expended when you use it. You regain all of your expended superiority dice when you finish a short or long rest.</p>\n<h3>Saving Throws</h3>\n<p>Some of your maneuvers require your target to make a saving throw to resist the maneuver's effects. The saving throw DC is calculated as follows:</p>\n<p><strong>Maneuver save DC</strong> = 8 + your proficiency bonus + your Dexterity modifier</p>\n<div class=\"classtable\">\n<blockquote>\n<table>\n<thead>\n<tr>\n<td style=\"color: #000000; text-transform: uppercase; font-family: 'Russo One'; background-color: #bdc8cc; font-size: 16px;\" colspan=\"6\"><em>Deadeye Technique Focused Superiority</em></td>\n</tr>\n<tr>\n<th align=\"center\">Level</th>\n<th align=\"center\">Focused Superiority</th>\n<th align=\"center\">Superiority Dice</th>\n<th align=\"center\">Maneuvers Known</th>\n</tr>\n</thead>\n<tbody>\n<tr class=\"rows\">\n<td align=\"center\">3rd</td>\n<td align=\"center\">d4</td>\n<td align=\"center\">2</td>\n<td align=\"center\">2</td>\n</tr>\n<tr class=\"rows\">\n<td align=\"center\">4th</td>\n<td align=\"center\">d4</td>\n<td align=\"center\">2</td>\n<td align=\"center\">2</td>\n</tr>\n<tr class=\"rows\">\n<td align=\"center\">5th</td>\n<td align=\"center\">d6</td>\n<td align=\"center\">2</td>\n<td align=\"center\">2</td>\n</tr>\n<tr class=\"rows\">\n<td align=\"center\">6th</td>\n<td align=\"center\">d6</td>\n<td align=\"center\">2</td>\n<td align=\"center\">2</td>\n</tr>\n<tr class=\"rows\">\n<td align=\"center\">7th</td>\n<td align=\"center\">d6</td>\n<td align=\"center\">3</td>\n<td align=\"center\">3</td>\n</tr>\n<tr class=\"rows\">\n<td align=\"center\">8th</td>\n<td align=\"center\">d6</td>\n<td align=\"center\">3</td>\n<td align=\"center\">3</td>\n</tr>\n<tr class=\"rows\">\n<td align=\"center\">9th</td>\n<td align=\"center\">d8</td>\n<td align=\"center\">3</td>\n<td align=\"center\">3</td>\n</tr>\n<tr class=\"rows\">\n<td align=\"center\">10th</td>\n<td align=\"center\">d8</td>\n<td align=\"center\">3</td>\n<td align=\"center\">3</td>\n</tr>\n<tr class=\"rows\">\n<td align=\"center\">11th</td>\n<td align=\"center\">d8</td>\n<td align=\"center\">4</td>\n<td align=\"center\">4</td>\n</tr>\n<tr class=\"rows\">\n<td align=\"center\">12th</td>\n<td align=\"center\">d8</td>\n<td align=\"center\">4</td>\n<td align=\"center\">4</td>\n</tr>\n<tr class=\"rows\">\n<td align=\"center\">13th</td>\n<td align=\"center\">d10</td>\n<td align=\"center\">4</td>\n<td align=\"center\">4</td>\n</tr>\n<tr class=\"rows\">\n<td align=\"center\">14th</td>\n<td align=\"center\">d10</td>\n<td align=\"center\">4</td>\n<td align=\"center\">4</td>\n</tr>\n<tr class=\"rows\">\n<td align=\"center\">15th</td>\n<td align=\"center\">d10</td>\n<td align=\"center\">5</td>\n<td align=\"center\">5</td>\n</tr>\n<tr class=\"rows\">\n<td align=\"center\">16th</td>\n<td align=\"center\">d10</td>\n<td align=\"center\">5</td>\n<td align=\"center\">5</td>\n</tr>\n<tr class=\"rows\">\n<td align=\"center\">17th</td>\n<td align=\"center\">d12</td>\n<td align=\"center\">5</td>\n<td align=\"center\">5</td>\n</tr>\n<tr class=\"rows\">\n<td align=\"center\">18th</td>\n<td align=\"center\">d12</td>\n<td align=\"center\">5</td>\n<td align=\"center\">5</td>\n</tr>\n<tr class=\"rows\">\n<td align=\"center\">19th</td>\n<td align=\"center\">d12</td>\n<td align=\"center\">5</td>\n<td align=\"center\">5</td>\n</tr>\n<tr class=\"rows\">\n<td align=\"center\">20th</td>\n<td align=\"center\">d12</td>\n<td align=\"center\">5</td>\n<td align=\"center\">5</td>\n</tr>\n</tbody>\n</table>\n</blockquote>\n</div>\n<h2>Maneuvers</h2>\n<p>The maneuvers are presented in alphabetical order.</p>\n<h3>Crippling Shot</h3>\n<p>When you hit a creature with a ranged weapon attack, you can expend a superiority die to cripple its movement. Add the number rolled to the damage of the ranged weapon attack. The creature must succeed on a Constitution saving throw or have its movement speed halved. At the end of each of its turns, the target can make a Constitution saving throw to end the effect.</p>\n<h3>Daring Escape</h3>\n<p>You can expend one superiority die to take the Disengage action as a bonus action until the end of your turn. Until the end of this turn, you have advantage on all Strength (Athletics) checks.</p>\n<h3>Covering Fire</h3>\n<p>When you hit a creature with a ranged weapon attack, you can expend one superiority die to maneuver one of your comrades into a more advantageous position. You add the superiority die to the attack's damage roll, and you choose a friendly creature who can see or hear you.</p>\n<p>That creature can use its reaction to move up to half its speed without provoking opportunity attacks from the target of your attack.</p>\n<h3>Disarming Shot</h3>\n<p>When you hit a creature with a ranged weapon attack, you can expend one superiority die to attempt to disarm the target, forcing it to drop one item of your choice that it's holding. Add the superiority die to the attack's damage roll, and the target must make a Strength saving throw. On a failed save, it drops the object you choose. The object lands at its feet.</p>\n<h3>Distracting Shot</h3>\n<p>When you hit a creature with a ranged weapon attack, you can expend one superiority die to distract the creature, giving your allies an opening. You add the superiority die to the attack's damage roll. The next attack roll against the target by an attacker other than you has advantage if the attack is made before the start of your next turn.</p>\n<h3>Exploit Weakness</h3>\n<p>When you hit a creature with a weapon attack, you can expend a superiority die and deal additional damage equal to the number rolled. This damage cannot be reduced in any way.</p>\n<h3>Penetrating Shot</h3>\n<p>When you hit a creature with a ranged weapon attack, you can expend one superiority die to attempt to damage another creature with the same attack. Choose up to two creatures within 15 feet of and directly behind your initial target. If the original attack roll would hit the second creature(s), it takes damage equal to the number you roll on your superiority die.</p>\n<p>The damage is of the same type dealt by the original attack.</p>\n<h3>Precision Attack</h3>\n<p>When you make a weapon attack roll against a creature, you can expend one superiority die to add it to the roll. You can use this maneuver before or after making the attack roll, but before any effects of the attack are applied.</p>\n<h3>Return Fire</h3>\n<p>When a creature misses you with a ranged attack, you can use your reaction and expend one superiority die to make a ranged weapon attack against the creature. If you hit, you add the superiority die to the attack's damage roll.</p>\n<h2>Mark of the Deadeye</h2>\n<p>Also at 3rd level, the range of your Ranger's Quarry feature doubles. Additionally, when making ranged weapon attacks against the target of your Ranger's Quarry, the normal and long range of your ranged weapons double.</p>\n<h2>Cover to Cover</h2>\n<p>Beginning at 7th level, attack rolls made against you on your turn are made with disadvantage.</p>\n<h3>Deadeye Technique Focused Superiority</h3>\n<h2>Shoot First</h2>\n<p>Starting at 11th level, you have learned that the person who shoots first is often the one who walks out alive. When you make a ranged weapon attack against a creature that has not yet acted during your first turn in combat and you have advantage on the roll, you can reroll one of the dice once.</p>\n<p>Additionally, on a hit, you deal an extra 1d6 damage of the same type as the weapon.</p>\n<h2>Overwatch</h2>\n<p>At 15th level, you have become a master at protecting your allies from afar. When a creature attempts to make an opportunity attack against an allied creature, or forces your ally to make a saving throw, you can use your reaction to make an attack roll against the enemy creature.</p>\n<p>If your attack hits, either impose disadvantage on the enemy creature's opportunity attack roll or grant advantage to any allies making the saving throw.</p>"
        },
        "source": "PHB",
        "activation": {
            "cost": null,
            "type": ""
        },
        "actionType": "",
        "damage": {
            "parts": []
        },
        "armorproperties": {
            "parts": []
        },
        "weaponproperties": {
            "parts": []
        },
        "classCasterType": "Techcaster"
    },
    "flags": {
        "dynamiceffects": {
            "equipActive": false,
            "alwaysActive": false
        }
    },
    "img": "systems/sw5e/packs/Icons/Archetypes/Deadeye%20Technique.webp",
    "effects": []
}