{
    "_id": "PI1B9vYofzCXU9so",
    "name": "Doctor Pursuit",
    "permission": {
        "default": 0,
        "IpSq6HI4edO6e0Yw": 3
    },
    "type": "archetype",
    "data": {
        "className": "Scholar",
        "description": {
            "value": "<h1>Doctor Pursuit</h1>\n<p>Doctors study the medical, anatomical, and biological sciences. Those scholars who choose the Doctor Pursuit use their knowledge to mend their allies on the field and deal crippling blows with surgical precision.</p>\n<h2>Medical Practitioner</h2>\n<p>When you choose this pursuit at 3rd level, you gain proficiency with biochemist's kits and your choice of Medicine or Nature skills. Additionally, when you make a Wisdom (Medicine) check, you gain a bonus to the check equal to your Intelligence modifier.</p>\n<h2>Remote Healer</h2>\n<p>Also at 3rd level, you have learned to deploy medicine from a range. When you use a maneuver targeting an ally that is the target of your Critical Analysis feature, that maneuver's range becomes 30 feet.</p>\n<h2>Additional Maneuvers</h2>\n<p>Lastly at 3rd level, you gain access to new maneuvers which reflect the progress of your studies into the medical arts. Whenever you learn a new maneuver, you can choose from any of the following as well. The maneuvers are listed in alphabetical order.</p>\n<h3>Adrenaline Hit</h3>\n<p>You can use an action and expend one superiority die to inject a creature with regenerative medication that temporarily enhances their agility. When you do so, a creature you can touch regains hit points equal to the superiority die roll. Additionally, until the start of your next turn, when that creature would take damage, the amount is reduced by an amount equal to your Intelligence modifier.</p>\n<h3>Emergency Prescription</h3>\n<p>As an action, you can expend one superiority die and touch a creature. That creature regains hit points equal to result of the die + your Intelligence modifier, and when that creature makes their first ability check, attack roll, or saving throw before the start of your next turn they roll the superiority die and add it to the roll.</p>\n<h3>Enhancement Injection</h3>\n<p>As an action, you can expend one superiority die to inject a creature you can touch with enhancements, granting them temporary hit points equal to the superiority die roll + your Intelligence modifier, which last for 1 minute. Additionally, when the target makes a Strength or Constitution check or saving throw while it has these temporary hit points, it gains a bonus equal to your Intelligence modifier.</p>\n<h3>Neuroblock</h3>\n<p>When you make an attack roll, you can expend a superiority die and add it to the attack roll. On a hit, the creature's next attack has disadvantage and it cannot regain hit points until the start of your next turn.</p>\n<h3>Reassure</h3>\n<p>As an action, you can expend a superiority die and call out to a creature within 60 feet that can see or hear you that is charmed, frightened, or stunned. When you do so, that creature immediately makes another saving throw, adding the amount rolled to the save.</p>\n<h3>Remove Toxins</h3>\n<p>As an action, you can expend a superiority die to purge the toxins from a creature you can touch. The target regains hit points equal to the number rolled and, if it is poisoned or diseased, you neutralize the poison or disease. If more than one poison or disease afflicts the target, you neutralize one poison or disease that you know is present, or you neutralize one at random.</p>\n<h3>Smelling Salts</h3>\n<p>As a bonus action, you can expend a superiority die to heal a creature you can touch by a number of hit points equal to the number rolled.</p>\n<h3>Transfusion</h3>\n<p>Once per turn when you hit a creature with a finesse melee weapon, you can expend a superiority to give you or an ally that is within 5 feet of the creature a transfusion. Add the superiority dice to the damage you deal. You or your ally gain hit points equivalent to the damage you deal to the creature.</p>\n<p>You can be the creature hit with the attack as long as there is an ally with 5 feet of you, in which you can let it hit without rolling an attack and must choose an ally to heal with the transfusion.</p>\n<h3>Weak Point Strike</h3>\n<p>When you hit a creature with a weapon attack, you can expend a superiority die to temporarily daze the creature. Add the number rolled to the damage of the weapon attack and the creature must succeed on a Constitution saving throw or be stunned until the end of its next turn.</p>\n<h2>Field Surgeon</h2>\n<p>Beginning at 6th level, whenever you expend superiority dice to restore hit points or grant temporary hit points to a creature, you can roll an additional die d6 and add it to the roll. This die increases when you reach certain levels in this class: 1d8 at 7th level, 1d10 at 11th level, and to 1d12 at 15th level.</p>\n<p>Additionally, whenever you expend superiority dice to restore hit points or grant temporary hit points to a creature, if the creature is the target of your Critical Analysis, you can instead choose the maximum on both dice. Once you've used this feature, you must finish a short or long rest before you can use it again. Starting at 11th level, you can use it twice before a rest, but only once on the same turn.</p>\n<h2>Resuscitate</h2>\n<p>Starting at 9th level, through your medical studies you have learned to delay seemingly inevitable death. As a bonus action, you can stabilize a creature you can touch that has 0 hit points.</p>\n<p>Additionally, as an action, you can tend to a creature you can touch that has died since the end of your last turn. The creature immediately regains 1 hit point and stabilizes. Once you've used this feature, you must complete a short or long rest before you can use it again.</p>\n<h2>Panacea</h2>\n<p>Once you've reached 17th level, you've developed the formula to concoct a cure-all miracle solution: a panacea. Over the course of 10 minutes, you can expend rare medical supplies worth 1,000 cr to create your panacea in a simple syringe. The panacea retains its potency for 24 hours. As a bonus action, a creature can use the panacea. Alternatively, as an action, they can administer it to another creature within 5 feet.</p>\n<p>The target has its exhaustion level reduced by one and regains all of its hit points. If the target is diseased, poisoned, paralyzed, or stunned, the condition ends.</p>\n<p>Once you create a panacea, you can't create another until you finish a long rest.</p>\n<h2>Discoveries (Doctor)</h2>\n<p>When you select this pursuit, you gain access to new discoveries which reflect the progress of your studies into the medical arts. Whenever you learn a new discovery, you can choose from any of the following as well. The discoveries are listed in alphabetical order.</p>\n<h3>Advanced Remote Healer</h3>\n<p><em><strong>Prerequisite:</strong> 12th level</em>&nbsp;<br />The range of your Remote Healer feature increases to 60 feet.</p>\n<h3>Experimental Treatments</h3>\n<p>Your medication and treatments are known to be untested and unstable. Immediately after you use a maneuver that causes a creature to regain hit points or gain temporary hit points, you can choose to roll on the Side Effects table to the right. The condition or effect lasts until the creature completes a long rest, or you use this feature again.</p>\n<p>You can use this feature a number of times equal to your Intelligence modifier. You regain all expended uses when you finish a short or long rest.</p>\n<h3>From the Brink</h3>\n<p><em><strong>Prerequisite:</strong> 7th level</em>&nbsp;<br />If the target of your Critical Analysis feature would be reduced to 0 hp, you may use your reaction and end your Critical Analysis feature to have them be reduced to 1 hp instead. Once a creature has benefited from this feature, they must complete a long rest before they can do so again.</p>\n<h3>Health Advisor</h3>\n<p>Whenever a creature that is a target of your Critical Analysis feature begins their turn, you can use your reaction to give them temporary hit points equal to one-fourth your scholar level (rounded down) + your Intelligence modifier (minimum of one) which last until the start of their next turn.</p>\n<h3>Patient Protector</h3>\n<p><em><strong>Prerequisite:</strong> 5th level</em>&nbsp;<br />When you attack creatures that are within 5 feet of an ally that is the target of your Critical Analysis feature, attack rolls and damage rolls made on them with a finesse or ranged weapon may use your Intelligence modifier instead of Strength of Dexterity.</p>\n<h3>Surgical Precision</h3>\n<p><em><strong>Prerequisite:</strong> 5th Level</em>&nbsp;<br />When you hit a creature that is the target of your Critical Analysis feature with a weapon attack, it takes additional damage equal to your Dexterity modifier.</p>\n<h3>Tend the Wounded</h3>\n<p>If you or any friendly creatures you can touch regain hit points by spending one or more Hit Dice at the end of a short rest, each of those creatures regain 1d6 extra hit points.</p>\n<p>This die increases when you reach certain levels in this class: 1d8 at 7th level, 1d10 at 11th level, and to 1d12 at 15th level.</p>\n<p><strong>&nbsp; &nbsp; Side Effects</strong></p>\n<div class=\"medtable\">\n<table>\n<thead>\n<tr>\n<th style=\"text-align: center; width: 41px;\">d20</th>\n<th style=\"text-align: left; width: 499px;\">Side Effects</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align: center; width: 39px;\">1</td>\n<td style=\"text-align: left; width: 497px;\">The creature turns out to be allergic to this specific treatment. Every ability score is reduced by 1.</td>\n</tr>\n<tr>\n<td style=\"text-align: center; width: 39px;\">2</td>\n<td style=\"text-align: left; width: 497px;\">The creature starts sneezing uncontrollably. Any attack rolls with a die roll value of 19 results in a miss due to a poorly timed sneeze.</td>\n</tr>\n<tr>\n<td style=\"text-align: center; width: 39px;\">3</td>\n<td style=\"text-align: left; width: 497px;\">The creature's legs become swollen. Their move speed becomes at most half their normal movement speed.</td>\n</tr>\n<tr>\n<td style=\"text-align: center; width: 39px;\">4</td>\n<td style=\"text-align: left; width: 497px;\">The creature becomes one size larger or smaller.</td>\n</tr>\n<tr>\n<td style=\"text-align: center; width: 39px;\">5</td>\n<td style=\"text-align: left; width: 497px;\">The skin at their joints turns into a wooden material, giving them a bonus of +2 to AC.</td>\n</tr>\n<tr>\n<td style=\"text-align: center; width: 39px;\">6</td>\n<td style=\"text-align: left; width: 497px;\">The creature's body starts producing powerful stomach acid in high amounts. The creature can use an action to spew stomach acid in a 15 feet cone. The DC for this saving throw equals 8 + your Constitution modifier + your proficiency bonus. A creature takes 2d6 acid damage on a failed save, and half as much damage on a successful one. The damage increases to 3d6 at 6th level, 4d6 at 11th level, and 5d6 at 16th level.</td>\n</tr>\n<tr>\n<td style=\"text-align: center; width: 39px;\">7</td>\n<td style=\"text-align: left; width: 497px;\">The creature becomes mute and has uncontrollable gas. They have disadvantage on Dexterity (Stealth) checks that rely on smell.</td>\n</tr>\n<tr>\n<td style=\"text-align: center; width: 39px;\">8</td>\n<td style=\"text-align: left; width: 497px;\">The creature's eyes glows bright red. The creature also gains darkvision, but if they already have darkvision they get a light headache instead.</td>\n</tr>\n<tr>\n<td style=\"text-align: center; width: 39px;\">9</td>\n<td style=\"text-align: left; width: 497px;\">The creature gains +4 to perception checks based on hearing, but everything seems uncomfortably loud to them. They gain vulnerability to sonic damage.</td>\n</tr>\n<tr>\n<td style=\"text-align: center; width: 39px;\">10</td>\n<td style=\"text-align: left; width: 497px;\">The treatment slows down their brain function, reducing their Intelligence by 4.</td>\n</tr>\n<tr>\n<td style=\"text-align: center; width: 39px;\">11</td>\n<td style=\"text-align: left; width: 497px;\">The creature's skin turns dark purple. If they are already purple, they turn bright pink instead.</td>\n</tr>\n<tr>\n<td style=\"text-align: center; width: 39px;\">12</td>\n<td style=\"text-align: left; width: 497px;\">The creature becomes covered in sickly, green pustules. When the creature is hit by a melee attack, the attacker takes 1d4 poison damage.</td>\n</tr>\n<tr>\n<td style=\"text-align: center; width: 39px;\">13</td>\n<td style=\"text-align: left; width: 497px;\">The creature's skin starts to seriously bloat up from internal pressure build-up, and a strong impact may cause it to explode. Whenever the creature takes damage, the creature has to pass a concentration check or the creature takes kinetic damage equal to half their maximum hit points. Other creatures within 10 feet of the explosion also take a fourth of the damage. Once this explosion occurs, their skin becomes very soft.</td>\n</tr>\n<tr>\n<td style=\"text-align: center; width: 39px;\">14</td>\n<td style=\"text-align: left; width: 497px;\">The creature rapidly grows body hair all over, including the face, until they resemble a wookiee. If they are already a wookiee, the reverse effect occurs; all hair immediately falls off, leaving the skin bare.</td>\n</tr>\n<tr>\n<td style=\"text-align: center; width: 39px;\">15</td>\n<td style=\"text-align: left; width: 497px;\">The creature's body temperature fluctuates to extremes. They gain resistance to cold and fire damage.</td>\n</tr>\n<tr>\n<td style=\"text-align: center; width: 39px;\">16</td>\n<td style=\"text-align: left; width: 497px;\">The creature becomes ravenous. Every hour they haven't eaten a meal they gain a level of exhaustion.</td>\n</tr>\n<tr>\n<td style=\"text-align: center; width: 39px;\">17</td>\n<td style=\"text-align: left; width: 497px;\">The creature believes they are the chosen one.</td>\n</tr>\n<tr>\n<td style=\"text-align: center; width: 39px;\">18</td>\n<td style=\"text-align: left; width: 497px;\">The creature has a difficult time resting. The amount they heal from Hit Dice is now halved.</td>\n</tr>\n<tr>\n<td style=\"text-align: center; width: 39px;\">19</td>\n<td style=\"text-align: left; width: 497px;\">The creature's movement speed is increased by 15 feet, and opportunity attacks on them have disadvantage.</td>\n</tr>\n<tr>\n<td style=\"text-align: center; width: 39px;\">20</td>\n<td style=\"text-align: left; width: 497px;\">The creature gains 10d10 hit points, and they feel happy and carefree.</td>\n</tr>\n</tbody>\n</table>\n</div>"
        },
        "source": "PHB",
        "activation": {
            "cost": null,
            "type": ""
        },
        "actionType": "",
        "damage": {
            "parts": []
        },
        "armorproperties": {
            "parts": []
        },
        "weaponproperties": {
            "parts": []
        },
        "classCasterType": ""
    },
    "flags": {
        "dynamiceffects": {
            "equipActive": false,
            "alwaysActive": false
        }
    },
    "img": "systems/sw5e/packs/Icons/Archetypes/Doctor%20Pursuit.webp",
    "effects": []
}