{
    "_id": "dLJ1gAt5hi0COlMu",
    "name": "Exhibition Specialist",
    "permission": {
        "default": 0,
        "IpSq6HI4edO6e0Yw": 3
    },
    "type": "archetype",
    "data": {
        "className": "Fighter",
        "description": {
            "value": "<h1>Exhibition Specialist</h1>\n<p>Those fighters who choose to become Exhibition Specialists can't help but show off. Even where there isn't an audience, these warriors take command of the battlefield as though it were a stage.</p>\n<h2>Bonus Proficiencies</h2>\n<p><em><strong>Exhibition Specialist:</strong> 3rd level</em></p>\n<p>You gain proficiency in one Charisma skill of your choice.</p>\n<h2>In the Spotlight</h2>\n<p><em><strong>Exhibition Specialist:</strong> 3rd level</em></p>\n<p>You can overwhelm an opponent with your unique blend of skill and style. As a bonus action, you can choose one creature you can see within 30 feet of you. The target is marked for 1 minute. While the target is marked, you gain the following benefits:</p>\n<ul>\n<li>You can add half your Charisma modifier (minimum of one) to any weapon damage roll you make against the marked target that doesn't already include that modifier.</li>\n<li>Your critical hit range against the marked target increases by 1.</li>\nIf the marked target is reduced to 0 hit points, you regain hit points equal to your fighter level + your Charisma modifier (minimum of 1).</ul>\n<p>This effect ends early if you're incapacitated or die. Once you've used this feature, you can't use it again until you finish a short or long rest.</p>\n<h2>Glory Kill</h2>\n<p><em><strong>Exhibition Specialist:</strong> 7th level</em></p>\n<p>As you defeat your enemies in combat, you can weaken the morale of other foes or bolster the resolve of your allies alike. When you score a critical hit or reduce a creature to 0 hit points, you can choose one or more creatures that you can see within 30 feet of you. up to a number equal to your Charisma modifier (minimum of one creature). Each of the chosen creatures are affected by one of the following effects of your choice:</p>\n<ul>\n<li>The creature gains temporary hit points equal to 1d6 + your Charisma modifier (minimum of 1 temporary hit point).</li>\n<li>The creature must succeed on a Wisdom saving throw (DC = 8 + your proficiency bonus + your Charisma modifier) or be frightened of you until the start of your next turn.</li>\n</ul>\n<h2>Glorious Defense</h2>\n<p><em><strong>Exhibition Specialist:</strong> 15th level</em></p>\n<p>Your glory on the battlefront can misdirect attacks. When a creature you can see hits you with an attack roll, you can use your reaction to gain a bonus to AC against that attack, potentially causing it to miss you. The bonus equals your Charisma modifier (minimum of +1). If the attack misses, you can make one weapon attack against the attacker as part of this reaction.</p>\n<h2>The Beauty of Violence</h2>\n<p><em><strong>Exhibition Specialist:</strong> 18th level</em></p>\n<p>You've perfected a fighting style that allows you to stylishly dominate the field of battle. When you mark a creature with your In The Spotlight feature, you can enhance it For the duration of the mark, you gain the following additional benefits:</p>\n<ul>\n<li>You can add your full Charisma modifier, instead of half, to any weapon damage roll you make against the marked target that doesn't already include that modifier.</li>\n<li>You can add half your Charisma modifier (minimum of one) to any weapon attack roll you make against the marked target that doesn't already include that modifier.</li>\n<li>If the marked target is reduced to 0 hit points, you can use your reaction to mark a new creature within 30 feet of you. The duration of the new mark is equal to the remaining duration of the existing mark.</li>\n</ul>\n<p>This effect ends early if you're incapacitated or die. Once you've used this feature, you can't use it again until you finish a long rest.</p>"
        },
        "source": "EC",
        "classCasterType": ""
    },
    "flags": {
        "core": {
            "sourceId": "Item.53DfzJhzAMPbEsMC"
        }
    },
    "img": "systems/sw5e/packs/Icons/Archetypes/Exhibition%20Specialist.webp",
    "effects": []
}