{
    "_id": "pr7Xe82MOaof0IXj",
    "name": "Form X: Jar'Kai",
    "permission": {
        "default": 0,
        "IpSq6HI4edO6e0Yw": 3
    },
    "type": "archetype",
    "data": {
        "className": "Guardian",
        "description": {
            "value": "<h1>Form X: Jar'Kai</h1>\n<p>Form X, also known as Domination Form, utilizes two weapons to overwhelm their foes. Those guardians who focus on Jar'Kai Form know that two weapons offer greater versatility than one, and capitalize on the twin angles from which they attack to subdue their enemies.</p>\n<h2>Form Basics</h2>\n<p>When you choose this form as your focus at 3rd level, you learn the basics of the chosen form. You gain the @Compendium[sw5e.lightsaberform.OmPlZtMXi2b3Vo64]{Jar'Kai Lightsaber Form}, detailed in Chapter 6 of the Player&rsquo;s Handbook. If you already know this form, you can instead choose another lightsaber form. You can&rsquo;t take a lightsaber form option more than once, even if you later get to choose again.</p>\n<h2>The Way of the Acklay</h2>\n<p>Also at 3rd level, as a bonus action, you can enter a destructive stance for one minute. While in this stance, you can add half your Strength or Dexterity modifier (your choice, minimum of one) to any melee weapon damage roll you make that doesn't already include that modifier. Additionally, when you hit a creature with a melee weapon attack, you can move up to 5 feet without provoking opportunity attacks.</p>\n<p>This effect ends early if you are incapacitated or die. Once you use this feature, you can't use it again until you finish a long rest.</p>\n<h2>Channel the Force</h2>\n<p>Lastly at 3rd level, you gain the following Channel the Force option.</p>\n<h3>Twin Strike</h3>\n<p>Once per turn, when you miss with a melee weapon attack, you can expend a use of your Channel the Force to immediately make another melee weapon attack against the same target (no action required).</p>\n<h2>Eye of the Storm</h2>\n<p>Beginning at 7th level, when you score a critical hit with a melee weapon attack, you regain a use of your Channel the Force, to a maximum of your Wisdom or Charisma modifier (your choice, minimum of one).</p>\n<h2>Rising Whirlwind</h2>\n<p>Starting at 15th level, as an action, you can rush forward up to 30 feet to an unoccupied space you can see without provoking opportunity attacks. Each creature within 5 feet of your path must make a Dexterity saving throw. A creature takes normal weapon damage on a failed save, or half as much on a successful one. If you are wielding two light- or vibro-weapons, or a weapon with the double property, a creature makes this save with disadvantage, and takes additional damage equal to your Strength or Dexterity modifier (your choice, minimum of one) on a failed save if it doesn't already include that modifier.</p>\n<p>Once you've used this feature, you must complete a short or long rest before you can use it again.</p>\n<h2>Master of Domination</h2>\n<p>At 20th level, you are a whirlwind of strikes, eviscerating all who step within your reach. Your Strength and Dexterity scores increase by 2. Your maximum for these scores increases by 2. Additionally, you can use your action to gain the following benefits for 1 minute:</p>\n<ul>\n<li>You have resistance to kinetic and energy damage from unenhanced weapons.</li>\n<li>When you hit a creature with a melee weapon attack, you have advantage on the next melee weapon attack roll you make against that creature, and that creature provokes an opportunity attack from you even if they take the Disengage action before leaving your reach until the end of your next turn.</li>\n<li>Creatures provoke an opportunity attack from you when they enter your reach.</li>\n</ul>\n<p>This effect ends early if you are incapacitated or die. Once you use this feature, you can't use it again until you finish a long rest.</p>"
        },
        "source": "EC",
        "activation": {
            "cost": null,
            "type": ""
        },
        "actionType": "",
        "damage": {
            "parts": []
        },
        "armorproperties": {
            "parts": []
        },
        "weaponproperties": {
            "parts": []
        },
        "classCasterType": "Forcecaster"
    },
    "flags": {
        "dynamiceffects": {
            "equipActive": false,
            "alwaysActive": false
        }
    },
    "img": "systems/sw5e/packs/Icons/Archetypes/Jar%27Kai%20Form.webp",
    "effects": []
}