{
    "_id": "lGoI3XalF3gv8el4",
    "name": "Gambler Pursuit",
    "permission": {
        "default": 0,
        "IpSq6HI4edO6e0Yw": 3
    },
    "type": "archetype",
    "data": {
        "className": "Scholar",
        "description": {
            "value": "<h1>Gambler Pursuit</h1>\n<p>Not all studied men and women use their intelligence and skill for the pursuit of knowledge, but instead turn to the various casinos and betting halls of the galaxy. Those scholars who choose the Gambler Pursuit use their knowledge of probability and risk to attempt to master games of chance and build their fortune, or lose it all along the way.</p>\n<h2>Gambler's Aptitude</h2>\n<p>When you choose this pursuit at 3rd level, you gain proficiency in your choice of the Insight, Deception, Persuasion, or Sleight of Hand skills. Additionally, you gain proficiency in three gaming sets of your choice, and you have advantage on any ability check you make that uses any of these gaming sets.</p>\n<h2>Risk versus Reward</h2>\n<p>Also at 3rd level, when you make your first attack on your turn against the target of your Critical Analysis feature, you can decide to gamble by rolling a d6. On a roll of 4 or higher, you have advantage on attack rolls against that creature until the start of your next turn. On a roll of 3 or lower, that creature instead has advantage on attack rolls against you until the start of your next turn.</p>\n<p>This die increases when you reach certain levels in this class: to 1d8 at 7th level, to 1d10 at 11th level, and to 1d12 at 15th level.</p>\n<h2>Additional Maneuvers</h2>\n<p>Lastly at 3rd level, you gain access to new maneuvers which reflect your deep understanding of chance. Whenever you learn a new maneuver, you can choose from any of the following as well. The maneuvers are listed in alphabetical order.</p>\n<h3>All In</h3>\n<p>When you make an attack roll, and the result is less than 20, you can expend a superiority die and roll it, adding it to the roll. If the resulting sum is 20 or 23, the attack is considered a critical hit.</p>\n<h3>Blind Luck</h3>\n<p>When you fail an ability check, you can expend a superiority die. If the result of your ability check plus the superiority die is within a range equal to half your proficiency bonus (rounded down) above or below the check's DC, you pass the check instead.</p>\n<h3>Double Bluff</h3>\n<p>If on the same round of combat that you have missed a weapon attack, an enemy also misses you with a weapon attack, you can expend a superiority die and make a single weapon attack, adding the results of your superiority die to both the attack and damage rolls.</p>\n<h3>The Idiot's Array</h3>\n<p>When a creature hits you with a weapon attack roll, you can expend a superiority die and roll it. On a roll of 4 or higher, you take minimum damage on the damage roll and subtract the value of the superiority die. On a roll of 3 or lower, you instead take the maximum.</p>\n<h3>Played Their Hand</h3>\n<p>When a creature hits you with an opportunity attack while within 5 feet of you, you can use your reaction and expend a superiority die to impose disadvantage on the attack roll. If the attack misses, you can make a Dexterity (Sleight of Hand) check contested by the attacker's Strength (Athletics) or Dexterity (Acrobatics) check (their choice) as a part of this reaction. On a success, the target drops the weapon it made the attack with. If you are within 5 feet of the target, and you have a free hand, you can catch the item. Otherwise, the object lands at its feet.</p>\n<h3>Pure Sabacc</h3>\n<p>When you score a critical hit with a weapon attack, you can expend a superiority die and roll it. On a roll of 4 or higher, you deal maximum damage on the weapon's damage roll, including the superiority die. On a roll of 3 or lower, you instead deal the minimum.</p>\n<h3>Raise the Stakes</h3>\n<p>When the target of your Critical Analysis feature makes an attack roll against you, you can use your reaction to expend a superiority die. Roll the die and subtract the result from the enemy's attack roll, but add the result to their damage roll on a hit.</p>\n<h3>Take a Chance</h3>\n<p>Before making an attack roll, you can expend a superiority die. On a miss, you lose that superiority die and do not benefit from it in any way. On a hit, you can choose two other maneuvers that you know, and subject the target to both maneuvers, without expending additional superiority dice.</p>\n<h3>Tiebreaker</h3>\n<p>When you roll a superiority die as a part of a maneuver you learned from this class, you can expend another superiority die and use the total of both dice.</p>\n<h2>Lucky Number 7</h2>\n<p>Beginning at 6th level, whenever you roll a 7 on an attack roll against the target of your Critical Analysis feature, the attack automatically hits and you regain a superiority die. You can not have more superiority dice than the amount shown in the Superiority Dice column of the Scholar class table.</p>\n<p>When attacking with advantage or disadvantage, this effect applies if either roll is a 7. If both rolls are a 7, the attack is a critical hit.</p>\n<h2>Tell Me the Odds</h2>\n<p>Starting at 9th level, if the target of your Critical Analysis hits you with a weapon attack roll, you can use your reaction to roll a d8. On a 4 or higher, you impose disadvantage on the roll. If the target already had disadvantage, they must instead reroll one of the dice once (your choice).</p>\n<p>This die increases when you reach certain levels in this class: to 1d10 at 11th level, and to 1d12 at 15th level.</p>\n<h2>Borrowed Luck</h2>\n<p>Once you've reached 17th level, you have gained the ability to unnaturally alter luck in your favor. Once per round, after an attack roll, saving throw, or ability check is rolled by you or a creature that you can see, you can replace the number on the d20 with a 7. Note the number on the d20 of the roll that you replaced. That number becomes your borrowed luck roll.</p>\n<p>While you have a borrowed luck roll, you can expend it and replace any ability check, attack roll, or saving throw made by you or a creature that you can see with the value of the borrowed luck roll. You can only have one borrowed luck roll at a time, and you lose any unused borrowed luck rolls when you complete a short or long rest.</p>\n<h2>Discoveries (Gambler)</h2>\n<p>When you select this pursuit, you gain access to new discoveries which reflect your deep understanding of chance. Whenever you learn a new discovery, you can choose from any of the following as well. The discoveries are listed in alphabetical order.</p>\n<h3>Ace Up Your Sleeve</h3>\n<p>Whenever you make a Dexterity (Sleight of Hand) or Charisma (Deception) check, you can expend a superiority die, adding the result to your total for the check.</p>\n<h3>Against the House</h3>\n<p>Whenever you would make a Charisma (Persuasion) check involving haggling, you can instead challenge the target to a game of chance. If they accept your offer, you can make an ability check with an available gaming set. If you win the challenge, you automatically succeed on the Charisma (Persuasion) check.</p>\n<h3>Ante Up</h3>\n<p>When you roll initiative, are not surprised, and end up first in the initiative order, you can take one additional action on top of your regular action and a possible bonus action during your first turn in combat.</p>\n<h3>Calculated Bluff</h3>\n<p>When you make an ability check using your Charisma, you can choose to instead make the check using your Intelligence.</p>\n<h3>Cold Read</h3>\n<p><em><strong>Prerequisite:</strong> 5th level</em></p>\n<p>As an action, you may make a Wisdom (Insight) check contested by a target's Charisma (Deception) check. On a success, you know the next action the target intends to take, so long as the situation does not change dramatically.</p>\n<h3>Feeling the Pressure</h3>\n<p><em><strong>Prerequisite:</strong> 13th level</em></p>\n<p>Whenever you roll a 4 or higher on your Risk Versus Reward feature, the target of your Critical Analysis feature also has disadvantage on attack rolls made against you until the start of your next turn.</p>\n<h3>The Magic Number</h3>\n<p><em><strong>Prerequisite:</strong> 7th level</em></p>\n<p>Whenever you roll a 7 on an ability check or saving throw, you can reroll the ability check or saving throw with advantage.</p>"
        },
        "source": "EC",
        "activation": {
            "cost": null,
            "type": ""
        },
        "actionType": "",
        "damage": {
            "parts": []
        },
        "armorproperties": {
            "parts": []
        },
        "weaponproperties": {
            "parts": []
        },
        "classCasterType": ""
    },
    "flags": {
        "dynamiceffects": {
            "equipActive": false,
            "alwaysActive": false
        }
    },
    "img": "systems/sw5e/packs/Icons/Archetypes/Gambler%20Pursuit.webp",
    "effects": []
}