{
    "_id": "BEMJgPn6JKghk2zh",
    "name": "Inquisitor Technique",
    "permission": {
        "default": 0,
        "IpSq6HI4edO6e0Yw": 3
    },
    "type": "archetype",
    "data": {
        "className": "Scout",
        "description": {
            "value": "<h1>Inquisitor Technique</h1>\n<p>Across history, there have been those who live to hunt those who wield the Force, be they Jedi or Sith. Followers of the Inquisitor Technique combine technology with force techniques to track down and eliminate force-wielders. For those practitioners of the Force, they are the greatest adversary.</p>\n<h2>Whispers of the Force</h2>\n<p>When you choose this technique at 3rd level, you have learned secrets from a subtle attunement to the force. Choose two force powers of no higher level than your Max Power Level, as shown in the scout class table. The chosen powers count as tech powers for you, but are not included in the number in the Powers Known column of the scout class table.</p>\n<p>You learn two additional powers at 5th, 9th, and 13th level. Whenever you gain a level in this class, you can choose one of the force powers you know and replace it with another force power of no higher level than your Max Power Level.</p>\n<h2>Mark of the Inquisitor</h2>\n<p>Also at 3rd level, when the target of your Ranger's Quarry feature is within 15 feet of you, you gain the following benefits:</p>\n<ul>\n<li>Whenever the creature casts a force power, it must first succeed on a Constitution saving throw against your tech save DC to maintain concentration. On a failed save, the casting is disrupted, the force power fails, and the force points are wasted.</li>\n<li>Whenever the creature starts its turn while concentrating on a force power, it must make a Constitution saving throw against your force save DC to maintain concentration. On a failed save, it loses concentration on the power.</li>\n</ul>\n<p>At 11th level, the radius of this feature increases to 30 feet.</p>\n<h2>Sense Force</h2>\n<p>Beginning at 7th level, you can use your action to gain the benefits of the @Compendium[sw5e.forcepowers.PUHY0RrLsi4tAnZx]{Force Sight} force power until the end of your next turn.</p>\n<p>You can use this feature a number of times equal to your Intelligence modifier (a minimum of once). You regain all expended uses when you finish a long rest.</p>\n<h2>Force Resistance</h2>\n<p>Starting at 11th level, while the target of your Ranger's Quarry feature is within 30 feet of you, you gain the following benefits:</p>\n<ul>\n<li>You have advantage on saving throws against force powers they cast.</li>\n<li>You have resistance to damage dealt by force powers they cast.</li>\n</ul>\n<h2>Inquisitor's Wrath</h2>\n<p>At 15th level, you can cast the @Compendium[sw5e.forcepowers.XYHAKmU4gHSzRK3I]{Force Suppression} and @Compendium[sw5e.forcepowers.LhMmIUjsFrytp0wc]{Sever Force} force powers at 3rd level against the target of your Ranger's Quarry without expending tech points. If they are within 30 feet of you, you have advantage on the forcecasting ability check for these powers.</p>\n<p>You can use this feature a number of times equal to 1 + your Intelligence modifier (a minimum of once). You regain all expended uses when you finish a long rest.</p>"
        },
        "source": "EC",
        "activation": {
            "cost": null,
            "type": ""
        },
        "actionType": "",
        "damage": {
            "parts": []
        },
        "armorproperties": {
            "parts": []
        },
        "weaponproperties": {
            "parts": []
        },
        "classCasterType": "Forcecaster, Techcaster"
    },
    "flags": {
        "dynamiceffects": {
            "equipActive": false,
            "alwaysActive": false
        }
    },
    "img": "systems/sw5e/packs/Icons/Archetypes/Inquisitor%20Technique.webp",
    "effects": []
}