{
    "_id": "BtUr8K0noVfAE11J",
    "name": "Path of Tenacity",
    "permission": {
        "default": 0,
        "IpSq6HI4edO6e0Yw": 3
    },
    "type": "archetype",
    "data": {
        "className": "Sentinel",
        "description": {
            "value": "<h1>Path of Tenacity</h1>\n<p>The tenacious are ever mindful that the Force ebbs and flows and use this knowledge to great advantage. Those sentinels who follow the Path of Tenacity use their connection to the Force to draw the opposition's attention while also warding off their attacks, serving as an effective bulwark against even the most implacable of foes.</p>\n<h2>Protector</h2>\n<p>Starting when you choose this calling at 3rd level, you learn the @Compendium[sw5e.forcepowers.RfhP3KotZcqIBmC9]{Saber Ward} force power. Additionally, you can use your Kinetic Combat feature when you cast it as your action. Finally, when you cast it, you can spend 2 force points to extend the benefits to creatures of your choice within 5 feet of you while the power is active. The creatures immediately lose this benefit if they move more than 5 feet away from you.</p>\n<h2>Kinetic Ward</h2>\n<p>Also at 3rd level, you can use your reaction to deflect a strike when you are hit by a melee weapon attack. When you do so, the damage you take from the attack is reduced by 1d10 + your Dexterity modifier + your sentinel level.</p>\n<p>If you reduce the damage to 0, you can redirect it at another target if you have a weapon capable of doing so. You can spend 1 force point to make a melee weapon attack at a target within 5 feet of you with the weapon, as part of the same reaction. You make this attack with proficiency, regardless of your weapon proficiencies, and if the attack hits it uses your Kinetic Combat die for its damage roll. If @Compendium[sw5e.forcepowers.RfhP3KotZcqIBmC9]{Saber Ward} is active, you have advantage on the attack roll.</p>\n<h2>Kinetic Bulwark</h2>\n<p>At 7th level, you can extend your Kinetic Ward to a creature within 5 feet of you when they are hit by a melee weapon attack. If this damage is not reduced to 0, the warded creature takes any remaining damage.</p>\n<h2>Indomitable</h2>\n<p>By 13th level, the Force flowing through you makes it harder for movement to be forced upon you. You have advantage on ability checks and saving throws to avoid being grappled or moved. If you fail the saving throw or ability check, you can spend 1 force point to reroll one of the dice once. You must use the new roll.</p>\n<p>Additionally, if allies within 5 feet of you are gaining the benefit of your @Compendium[sw5e.forcepowers.RfhP3KotZcqIBmC9]{Saber Ward} force power, they also gain the benefit of this feature.</p>\n<h2>Kinetic Bastion</h2>\n<p>At 18th level, you can protect allies even further from you. When a creature within 30 feet of you is hit by a melee weapon attack, you can use your reaction to teleport to them and extend your Kinetic Ward. If this damage is not reduced to 0, the warded creature takes any remaining damage.</p>\n<p>You can use this feature a number of times equal to your Wisdom or Charisma modifier (your choice, a minimum of once). You regain all expended uses when you finish a long rest.</p>"
        },
        "source": "EC",
        "activation": {
            "cost": null,
            "type": ""
        },
        "actionType": "",
        "damage": {
            "parts": []
        },
        "armorproperties": {
            "parts": []
        },
        "weaponproperties": {
            "parts": []
        },
        "classCasterType": "Forcecaster"
    },
    "flags": {
        "dynamiceffects": {
            "equipActive": false,
            "alwaysActive": false
        }
    },
    "img": "systems/sw5e/packs/Icons/Archetypes/Path%20of%20Tenacity.webp",
    "effects": []
}