{
    "_id": "3GmBJl9h0FpyIKFg",
    "name": "Path of Aggression",
    "permission": {
        "default": 0,
        "IpSq6HI4edO6e0Yw": 3
    },
    "type": "archetype",
    "data": {
        "className": "Sentinel",
        "description": {
            "value": "<h1>Path of Aggression</h1>\n<p>From the murky depths of the dark side comes seething fury. Those sentinels who follow the Path of Aggression charge their weapon with lightning, culminating in a massive discharge that can ravage their opponents.</p>\n<h2>Voltaic Slash</h2>\n<p>Starting when you choose this calling at 3rd level, you learn the @Compendium[sw5e.forcepowers.MkDRzlCkK2hDdtvi]{Lightning Charge} force power, which does not count against your total powers known. Additionally, you can use Wisdom or Charisma as your forcecasting ability for it, and you can use your Kinetic Combat feature when you cast it as your action. Finally, when you deal lightning damage with the <em>lightning charge</em> force power, you deal additional lightning damage equal to half your Wisdom or Charisma modifier (your choice, minimum of one) if it doesn't already include that modifier.</p>\n<h2>Thunderous Momentum</h2>\n<p>Also at 3rd level, your stride becomes nigh unbreakable. You are immune to the shocked condition, and other effects that would reduce your speed only reduce it by 5 feet.</p>\n<h2>Entropic Rush</h2>\n<p>At 7th level, you've learned to move with speed and precision, discharging your lightning in a massive burst. When you move at least half your speed before casting @Compendium[sw5e.forcepowers.MkDRzlCkK2hDdtvi]{Lightning Charge}, you make the attack roll with advantage. Additionally, on a hit, the lightning can leap a second time, to a third creature within range or back to the first creature.</p>\n<h2>Living Current</h2>\n<p>By 13th level, you've learned to channel the damage done to you to enhance your strikes. The first time you deal damage on your turn, if you took damage since the start of your last turn, you can deal additional lightning damage equal to your Kinetic Combat die + half the amount of damage taken (rounded down).</p>\n<p>You can use this feature a number of times equal to your Wisdom or Charisma modifier (your choice, a minimum of once). You regain all expended uses when you finish a short or long rest.</p>\n<h2>Retaliatory Strike</h2>\n<p>At 18th level, when a creature hits you with an attack while within 5 feet of you, you can use your reaction to cast the @Compendium[sw5e.forcepowers.MkDRzlCkK2hDdtvi]{Lightning Charge} force power, targeting them.</p>"
        },
        "source": "PHB",
        "activation": {
            "cost": null,
            "type": ""
        },
        "actionType": "",
        "damage": {
            "parts": []
        },
        "armorproperties": {
            "parts": []
        },
        "weaponproperties": {
            "parts": []
        },
        "classCasterType": "Forcecaster"
    },
    "flags": {
        "dynamiceffects": {
            "equipActive": false,
            "alwaysActive": false
        }
    },
    "img": "systems/sw5e/packs/Icons/Archetypes/Path%20of%20Aggression.webp",
    "effects": []
}