{
    "_id": "UZCwqqLLp7IBjqku",
    "name": "Politician Pursuit",
    "permission": {
        "default": 0,
        "IpSq6HI4edO6e0Yw": 3
    },
    "type": "archetype",
    "data": {
        "className": "Scholar",
        "description": {
            "value": "<h1>Politician Pursuit</h1>\n<p>Politicians study social &amp; political sciences. Those scholars who choose the Politician Pursuit know how to best present themselves to manipulate the masses into doing their bidding or allow them and their allies to carry out their business without impediment. They also understand the importance of self-preservation for a political figure.</p>\n<h2>Silver Tongue</h2>\n<p>When you choose this pursuit at 3rd level, you learn one language of your choice. Additionally, you gain a bonus to your choice of Deception, Intimidation, Performance, or Persuasion equal to your Intelligence modifier.</p>\n<h2>Motivating Diplomat</h2>\n<p>Also at 3rd level, when you are the target of your Critical Analysis feature, you and all allies within 10 feet of you gain a bonus to their AC equal to half your Intelligence modifier (rounded down).</p>\n<h2>Additional Maneuvers</h2>\n<p>Lastly at 3rd level, you gain access to new maneuvers which reflect the progress of your studies into the political world. Whenever you learn a new maneuver, you can choose from any of the following as well. The maneuvers are listed in alphabetical order.</p>\n<h3>Call to Arms</h3>\n<p>If you are surprised at the start of combat and aren't incapacitated, you can expend one superiority die to act normally. Additionally, on your first turn in combat, as a bonus action you can make a call to arms. When you do so, a number of creatures equal to the amount rolled on the superiority die that you choose within 30 feet who can see or hear you may act normally on their first turn.</p>\n<h3>Call the Guards</h3>\n<p>When a creature makes an attack roll against you, you can use your reaction and expend a superiority die and command a willing ally within 5 feet of that creature to use their reaction to intercede. The creature is then forced to make an attack on the ally instead. If the attack misses, the ally can immediately make a weapon attack against that creature as a part of that same reaction. Roll the superiority die, and add the result to the ally's attack roll.</p>\n<h3>Charge</h3>\n<p>As a bonus action on your turn, you can expend one superiority die to spurn your allies to move. Until the start of your next turn, creatures you choose within 10 feet of you who can see or hear you can move an additional distance equal to 5 times the superiority die rolled on their turn and ignore unenhanced difficult terrain.</p>\n<h3>Encouraging Speech</h3>\n<p>You can expend a superiority die to give an encouraging speech, spending the next minute rallying your allies. You grant a number of creature up to your Intelligence modifier temporary hit points equal to the amount rolled on the superiority die + your Intelligence modifier.</p>\n<h3>Incite</h3>\n<p>On your turn, you can use an action and expend one superiority die to bolster the resolve of one of an ally. When you do so, choose an ally who can see or hear you within 30 feet of you. The ally can add your Intelligence modifier to every damage roll they make until the start of your next turn.</p>\n<h3>Overwhelming Presence</h3>\n<p>As an action, you can make a Charisma (Persuasion) or Charisma (Intimidation) skill check and expend one superiority die to attempt to charm or frighten a humanoid creature who can see or hear you within 60 feet. Add the superiority die to the roll. The target makes a contested Wisdom (Insight) check. If your check succeeds, the target is charmed by you if you used Persuasion, or frightened of you if you used Intimidation, until the end of your next turn.</p>\n<h3>Self-Preservation</h3>\n<p>As a reaction when you make a saving throw against an effect you can see, you can expend a superiority die and add the result. You can use this maneuver before or after making the saving throw, but before any effects of the saving throw are det-ermined.</p>\n<h3>Steady the Nerves</h3>\n<p>As an action, you can expend one superiority die to strengthen your allies' defences. Roll a superiority die. Until the end of your next turn, you and all allies within 5 feet of you when you use this action has a bonus to any saving throws they make equal to amount rolled.</p>\n<h3>Tyrannical Strike</h3>\n<p>When you hit a creature with a weapon attack, you can expend one superiority die and use your reaction to issue a one-word command to a creature who can see or hear you. You add the superiority die to the attack's damage roll, and the target must succeed on a Wisdom saving throw. On a failed save, the target must follow the command on its next turn.</p>\n<p>The target automatically succeeds if it is immuned to charm, it doesn't understand your language, or if your command is directly harmful to it.</p>\n<h2>Force of Personality</h2>\n<p>Beginning at 6th level, as an action, you suggest a course of activity (limited to a sentence or two) to influence a creature you can see within range that can hear and understand you. Creatures that can't be charmed are immune to this effect. The suggestion must be worded in such a manner as to make the course of action sound reasonable. Asking the creature to stab itself, throw itself onto a spear, immolate itself, or do some other obviously harmful act ends the effect.</p>\n<p>The target must make a Wisdom saving throw against your maneuver save DC. On a failed save, the target is charmed by you, and it pursues the course of action you described to the best of its ability. The suggested course of action can continue for up to 24 hours. If the suggested activity can be completed in a shorter time, the effect ends when the subject finishes what it was asked to do.</p>\n<p>You can also specify conditions that will trigger a special activity during the duration. For example, you might suggest that an officer givers her gun to the first smuggler she meets. If the condition isn't met before the effect ends, the activity isn't performed.</p>\n<p>If you or any of your companions damage the target, the effect ends.</p>\n<p>You can use this feature a number of times equal to your Intelligence modifier (a minimum of once). You regain all expended uses when you finish a long rest.</p>\n<h2>Reassemble</h2>\n<p>Starting at 9th level, you may use to a bonus action to call your allies towards you. When you do so, choose a number of creatures that you can see within 60 feet of you equal to your Intelligence modifier (minimum of one). They can use their reaction to immediately move directly towards you up to their movement speed. This movement does not provoke opportunity attacks.</p>\n<p>Once you've used this feature, you must complete a short or long rest before you can use it again.</p>\n<h2>Beguiling Presence</h2>\n<p>Once you've reach 17th level, humanoids within 60 feet are particularly susceptible to your presence. Humanoids within range have disadvantage on saving throws against any charm or fear effects from you.</p>\n<h2>Discoveries (Politician)</h2>\n<p>When you select this pursuit, you gain access to new discoveries which reflect the progress of your studies into the political world. Whenever you learn a new discovery, you can choose from any of the following as well. The discoveries are listed in alphabetical order.</p>\n<h3>Charming Feint</h3>\n<p>Allies within range of your Motivating Diplomat feature also gain a bonus to their damage roll equal to half your Intelligence modifier (rounded down).</p>\n<h3>Demanding Leader</h3>\n<p><em><strong>Prerequisite:</strong> 5th level</em></p>\n<p>The range of each of your maneuvers increases by 10 feet. If the range is touch, it becomes 10 feet.</p>\n<h3>Dominating Presence</h3>\n<p><em><strong>Prerequisite:</strong> 15th level</em></p>\n<p>As a bonus action, you can call out to a humanoid who can understand you that is charmed by you or frightened of you to direct their next action. The target must succeed a Wisdom saving throw against your maneuver save DC. On a failed save, until the end of your next turn, the creature takes only the actions you choose, and doesn't do anything that you don't allow it to do.</p>\n<p>During this time you can use your reaction to force the creature to use its reaction.</p>\n<p>Once you've used this feature, you must complete a short or long rest before you can use it again.</p>\n<h3>Influencer</h3>\n<p><em><strong>Prerequisite:</strong> 5th level</em></p>\n<p>The range on the your Motivating Diplomat feature is increased to 15 feet.</p>\n<h3>Reliable Words</h3>\n<p><em><strong>Prerequisite:</strong> 9th level</em></p>\n<p>When you make a Deception, Intimidation, or Persuasion skill check, you may treat any roll 9 or lower as if you had rolled a 10.</p>\n<h3>Social Opportunist</h3>\n<p>You can add half your proficiency bonus (rounded down) to any Charisma check you make that doesn't already include your proficiency bonus.</p>\n<h3>Tyrant's Ferocity</h3>\n<p>You have advantage on any attack against a creature that is charmed by you or frightened of you.</p>"
        },
        "source": "PHB",
        "activation": {
            "cost": null,
            "type": ""
        },
        "actionType": "",
        "damage": {
            "parts": []
        },
        "armorproperties": {
            "parts": []
        },
        "weaponproperties": {
            "parts": []
        },
        "classCasterType": ""
    },
    "flags": {
        "dynamiceffects": {
            "equipActive": false,
            "alwaysActive": false
        }
    },
    "img": "systems/sw5e/packs/Icons/Archetypes/Politician%20Pursuit.webp",
    "effects": []
}