{
    "_id": "lETcZuQWPZg3n2u0",
    "name": "Saboteur Practice",
    "permission": {
        "default": 0,
        "IpSq6HI4edO6e0Yw": 3
    },
    "type": "archetype",
    "data": {
        "className": "Operative",
        "description": {
            "value": "<h1>Saboteur Practice</h1>\n<p>Those operatives who choose the Saboteur Practice enhance their fine-honed skills of stealth and agility with tech, using advanced technology with the aid of a tracker droid to sustain a longer assault.</p>\n<h2>Bonus Proficiencies</h2>\n<p>You gain proficiency in astrotech's tools.</p>\n<h2>Techcasting</h2>\n<p>When you choose this practice at 3rd level, you have derived powers from schematics with the aid of your wristpad. See chapter 10 for the general rules of techcasting and chapter 12 for the tech powers list.</p>\n<h3>Tech Powers Known</h3>\n<p>You learn 4 tech powers of your choice, and you learn more at higher levels, as shown in the Tech Powers Known column of the Saboteur Practice Techcasting table. You may not learn a tech power of a level higher than your Max Power Level.</p>\n<h3>Tech Points</h3>\n<p>You have a number of tech points equal to half of your operative level (rounded up), as shown in the Tech Points column of the Saboteur Practice Techcasting table, + your Intelligence modifier. You use these tech points to cast tech powers. You regain all expended tech points when you finish a short or long rest.</p>\n<h3>Max Power Level</h3>\n<p>Many tech powers can be overcharged, consuming more tech points to create a greater effect. You can overcharge these powers to a maximum level, which increases at higher levels, as shown in the Max Power Level column of the Saboteur Practice Techcasting table.</p>\n<p>You may only cast tech powers at 4th-level once. You regain the ability to do so after a long rest.</p>\n<h3>Techcasting Ability</h3>\n<p>Intelligence is your techcasting ability for your tech powers. You use your Intelligence whenever a power refers to your techcasting ability. In addition, you use your Intelligence modifier when setting the saving throw DC for a tech power you cast and when making an attack roll with one.</p>\n<p><strong>Tech save DC</strong> = 8 + your proficiency bonus + your Intelligence modifier</p>\n<p><strong>Tech attack modifier</strong> = your proficiency bonus + your Intelligence modifier</p>\n<p>You use a wristpad (found in chapter 5) as a techcasting focus for your tech powers.</p>\n<div class=\"classtable\">\n<blockquote>\n<table>\n<thead>\n<tr>\n<td style=\"color: #000000; text-transform: uppercase; font-family: 'Russo One'; background-color: #bdc8cc; font-size: 16px;\" colspan=\"6\"><em>Saboteur Practice Techcasting</em></td>\n</tr>\n<tr>\n<th align=\"center\">Level</th>\n<th align=\"center\">Tech Powers Known</th>\n<th align=\"center\">Tech Points</th>\n<th align=\"center\">Max Power Level</th>\n</tr>\n</thead>\n<tbody>\n<tr class=\"rows\">\n<td align=\"center\">3rd</td>\n<td align=\"center\">3</td>\n<td align=\"center\">2</td>\n<td align=\"center\">1st</td>\n</tr>\n<tr class=\"rows\">\n<td align=\"center\">4th</td>\n<td align=\"center\">4</td>\n<td align=\"center\">2</td>\n<td align=\"center\">1st</td>\n</tr>\n<tr class=\"rows\">\n<td align=\"center\">5th</td>\n<td align=\"center\">5</td>\n<td align=\"center\">3</td>\n<td align=\"center\">1st</td>\n</tr>\n<tr class=\"rows\">\n<td align=\"center\">6th</td>\n<td align=\"center\">6</td>\n<td align=\"center\">3</td>\n<td align=\"center\">1st</td>\n</tr>\n<tr class=\"rows\">\n<td align=\"center\">7th</td>\n<td align=\"center\">7</td>\n<td align=\"center\">4</td>\n<td align=\"center\">2nd</td>\n</tr>\n<tr class=\"rows\">\n<td align=\"center\">8th</td>\n<td align=\"center\">8</td>\n<td align=\"center\">4</td>\n<td align=\"center\">2nd</td>\n</tr>\n<tr class=\"rows\">\n<td align=\"center\">9th</td>\n<td align=\"center\">9</td>\n<td align=\"center\">5</td>\n<td align=\"center\">2nd</td>\n</tr>\n<tr class=\"rows\">\n<td align=\"center\">10th</td>\n<td align=\"center\">10</td>\n<td align=\"center\">5</td>\n<td align=\"center\">2nd</td>\n</tr>\n<tr class=\"rows\">\n<td align=\"center\">11th</td>\n<td align=\"center\">11</td>\n<td align=\"center\">6</td>\n<td align=\"center\">2nd</td>\n</tr>\n<tr class=\"rows\">\n<td align=\"center\">12th</td>\n<td align=\"center\">12</td>\n<td align=\"center\">6</td>\n<td align=\"center\">2nd</td>\n</tr>\n<tr class=\"rows\">\n<td align=\"center\">13th</td>\n<td align=\"center\">13</td>\n<td align=\"center\">7</td>\n<td align=\"center\">3rd</td>\n</tr>\n<tr class=\"rows\">\n<td align=\"center\">14th</td>\n<td align=\"center\">14</td>\n<td align=\"center\">7</td>\n<td align=\"center\">3rd</td>\n</tr>\n<tr class=\"rows\">\n<td align=\"center\">15th</td>\n<td align=\"center\">15</td>\n<td align=\"center\">8</td>\n<td align=\"center\">3rd</td>\n</tr>\n<tr class=\"rows\">\n<td align=\"center\">16th</td>\n<td align=\"center\">16</td>\n<td align=\"center\">8</td>\n<td align=\"center\">3rd</td>\n</tr>\n<tr class=\"rows\">\n<td align=\"center\">17th</td>\n<td align=\"center\">17</td>\n<td align=\"center\">9</td>\n<td align=\"center\">4th</td>\n</tr>\n<tr class=\"rows\">\n<td align=\"center\">18th</td>\n<td align=\"center\">18</td>\n<td align=\"center\">9</td>\n<td align=\"center\">4th</td>\n</tr>\n<tr class=\"rows\">\n<td align=\"center\">19th</td>\n<td align=\"center\">19</td>\n<td align=\"center\">10</td>\n<td align=\"center\">4th</td>\n</tr>\n<tr class=\"rows\">\n<td align=\"center\">20th</td>\n<td align=\"center\">20</td>\n<td align=\"center\">10</td>\n<td align=\"center\">4th</td>\n</tr>\n</tbody>\n</table>\n</blockquote>\n</div>\n<h2>Tracker Droid Companion</h2>\n<p>Also at 3rd level, you learn to employ all the knowledge you've accumulated to create and customize your own personalized tracker droid companion.</p>\n<p>Your tracker droid is detailed at the end of this practice. Over the course of 8 hours, which can be done during a long rest, you can expend 500 cr worth of materials to finally finish your tracker droid.</p>\n<p>If your tracker droid is irreparable destroyed, or you want to interface with a different tracker droid, you can spend an additional 250 credits and 1 hour to change the target of this feature. You may only have one tracker droid companion at a time.</p>\n<p>Your tracker droid gains a variety of benefits while it is interfaced with you:</p>\n<ul>\n<li>The tracker droid obeys your commands as best it can. It acts on your turn, and you determine its actions, decisions, attitudes, and so on. If you are incapacitated or absent, your tracker droid acts on its own.</li>\n<li>Your tracker droid's level equals your operative level, and for each operative level you gain after 3rd, your tracker droid companion gains an additional Hit Die and increases its hit points accordingly.</li>\n<li>Your tracker droid has the proficiency bonus of a player character of the same level.</li>\n<li>Whenever you gain the Ability Score Improvement feature in this class, your tracker droid's abilities also improve. Your tracker droid can increase one ability score of your choice by 2, or it can increase two ability scores of your choice by 1. As normal, your tracker droid can't increase an ability score above 20 using this feature unless its description specifies otherwise.</li>\n<li>Your tracker droid can not wear armor or have armor integrated in its chassis.</li>\n<li>Your tracker droid is a valid target of the @Compendium[sw5e.techpowers.PopHJSVZq9t1FFf5]{Tracker Droid Interface} tech power.</li>\n</ul>\n<h2>Powered Ambush</h2>\n<p>Beginning at 9th level, if you are hidden from a creature when you cast a power on it, the creature has disadvantage on any saving throw it makes against the power this turn.</p>\n<h2>Ion Pulse</h2>\n<p>Starting at 13th level, as a bonus action on your turn, you can expend one or more of your tracker droid's Hit Dice to have it emit an pulse of ion energy. Each creature within 5 feet of your tracker droid must make a Constitution saving throw against your tech save DC. A creature takes 1d4 ion damage for each Hit Die expended in this way on a failed save, or half as much as on a successful one. Any electronics not being worn or carried within the blast radius are disabled until rebooted.</p>\n<h3>Saboteur Practice Techcasting</h3>\n<h2>Sabotage</h2>\n<p>At 17th level, you gain the ability to sabotage a tech power in the process of being cast. When a hostile creature casts a tech power, and you are the target of the tech power or within its area of effect, you can use your reaction to force that creature to make an Intelligence saving throw against your tech save DC. On a successful save, the power is cast as normal.</p>\n<p>On a failed save, you negate the power's effects, and the caster takes 1d6 lightning damage per level of the power it was casting. Additionally, on a failed save, the caster's tech focus used to cast the tech power is overloaded and can't be used to cast tech powers for 1 minute.</p>\n<p>At the end of each of the caster's turns, it can repeat the Intelligence saving throw. On a success, it can use the tech focus to cast tech powers again.</p>\n<p>Once you've used this feature, you can't use it again until you finish a long rest.</p>\n<h2>Generating Your Tracker Droid</h2>\n<p>Choosing your tracker droid companion is an integral part of being an Saboteur Operative. Your tracker droid takes a form of your choosing.</p>\n<p>Once you've selected your tracker droid, you assign your tracker droid's ability scores using a varied standard array (14, 12, 10, 8, 6, 4) as you see fit.</p>\n<h2>Tracker Droid Features</h2>\n<p>All tracker droids share the following traits.</p>\n<h3>Hit Points</h3>\n<ul>\n<li><strong>Hit Dice:</strong> 1d4 per tracker droid companion level</li>\n<li><strong>Hit Points at 1st Level:</strong> 4 + your tracker droid's Constitution modifier</li>\n<li><strong>Hit Points at Higher Levels:</strong> 1d4 (or 3) + your tracker droid's Constitution modifier per tracker droid level after 1st</li>\n</ul>\n<h3>Resistances and Vulnerabilities</h3>\n<ul>\n<li><strong>Droid Resistances:</strong> Your tracker droid is resistant to necrotic, poison, and psychic damage, and immune to poison and disease.</li>\n<li><strong>Droid Vulnerabilities:</strong> Your tracker droid is vulnerable to ion damage. Additionally, your tracker droid has disadvantage on saving throws against effects that would deal ion or lightning damage.</li>\n</ul>\n<h3>Proficiencies</h3>\n<ul>\n<li><strong>Tools:</strong> Your choice of demolitions kit, disguise kit, forgery kit, poisoner's kit, security kit, or slicer's kit</li>\n<li><strong>Languages:</strong> Tracker droids can speak, read, and write Binary. They can understand spoken and written Galactic Basic and one language of your choice, but can not speak it</li>\n<li><strong>Skills:</strong> Two of your choice</li>\n</ul>\n<h3>Features</h3>\n<ul>\n<li><strong>Armor Class:</strong> Your tracker droid's armor class equals 10 + its Dexterity modifier. Your tracker droid can't wear armor or have it integrated.</li>\n<li><strong>Droid Weaponry:</strong> Your tracker droid has an integrated shockprod with which it can make weapon attacks. This weapon can't be removed while your tracker droid is conscious. Your tracker droid's shockprod deals 1 lightning damage on a hit, and it has the finesse property.</li>\n<li><strong>Droid Upgrades:</strong> Your tracker droid companion has four tracker droid upgrades of your choice. It gains an additional upgrade at 5th level (5), 8th level (6), 11th level (7), 14th level (8), and 17th level (9). Whenever you gain a level in this class, you can exchange one upgrade for another one.</li>\n<li><strong>Size:</strong> Tiny</li>\n<li><strong>Speed:</strong> 20 feet</li>\n<li><strong>Type:</strong> Droid</li>\n</ul>\n<h2>Tracker Droid Upgrades</h2>\n<p>The traits are presented in alphabetical order.</p>\n<h3>Aerial Travel Package</h3>\n<p>Your tracker droid companion has a 30 foot flying speed.</p>\n<h3>Camouflage Module</h3>\n<p>You install a camouflage module in your tracker droid. You tracker droid can turn on its stealth field to become invisible. While it is invisible, anything it is carrying or wearing is also invisible. It becomes visible when it turns off the field. Turning the field on or off requires an action.</p>\n<p>Deduct the time your tracker droid is invisible, in increments of 1 minute, from the module's maximum duration of 2 hours. After 2 hours of use, the module ceases to function. For every uninterrupted period of 12 hours the module goes unused, it regains 1 hour of use.</p>\n<h3>Expertise Protocol</h3>\n<p><em><strong>Prerequisite:</strong> 5th level</em> <br />You install a protocol in your tracker droid that grants it expertise in a tool or skill. Choose a tool or skill that your tracker droid is proficient in. Your tracker droid gains expertise in it.</p>\n<h3>Flyby</h3>\n<p>Opportunity attacks made against your tracker droid have disadvantage.</p>\n<h3>Four-Armed Tracker</h3>\n<p><em><strong>Prerequisite:</strong> Pintsized Arms</em> or <em>Undersized Arms</em> <br />Your tracker droid gains two additional arms which they can use independently of one another. Your tracker droid can only gain the benefit of items held by two of its arms at any given time, and once per round it can switch which arms it is benefiting from (no action required).</p>\n<h3>Heavy Plating</h3>\n<p>Your tracker droid companion's armor class becomes 14.</p>\n<h3>Interfaced Assistance Protocol</h3>\n<p><em><strong>Prerequisite:</strong> 5th level</em> <br />While you are interfaced with your tracker droid via the @Compendium[sw5e.techpowers.PopHJSVZq9t1FFf5]{Tracker Droid Interface} tech power, whenever you have advantage on an ability check or attack roll granted by your tracker droid taking the Help action, you can reroll one of the dice once.</p>\n<h3>Interfaced Crafting Protocol</h3>\n<p><em><strong>Prerequisite:</strong> 5th level</em> <br />While you are interfaced with your tracker droid via the @Compendium[sw5e.techpowers.PopHJSVZq9t1FFf5]{Tracker Droid Interface} tech power, whenever you make an ability check using tools with which the you are also proficient, you have advantage on the check. If you already have advantage, you can instead reroll one of the dice once.</p>\n<h3>Interfaced Distraction Protocol</h3>\n<p><em><strong>Prerequisite:</strong> 5th level</em> <br />While you are interfaced with your tracker droid via the @Compendium[sw5e.techpowers.PopHJSVZq9t1FFf5]{Tracker Droid Interface} tech power, when your tracker droid is within 5 feet of a target, you do not provoke opportunity attacks when moving out of that creature's reach.</p>\n<h3>Interfaced Healing Protocol</h3>\n<p><em><strong>Prerequisite:</strong> 5th level</em> <br />While you are interfaced with your tracker droid via the @Compendium[sw5e.techpowers.PopHJSVZq9t1FFf5]{Tracker Droid Interface} tech power, when you restore hit points to a creature that is within 5 feet of your tracker droid, you can roll the dice twice and take either total.</p>\n<h3>Interfaced Tracking Protocol</h3>\n<p><em><strong>Prerequisite:</strong> 5th level</em> <br />While you are interfaced with your tracker droid via the @Compendium[sw5e.techpowers.PopHJSVZq9t1FFf5]{Tracker Droid Interface} tech power, when you make a Wisdom (Survival) check to track a target, and your tracker droid is also tracking that target, you gain advantage on the check. If you already have advantage, you can instead reroll one of the dice once.</p>\n<h3>Keen Hearing</h3>\n<p>Your tracker droid companion has advantage on Wisdom (Perception) checks that rely on hearing.</p>\n<h3>Keen Sight</h3>\n<p>Your tracker droid companion has advantage on Wisdom (Perception) checks that rely on sight.</p>\n<h3>Keen Smell</h3>\n<p>Your tracker droid companion has advantage on Wisdom (Perception) checks that rely on smell.</p>\n<h3>Laser Cutter</h3>\n<p>Your tracker droid can cut through 1-inch-thick glass at a rate of 3 inches per round.</p>\n<h3>Light Plating</h3>\n<p>Your tracker droid companion's armor class becomes 11 + it's Dexterity modifier.</p>\n<h3>Medium Plating</h3>\n<p>Your tracker droid companion's armor class becomes 13 + it's Dexterity modifier, to a maximum of +2.</p>\n<h3>Pintsized Arms</h3>\n<p><em><strong>Prerequisite:</strong> Size Tiny</em> <br />Your Tiny tracker droid gains two arms that struggle to wield bigger weapons. Your tracker droid can't use medium or heavy shields. Additionally, your tracker droid can't wield weapons with the two-handed or versatile property, and it can only wield one-handed weapons in two hands unless they have the light property.</p>\n<h3>Proficiency Protocol</h3>\n<p>You install a protocol in your tracker droid that grants it proficiency in a tool or skill of your choice.</p>\n<h3>Ranged Interface Protocol</h3>\n<p>The range within which you can interact with your tracker droid increases by 50 feet. This increases to 100 feet at 5th level, 150 feet at 9th level, 200 feet at 13th level, 250 feet at 17th level, and 300 feet at 20th level.</p>\n<h3>Ranged Shockshot</h3>\n<p>Your tracker droid companion gains a ranged shockshot. It has a normal range of 30 feet and a long range of 90 feet, and on a hit it deal lightning damage equal to its shockprod damage.</p>\n<h3>Scomp Link</h3>\n<p><em><strong>Prerequisite:</strong> 9th level</em> <br />Your tracker droid gets an integrated scomp link which it can use to interface with computers. While interfaced, when you or your tracker droid makes an Intelligence (slicer's kit) check, you can choose to reroll the check. You must use the new roll. You can wait until after you roll the d20 before deciding to use this feature, but you must decide before the GM says whether the check succeeds or fails.</p>\n<h3>Sentry Dish</h3>\n<p>Your tracker droid learns the @Compendium[sw5e.techpowers.ZH0jkLKHJ54BmkYX]{Alarm} tech power. It can cast it once, without the use of a wristpad and without spending tech points, and it regains the ability to do so when it finishes a long rest. Intelligence is your techcasting ability for this power.</p>\n<h3>Size: Small</h3>\n<p>Your tracker droid companion's size is Small. Its hit points increase by an amount equal to its level + 1, its Hit Die becomes a d6, its shockprod damage die becomes a d4, and it's walking speed increases to 25.</p>\n<h3>Spider Legs</h3>\n<p>Your tracker droid has a climbing speed equal to its walking speed. Additionally, your tracker droid has advantage on Strength saving throws and Strength (Athletics) checks that involve climbing.</p>\n<h3>Storage</h3>\n<p>Your tracker droid comes with a hidden storage compartment which can store up to 1 lb. Finding finding this hidden pocket requires a DC 15 Investigation check.</p>\n<h3>Techcasting Range Protocol</h3>\n<p>You can cast tech powers with a range of 5 feet or greater through your tracker droid while interfaced with it, but your tracker droid must be within 5 feet of the target of the power. This increases to 10 feet at 5th level, 20 feet at 9th level, 30 feet at 13th level, 60 feet at 17th level, and 120 feet at 20th level.</p>\n<h3>Undersized Arms</h3>\n<p><em><strong>Prerequisite:</strong> Size Small</em> <br />Your Small tracker droid gains two arms that struggle to wield bigger weapons. Your tracker droid can't use heavy shields. Additionally, your tracker droid can't use martial weapons with the two-handed property unless it also has the light property, and if a martial weapon has the versatile property, your tracker droid can only wield it in two hands.</p>"
        },
        "source": "EC",
        "activation": {
            "cost": null,
            "type": ""
        },
        "actionType": "",
        "damage": {
            "parts": []
        },
        "armorproperties": {
            "parts": []
        },
        "weaponproperties": {
            "parts": []
        },
        "classCasterType": "Techcaster"
    },
    "flags": {
        "dynamiceffects": {
            "equipActive": false,
            "alwaysActive": false
        }
    },
    "img": "systems/sw5e/packs/Icons/Archetypes/Saboteur%20Practice.webp",
    "effects": []
}