{
    "_id": "TgUiU6MrAP7Xyj3H",
    "name": "Sawbones Practice",
    "permission": {
        "default": 0,
        "IpSq6HI4edO6e0Yw": 3
    },
    "type": "archetype",
    "data": {
        "className": "Operative",
        "description": {
            "value": "<h1>Sawbones Practice</h1>\n<p>Those operatives who choose the Sawbones Practice have studied the humanoid body on a more intimate level than other operatives. While others may know where best to stab in order to kill, you also know how to repair the wounds you inflict, as well as how to make them even deeper. You delve into the secrets of the body, learning as much medical knowledge as you can get your hands on, regardless of how dirty the work becomes.</p>\n<h2>General Practice</h2>\n<p>When you choose this practice at 3rd level, you gain proficiency in Medicine, and you can use your Intelligence modifier instead of your Wisdom modifier for checks made with it.</p>\n<p>Additionally, you can expend one use of a medkit to help revitalize your wounded allies during a short rest. If you or any friendly creatures within 30 feet of you regain hit points at the end of the short rest by spending one or more Hit Dice, each of those creatures regains an extra 1d6 hit points.</p>\n<p>The extra hit points increase when you reach certain levels in this class: to 1d8 at 9th level, to 1d10 at 13th level, and to 1d12 at 17th level.</p>\n<h2>Debilitating Strike</h2>\n<p>Also at 3rd level, you learn to apply your anatomical knowledge in direct combat, in order to hinder your targets. When you deal Sneak Attack damage to a creature, you may choose to forgo two of your Sneak Attack Dice in order to hinder the creature, provided they have the appropiate physiology.</p>\n<p>Some of your debilitating strikes require your target to make a saving throw to resist the debilitating strike's effects. The saving throw DC is calculated as follows:</p>\n<p><strong>Debilitating Strike save DC</strong> = 8 + your proficiency bonus + your Intelligence modifier.</p>\n<h3>Bleeding Wound</h3>\n<p>You attempt to create a lingering wound in the target for one minute. The target must make a Constitution saving throw. On a failed save, at the start of each of the target's turns, it loses 1d6 hit points and repeats this saving throw, ending the effect on a success. This damage can't be reduced in any way.</p>\n<h3>Crippling Pain</h3>\n<p>You attempt to cause cause distracting pain in the target. The target must make a Constitution saving throw. On a failed save, it has disadvantage on attack rolls until the end of your next turn.</p>\n<h3>Hampering Shot</h3>\n<p>You attempt to hamper the target's movement. The target must make a Constitution saving throw. On a failed save, its movement speed is reduced by half and it makes Dexterity saving throws with disadvantage until the end of its next turn.</p>\n<h2>Swift Surgery</h2>\n<p>Beginning at 9th level, you know how to quickly patch up wounds, given the right tools. You are able to use a medkit or administer a medpac as a bonus action, and when you use a medkit to stabilize a dying creature, that creature also regains a number of hitpoints equal to your Intelligence modifier.</p>\n<h2>Dosage Control</h2>\n<p>Starting at 13th level, your knowledge of medicine allows you to partition and ration healing supplies very effectively, without impacting its potency. Over the course of 1 hour, which can be done during a rest, you can carefully measure and mark out dosages of a medpac within reach. The medpac can now be used twice before it is consumed.</p>\n<p>At your DM's discretion, you may be able to use this feature on other pacs, stims, or adrenals, most likely involving an ability check to succeed.</p>\n<h2>Self-Sustain</h2>\n<p>At 17th level, you have advantage on death saving throws.</p>\n<p>Additionally, when you are stabilized, you regain 1 hit point. Once you've used this feature, you can't use it again until you finish a short or long rest.</p>"
        },
        "source": "EC",
        "activation": {
            "cost": null,
            "type": ""
        },
        "actionType": "",
        "damage": {
            "parts": []
        },
        "armorproperties": {
            "parts": []
        },
        "weaponproperties": {
            "parts": []
        },
        "classCasterType": ""
    },
    "flags": {
        "dynamiceffects": {
            "equipActive": false,
            "alwaysActive": false
        }
    },
    "img": "systems/sw5e/packs/Icons/Archetypes/Sawbones%20Practice.webp",
    "effects": []
}