{
    "_id": "d8bJ4P3egKuTw5Ao",
    "name": "Vonil/Ishu Form",
    "permission": {
        "default": 0,
        "IpSq6HI4edO6e0Yw": 3
    },
    "type": "archetype",
    "data": {
        "className": "Guardian",
        "description": {
            "value": "<h1>Vonil/Ishu Form</h1>\n<p>Vonil/Ishu Form, also known as Unity Form, focuses on fighting in tandem with a partner as a warpair. Those guardians who focus on Vonil/Ishu Form utilize teamwork to move swiftly, strike quickly, and protect each other.</p>\n<h2>Bonus Proficiencies</h2>\n<p>You gain proficiency in your choice of Intimidation or Persuasion.</p>\n<h2>Form Basics</h2>\n<p>When you choose this form as your focus at 3rd level, you learn the basics of the chosen form. You gain the Vonil/lshu lightsaber form, detailed in the Lightsaber Forms section of the Customization Options document for Expanded Content. If you already know this form, you can instead choose another lightsaber form. You can't take a lightsaber form option more than once, even if you later get to choose again.</p>\n<h2>Humanoid Companion</h2>\n<p>Also at 3rd level, you've adopted a partner, gaining the services of your own humanoid companion.</p>\n<p>Create your humanoid companion as detailed in the Companions section of the Customization Options document for Expanded Content.</p>\n<p>If your companion dies, or you want to bond with a different one, you must first break the bond with your current companion. Bonding with a new companion takes 8 hours spent in an appropriate location. You may only have one companion at a time.</p>\n<p>In addition to its traits and features, your companion gains additional benefits while it is bonded to you:</p>\n<ul>\n<li>Your companion gains two additional traits. It gains one more additional trait when you reach 11th level in this class. For each trait in excess of your proficiency bonus, your force point maximum is reduced by 2.</li>\n</ul>\n<p>Lastly, while bonded and within 10 feet of you, when you or your companion are dealt damage by an external effect, you can choose to have you or your companion gain resistance to that damage. If you do so, the other of the two takes the same damage. This damage can't be reduced or negated in any way.</p>\n<p>At 11th level, your companion must be within 30 feet of you to benefit from this feature. At 17th level your companion must be within 60 feet.</p>\n<h2>The Way of the Hydra</h2>\n<p>Lastly at 3rd level, as a bonus acton, you can enter a synchronized stance with your companion for 1 minute, as long as your companion is within 10 feet of you. While in this stance, once per turn, when you hit a creature with an attack, your companion has advantage on the next attack it makes against the same target before the end of your next turn. Additionally, once per turn, when your companion hits a creature with an attack, you have advantage on the next attack you make against the same target before the end of your next turn.</p>\n<p>This effect ends early if either you or your companion are incapacitated or die, or if your companion is ever more than 10 feet away from you. Once you've used this feature, you can't use it again until you complete a long rest.</p>\n<p>At 11th level, your companion must be within 30 feet of you to benefit from this feature. At 17th level, your companion must be within 60 feet.</p>\n<h2>Channel the Force</h2>\n<p>Starting at 7th level, you gain one of the following Channel the Force options. Choose Smite for Vonil or Shield for Ishu.</p>\n<h3>Smite</h3>\n<p>Once per turn, when your companion is within 10 feet of you and it hits a creature with a melee weapon attack, you can expend a use of your Channel the Force and expend force points to have your companion deal additional damage to the target, which is the same type as the weapon's damage. The additional damage is 1d8 for each point spent in this way. You can't deal more additional damage than the amount shown in the Focused Strikes column of the guardian table.</p>\n<p>At 11th level, your companion must be within 30 feet of you to benefit from the feature. At 17th level, your companion must be within 60 feet.</p>\n<h3>Shield</h3>\n<p>When your companion is hit by a weapon attack while within 10 feet of you, you can use your reaction to attempt to divert the attack. When you do so, the damage your companion takes from the attack is reduced by 1d10 + your Wisdom or Charisma modifier (your choice) + your guardian level.</p>\n<p>At 11th level, your companion must be within 30 feet of you to benefit from this feature. At 17th level, your companion must be within 60 feet.</p>\n<h2>Teamwork</h2>\n<p>By 15th level, you gain one of the following features Choose Takedown for Vonil or Rebuttal for Ishu.</p>\n<h3>Takedown</h3>\n<p>When your companion takes the Help action and helps you, you have advantage on the next two ability checks or attack rolls you make before the start of your next turn, instead of only one. When you take the Help action and help your companion, your companion has advantage on the next two ability checks or attack rolls it makes before the start of its next turn, instead of only one.</p>\n<h3>Rebuttal</h3>\n<p>When your companion takes the Help action and helps you, you gain temporary hit points equal to your guardian level that last until the start of your next turn. When you take the Help action and help your companion, it gains temporary hit points equal to your guardian level that last until the start of its next turn.</p>\n<h2>Master of Unity</h2>\n<p>At 20th level, you and your companion are a paragon of harmony. Your Strength or Dexterity (your choice) and Constitution scores increase by 2. Your maximum for those scores increases by 2. Additionally, you can use your action to gain the following benefits for 1 minute, as long as your companion is within 60 feet of you:</p>\n<ul>\n<li>You and your companion have resistance to kinetic and energy damage.</li>\n<li>Neither you nor your companion can have disadvantage on attack rolls.</li>\n<li>Both you and your companion's critical hit ranges increase by 1.</li>\n</ul>\n<p>This effect ends early if either you or your companion are incapacitated or die, or if your companion is ever more than 60 feet away from you. Once you've used this feature, you can't use it again until you complete a long rest.</p>"
        },
        "source": "EC",
        "classCasterType": "Forcecaster"
    },
    "flags": {
        "core": {
            "sourceId": "Item.stPbyGT5FdLHbSbl"
        }
    },
    "img": "systems/sw5e/packs/Icons/Archetypes/Vonil-Ishu%20Form.webp",
    "effects": []
}