{
    "_id": "3hobQFx1yBtdO6MX",
    "name": "Mechanic's Shop",
    "permission": {
        "default": 0,
        "IpSq6HI4edO6e0Yw": 3
    },
    "type": "starshipmod",
    "data": {
        "prerequisites": {
            "value": ""
        },
        "system": {
            "value": "Suite"
        },
        "basecost": {
            "value": "5000"
        },
        "grade": {
            "value": "NA"
        },
        "description": {
            "value": "<p>This suite comes with all of the proper equipment to house droids and small constructs, complete with integrated astrotech's tools, a demolitions kit, and a mechanic's kit. While utilizing either of these tools, you can add your proficiency bonus to checks you make if you do not already do so. If you already add your proficiency bonus to checks you make, you instead add double your proficiency bonus. If you already double your proficiency bonus to checks you make, you instead add half of your governing ability modifier (rounded down, minimum of +1), in addition to your ability modifier.</p><p>Additionally, while utilizing any of these tools, you gain a benefit based on which tools you are using. </p><ul><li><strong>Demolitions kit:</strong> Over the course of a long rest, you can temporarily improve the potency of one grenade or mine. If the chosen explosive is used before the end of your next long rest, its DC becomes 8 + your proficiency bonus + your Intelligence modifier, and it deals extra damage equal to your Intelligence modifier. The damage is of the same type dealt by the chosen explosive.</li><li><strong>Mechanic's Kit:</strong> Whenever you make an Intelligence (Mechanic's Kit) check to make a repair, you can treat a d20 roll of 9 or lower as a 10, as long as you spend at least ten minutes repairing it.</li></ul><p>Lastly, this suite can house droids and constructs, depending on the ship's size:</p><ul><li><strong>Small:</strong> A Small mechanic's shop can house one Medium droid or construct.</li><li><strong>Medium:</strong> A Medium mechanic's shop can house one Huge droid or construct.</li><li><strong>Large:</strong> A Large mechanic's shop can house one Gargantuan droid or construct.</li><li><strong>Huge:</strong> A Huge mechanic's shop can house 10 Gargantuan droids or constructs.</li><li><strong>Gargantuan:</strong> A Gargantuan mechanic's shop can house 100 Gargantuan droids or constructs.</li></ul><p>Alternatively, this suite can house droids of other sizes. A Gargantuan droid takes up the space of two Huge droids, which in turn takes up the place of two Large droids, and so on.</p>"
        },
        "source": {
            "value": "SotG"
        },
        "activation": {
            "cost": null,
            "type": ""
        },
        "actionType": ""
    },
    "flags": {},
    "img": "systems/sw5e/packs/Icons/Starship%20Modifications/Suite.webp",
    "effects": []
}