{
    "_id": "fDSBIOgEC1JyY3T3",
    "name": "Medbay",
    "permission": {
        "default": 0,
        "IpSq6HI4edO6e0Yw": 3
    },
    "type": "starshipmod",
    "data": {
        "prerequisites": {
            "value": ""
        },
        "system": {
            "value": "Suite"
        },
        "basecost": {
            "value": "5000"
        },
        "grade": {
            "value": "NA"
        },
        "description": {
            "value": "<p>This suite comes with first aid supplies to support a number of civilians, crew members, or troopers, determined by the ship's size.</p><p>Additionally, this suite comes equipped as follows, depending on the ship's size:</p><ul><li><strong>Small:</strong> One biobed.</li><li><strong>Medium:</strong> Two biobeds.</li><li><strong>Large:</strong> 10 biobeds and four bacta tanks.</li><li><strong>Huge:</strong> 100 biobeds and 40 bacta tanks.</li><li><strong>Gargantuan:</strong> 100 biobeds and 400 bacta tanks.</li></ul><p>For every one hour spent in a bacta tank or biobed, a creature's exhaustion level is reduced by 1, and it can roll a Hit Die to recovery hit points without expending the die. </p><p>Additionally, if a creature has been dead for less than 1 hour before being put in a bacta tank. It can be revitalized over a 6-hour period. At the end of the 6 hours, the creature recovers 1 hit point, all mortal wounds close, and the creature can now recover hit points and reduce exhaustion as described above. The revitalized creature takes a -4 penalty to all ability checks, attack rolls, and saving throws. Every time the creature finishes a long rest, the penalty is reduced by 1 until it disappears. This feature has no effect on droids or constructs. Once this feature has been used, it can't be used again until the ship undergoes refitting.</p>"
        },
        "source": {
            "value": "SotG"
        },
        "activation": {
            "cost": null,
            "type": ""
        },
        "actionType": ""
    },
    "flags": {},
    "img": "systems/sw5e/packs/Icons/Starship%20Modifications/Suite.webp",
    "effects": []
}