{
    "_id": "TIakSCO93mkS3Yvs",
    "name": "Power Harpoon",
    "permission": {
        "default": 0,
        "IpSq6HI4edO6e0Yw": 3
    },
    "type": "starshipmod",
    "data": {
        "prerequisites": {
            "value": ""
        },
        "system": {
            "value": "Engineering"
        },
        "basecost": {
            "value": "3500"
        },
        "grade": {
            "value": "NA"
        },
        "description": {
            "value": "<p>As an action, a crew member may make a ship weapon attack with the power harpoon.  The harpoon's range is 400/1600 ft.  On a hit, the target is harpooned, connecting your ship to the target by a 1,600 foot cable. </p><p>At any time as a free action, if the connected objects are closer than 1600 feet, a crew member on your ship can choose whether the cable is slack or taught. When the cable is taught, any movement by one object away from the other, tows the other object.  When the cable is taught, movement by the first object away from the other object is considered movement through difficult terrain if the first object is within one size category of the other object.  An object two or more size categories smaller than the other object cannot move away from the other object when the cable is taught.</p><p>If the objects are 1600 feet apart, the cable is always taught.</p><p>While connected by the cable, a crew member can use a bonus action to reel, pulling your ship towards the target (if larger than your ship), or the target to-wards your ship (if the same size or smaller than your ship) by 200 feet. At any time, a crew member on your ship can release the cable (no action required).</p><p>As an action, a crew member of a harpooned ship can attempt to remove the harpoon. To do so, the ship must succeed on a Strength (boost) check contested by your Strength (boost) or Dexterity (maneuver) check.</p><p>Once this feature has been used, it can't be used again until the ship recharges.</p>"
        },
        "source": {
            "value": "SotG"
        },
        "activation": {
            "cost": null,
            "type": ""
        },
        "actionType": ""
    },
    "flags": {},
    "img": "systems/sw5e/packs/Icons/Starship%20Modifications/Engineering.webp",
    "effects": []
}