{
    "_id": "buLS7XWNBgBtann0",
    "name": "Tusken Raider",
    "permission": {
        "default": 0,
        "ZTMzMzlmOTEwY2U4": 3
    },
    "type": "npc",
    "data": {
        "abilities": {
            "str": {
                "value": 15,
                "proficient": 0,
                "min": 3,
                "mod": 2,
                "save": 2,
                "prof": 0,
                "saveBonus": 0,
                "checkBonus": 0
            },
            "dex": {
                "value": 12,
                "proficient": 0,
                "min": 3,
                "mod": 1,
                "save": 1,
                "prof": 0,
                "saveBonus": 0,
                "checkBonus": 0
            },
            "con": {
                "value": 16,
                "proficient": 0,
                "min": 3,
                "mod": 3,
                "save": 3,
                "prof": 0,
                "saveBonus": 0,
                "checkBonus": 0
            },
            "int": {
                "value": 10,
                "proficient": 0,
                "min": 3,
                "mod": 0,
                "save": 0,
                "prof": 0,
                "saveBonus": 0,
                "checkBonus": 0
            },
            "wis": {
                "value": 11,
                "proficient": 0,
                "min": 3,
                "mod": 0,
                "save": 0,
                "prof": 0,
                "saveBonus": 0,
                "checkBonus": 0
            },
            "cha": {
                "value": 9,
                "proficient": 0,
                "min": 3,
                "mod": -1,
                "save": -1,
                "prof": 0,
                "saveBonus": 0,
                "checkBonus": 0
            }
        },
        "attributes": {
            "ac": {
                "value": "12",
                "min": 0,
                "formula": "combat suit"
            },
            "hp": {
                "value": 15,
                "min": 0,
                "max": 15,
                "temp": 0,
                "tempmax": 0,
                "formula": "2d8+6"
            },
            "init": {
                "value": 0,
                "bonus": 0,
                "mod": 1,
                "prof": 0,
                "total": 1
            },
            "powercasting": "none",
            "force": {
                "known": {
                    "value": 0,
                    "max": 0
                },
                "points": {
                    "value": 0,
                    "min": 0,
                    "max": 0,
                    "temp": 0,
                    "tempmax": 0
                },
                "level": 0
            },
            "tech": {
                "known": {
                    "value": 0,
                    "max": 0
                },
                "points": {
                    "value": 0,
                    "min": 0,
                    "max": 0,
                    "temp": 0,
                    "tempmax": 0
                },
                "level": 0
            },
            "movement": {
                "burrow": 0,
                "climb": 0,
                "fly": 0,
                "swim": 0,
                "walk": 30,
                "units": "ft",
                "hover": false
            },
            "prof": 2,
            "powerdc": 10,
            "bar1": {
                "value": 15,
                "min": 0,
                "max": 15
            },
            "bar2": {
                "value": 12,
                "min": 0,
                "max": 0
            },
            "senses": {
                "special": "passive Perception 10"
            }
        },
        "details": {
            "biography": {
                "value": "<blockquote><p><i>\"Those Tuskens walk like men, but they're vicious, mindless monsters.\"</i></p><p>- Cliegg Lars</p></blockquote><table class=\"userscript-table userscript-table-bordered\" style=\"width: 615.455px\"><tbody><tr><td style=\"line-height: 1.42857\"><u>Designation</u><br></td><td style=\"line-height: 1.42857\">Sentient</td></tr><tr><td style=\"line-height: 1.42857\"><u>Average height</u></td><td style=\"line-height: 1.42857\">1,85 meters</td></tr><tr><td style=\"line-height: 1.42857\"><u>Average mass</u></td><td style=\"line-height: 1.42857\">89 kg</td></tr><tr><td style=\"line-height: 1.42857\"><u>Skin color</u></td><td style=\"line-height: 1.42857\">Sandy brown to glossy green</td></tr><tr><td style=\"line-height: 1.42857\"><u>Homeworld</u></td><td style=\"line-height: 1.42857\"><p>Tatooine</p></td></tr><tr><td style=\"line-height: 1.42857\"><u>Language</u></td><td style=\"line-height: 1.42857\">Tusken<br><br></td></tr></tbody></table><p>Tusken Raiders, less formally referred to as Sand People or simply as Tuskens, were a culture of nomadic, primitive sentients indigenous to Tatooine, where they were often hostile to local settlers. Tusken children were called Uli-ah.</p><h3 style=\"font-family: &#34;helvetica neue&#34; , &#34;helvetica&#34; , &#34;arial&#34; , sans-serif\">Culture</h3><blockquote><p><i>\"A moisture farm? Poor locals never stood a chance. The Sand People think all water is sacred and was promised to them.\"</i></p><p>- Saponza to his partner after discovering a moisture farm ravaged by Tusken Raiders</p></blockquote><p>Tusken Raiders were a species native to the desert world of Tatooine. Their homeworld's harsh environment resulted in them being extremely xenophobic &amp; territorial of their native resources, often attacking the outskirts of smaller settlements such as Anchorhead. They viewed themselves as Tatooine's locals and everyone else as trespassers. The Sand People believed that all water was sacred and promised to them, resulting in them raiding moisture farms set up by colonists. Rare water wells, such as Gafsa, were also sacred to Tuskens. An individual simply trespassing close to one of these water wells could provoke immediate violence. Additionally, Tusken Raiders harvested black melons which grew in the Jundland Wastes, providing them with a reliable source of milk.</p><p>Tusken clan groups consisted of 20 to 30 individuals, and were led by clan leaders, tribal chiefs, and warlords. The Sand People communicated in a language known as Tusken. At the age of 15, a Tusken became an adult, and had to slay a krayt dragon and cut out the precious pearl found in its stomach to gain their adult role in their tribe. Tuskens inhabited encampments scattered across an area of the rocky Jundland Wastes known as The Needles, which were guarded from intruders by vicious massiffs.</p><p>Male Tusken Raiders were the warriors of their clans, often attacking vulnerable travelers that were unfortunate enough to wander through their territory. They wielded gaderffii sticks in combat, and used Tusken Cyclers to fire on vehicles they spotted. Every Tusken warrior created their own gaderffii stick, making each one unique. Males wore rough wrappings and garments that provided protection and allowed ease of movement. Male Tuskens served as warriors, while females held a number of roles. Females could be distinguished by their elaborate jeweled masks with eyeslits and torso-covering sand-shrouds. Tusken children, known as Uli-ah, wore unisex cowls and simple cloaks, and could not dress like males or females until they reached adulthood. All Sand People wore mouth grilles and eye coverings to retain moisture and keep sand out. However, their need to protect their bodies from Tatooine's weather grew into a taboo. Because of this, Tuskens almost never unmasked themselves in front of each other. In addition, no outsider ever saw behind a Tusken's mask and lived, and they were forbidden to remove their clothing in front of others, except at childbirth, on their wedding night, and at coming-of-age ceremonies.</p><p>The Sand People and banthas shared a close, almost mystical bond. During warrior initiation rites, a young Tusken was given a bantha matching their own gender and learned to care for it, with the pair becoming extremely close as the youth earned a place in its clan. When Sand People married, their banthas also mated, and, should its rider die, their bantha usually perished shortly after. If a bantha died before its rider, its remains were placed in a large graveyard, which was treated with great respect by Tuskens and other banthas.</p><p>While the Tuskens were nominally hostile towards outsiders, one tribe did enter into an arrangement with the lawman Cobb Vanth, the Sheriff of Freetown. Vanth and the animal tamer Malakili secured the Tuskens' protection by supplying water and a pearl from the belly of a krayt dragon. These Tuskens also shared Vanth's hostility towards criminal elements, especially slavers. Tuskens were also known to negotiate with outsiders, as demonstrated by the bounty hunter Din Djarin earning safe passage through Tusken land in exchange for a pair of new binoculars.</p><p>The Tuskens had superstitions about various landmarks on Tatooine. For example, the Tuskens avoided Mushroom Mesa at all costs and always fired their blasters before passing through the B'Thazoshe Bridge.</p><h3 style=\"font-family: &#34;helvetica neue&#34; , &#34;helvetica&#34; , &#34;arial&#34; , sans-serif\">History</h3><p><b>Pre-Clone Wars</b></p><blockquote><p><i>\"I…I killed them. I killed them all. They're dead, every single one of them. And not just the men, but the women and the children too. They're like animals, and I slaughtered them like animals.\"</i></p><p>- Anakin Skywalker</p></blockquote><p>In 32 BBY, during the Boonta Eve Classic, several Sand People camped out on Canyon Dune Turn. During the first lap, they took several shots at passing podracers with their projectile rifles. Though initially unsuccessful, on the second lap a Tusken managed to shoot down the podracer of pilot Teemto Pagalies, causing it to crash.</p><p>In 22 BBY, a month before the First Battle of Geonosis, Sand People attacked the Lars moisture farm and kidnapped Shmi Skywalker Lars, whom they imprisoned and tortured. Her son, the Jedi Padawan Anakin Skywalker, returned to Tatooine to rescue her, but after finding her in a Tusken camp, she died of her injuries. The vengeful Anakin proceeded to slaughter every nearby Tusken. Following the massacre, the Tuskens began to fear Skywalker as a vengeful desert demon, and began performing ritual sacrifices to ward him off.</p><p><b>Age of the Empire</b></p><p>In 2 BBY, while searching for Obi-Wan Kenobi, Ezra Bridger and C1-10P were ambushed by a group of Tusken Raiders, who succeeded in destroying their ship before being killed by the former Sith apprentice Darth Maul.<br></p><p><b>Galactic Civil War</b></p><blockquote><p><i>\"I think we better get indoors. The Sand People are easily startled but they will soon be back, and in greater numbers.\"</i></p><p>- Obi-Wan Kenobi</p></blockquote><p>Two years later, Anakin's son Luke was attacked by A'Koba and a group of Tuskens after venturing from the homestead to retrieve R2-D2. Fortunately, Obi-Wan Kenobi warded off the Tuskens by imitating the cry of a krayt dragon, Tatooine's deadliest predator.</p><p>Shortly after the Battle of Yavin, Anakin, now the Sith Lord Darth Vader, slaughtered a village of Tuskens prior to his meeting with bounty hunters Boba Fett and Black Krrsantan. Following the attack, a survivor showed other Tuskens the ruins of his village and the corpses of his people. These Tuskens then built a shrine to Vader and sacrificed the survivor.</p><p>Sometime after, a Tusken known as the \"Jundland General\" led his people in a series of coordinated strikes against the colonists of Tatooine. However, he and his followers were crushed by a group of mercenaries led by Saponza and his partner.</p><p><b>New Republic Era</b></p><blockquote><p><i>\"Tusken Raiders. I heard the locals talking about this filth.\"</i></p><p><i>\"Tuskens think they're the locals. Everyone else is just trespassing.\"</i></p><p><i>\"Whatever they call themselves, they best keep their distance.\"</i></p><p><i>\"Yeah? Why don't you tell them yourself?\"</i></p><p>- Toro Calican and Din Djarin, about to run into some Tusken Raiders</p></blockquote><p>Prior to the Battle of Jakku, the Sheriff of Freetown Cobb Vanth struck a deal with local Tusken Raiders to protect his settlement from criminal elements. In return for protecting Freetown, the Tusken tribe received water and a pearl from the belly of a Krayt dragon. Like Vanth's community, the Tuskens despised criminals particularly slavers. When the Red Key Raiders under crime lord Lorgan Movellan captured Freetown, the Tusken tribe ambushed the criminals and liberated the town.</p><p>In 9 ABY, the Mandalorian Din Djarin reluctantly teamed up with rookie bounty hunter, Toro Calican. The two set out on speeder bikes across the Dune Sea to capture the rogue assassin Fennec Shand. On their way to the target, they encountered some Tusken Raiders. The Mandalorian negotiated through sign language to allow them safe passage through their land. The Tuskens allowed this, in exchange for the rookie bounty hunter's binoculars, which Djarin willingly gave to them in spite of Calican's objection.</p><p>In 34 ABY, during his self-imposed exile on Ahch-To, the Jedi Master Luke Skywalker had a dream where he ignored Princess Leia Organa's message and never joined the rebellion. In his dream, two decades had passed since any Tusken Raider had been seen on his side of Anchorhead and that nothing was left of them except for bones. Luke noted that for some reason it made him feel sad.</p>",
                "public": ""
            },
            "alignment": "Chaotic Dark",
            "species": "",
            "type": {
                "value": "humanoid",
                "subtype": "",
                "swarm": "",
                "custom": ""
            },
            "environment": "",
            "cr": 0.5,
            "powerForceLevel": 0,
            "powerTechLevel": 0,
            "xp": {
                "value": 100
            },
            "source": "Roll 20",
            "race": "",
            "class": ""
        },
        "traits": {
            "size": "med",
            "di": {
                "value": [],
                "custom": ""
            },
            "dr": {
                "value": [],
                "custom": ""
            },
            "dv": {
                "value": [],
                "custom": ""
            },
            "ci": {
                "value": [],
                "custom": ""
            },
            "languages": {
                "value": [],
                "custom": "Tusken"
            }
        },
        "currency": {
            "gc": 0,
            "pp": 0,
            "gp": 0,
            "ep": 0,
            "sp": 0,
            "cp": 0
        },
        "skills": {
            "acr": {
                "value": 0,
                "ability": "dex",
                "bonus": 0,
                "mod": 1,
                "passive": 11,
                "prof": 0,
                "total": 1
            },
            "ani": {
                "value": 0,
                "ability": "wis",
                "bonus": 0,
                "mod": 0,
                "passive": 10,
                "prof": 0,
                "total": 0
            },
            "ath": {
                "value": 0,
                "ability": "str",
                "bonus": 0,
                "mod": 2,
                "passive": 12,
                "prof": 0,
                "total": 2
            },
            "dec": {
                "value": 0,
                "ability": "cha",
                "bonus": 0,
                "mod": -1,
                "passive": 9,
                "prof": 0,
                "total": -1
            },
            "ins": {
                "value": 0,
                "ability": "wis",
                "bonus": 0,
                "mod": 0,
                "passive": 10,
                "prof": 0,
                "total": 0
            },
            "itm": {
                "value": 0,
                "ability": "cha",
                "bonus": 0,
                "mod": -1,
                "passive": 9,
                "prof": 0,
                "total": -1
            },
            "inv": {
                "value": 0,
                "ability": "int",
                "bonus": 0,
                "mod": 0,
                "passive": 10,
                "prof": 0,
                "total": 0
            },
            "lor": {
                "value": 0,
                "ability": "int"
            },
            "med": {
                "value": 0,
                "ability": "wis",
                "bonus": 0,
                "mod": 0,
                "passive": 10,
                "prof": 0,
                "total": 0
            },
            "nat": {
                "value": 0,
                "ability": "int",
                "bonus": 0,
                "mod": 0,
                "passive": 10,
                "prof": 0,
                "total": 0
            },
            "pil": {
                "value": 0,
                "ability": "int"
            },
            "prc": {
                "value": 0,
                "ability": "wis",
                "bonus": 0,
                "mod": 0,
                "passive": 10,
                "prof": 0,
                "total": 0
            },
            "prf": {
                "value": 0,
                "ability": "cha",
                "bonus": 0,
                "mod": -1,
                "passive": 9,
                "prof": 0,
                "total": -1
            },
            "per": {
                "value": 0,
                "ability": "cha",
                "bonus": 0,
                "mod": -1,
                "passive": 9,
                "prof": 0,
                "total": -1
            },
            "slt": {
                "value": 0,
                "ability": "dex",
                "bonus": 0,
                "mod": 1,
                "passive": 11,
                "prof": 0,
                "total": 1
            },
            "ste": {
                "value": 0,
                "ability": "dex",
                "bonus": 0,
                "mod": 1,
                "passive": 11,
                "prof": 0,
                "total": 1
            },
            "sur": {
                "value": 1,
                "ability": "wis",
                "bonus": 0,
                "mod": 0,
                "passive": 12,
                "prof": 2,
                "total": 2
            },
            "tec": {
                "value": 0,
                "ability": "int"
            }
        },
        "powers": {
            "power1": {
                "max": 0,
                "fvalue": 0,
                "fmax": 0,
                "foverride": null,
                "tvalue": 0,
                "tmax": 0,
                "toverride": null
            },
            "power2": {
                "max": 0,
                "fvalue": 0,
                "fmax": 0,
                "foverride": null,
                "tvalue": 0,
                "tmax": 0,
                "toverride": null
            },
            "power3": {
                "max": 0,
                "fvalue": 0,
                "fmax": 0,
                "foverride": null,
                "tvalue": 0,
                "tmax": 0,
                "toverride": null
            },
            "power4": {
                "max": 0,
                "fvalue": 0,
                "fmax": 0,
                "foverride": null,
                "tvalue": 0,
                "tmax": 0,
                "toverride": null
            },
            "power5": {
                "max": 0,
                "fvalue": 0,
                "fmax": 0,
                "foverride": null,
                "tvalue": 0,
                "tmax": 0,
                "toverride": null
            },
            "power6": {
                "max": 0,
                "fvalue": 0,
                "fmax": 0,
                "foverride": null,
                "tvalue": 0,
                "tmax": 0,
                "toverride": null
            },
            "power7": {
                "max": 0,
                "fvalue": 0,
                "fmax": 0,
                "foverride": null,
                "tvalue": 0,
                "tmax": 0,
                "toverride": null
            },
            "power8": {
                "max": 0,
                "fvalue": 0,
                "fmax": 0,
                "foverride": null,
                "tvalue": 0,
                "tmax": 0,
                "toverride": null
            },
            "power9": {
                "max": 0,
                "fvalue": 0,
                "fmax": 0,
                "foverride": null,
                "tvalue": 0,
                "tmax": 0,
                "toverride": null
            },
            "pact": {
                "value": 0,
                "max": 0,
                "override": null,
                "level": 0
            },
            "power0": {
                "value": 0,
                "max": 0
            }
        },
        "bonuses": {
            "mwak": {
                "attack": "",
                "damage": ""
            },
            "rwak": {
                "attack": "",
                "damage": ""
            },
            "mpak": {
                "attack": "",
                "damage": ""
            },
            "rpak": {
                "attack": "",
                "damage": ""
            },
            "abilities": {
                "check": "",
                "save": "",
                "skill": ""
            },
            "power": {
                "forceLightDC": "",
                "forceDarkDC": "",
                "forceUnivDC": "",
                "techDC": ""
            }
        },
        "resources": {
            "legact": {
                "value": 0,
                "max": 0
            },
            "legres": {
                "value": 0,
                "max": 0
            },
            "lair": {
                "value": false,
                "initiative": 0
            }
        }
    },
    "sort": 100001,
    "flags": {
        "sw5e": {
            "dataVersion": "1.2.4"
        }
    },
    "img": "systems/sw5e/packs/Icons/monsters/236_-_Tusken_Raider/avatar.webp",
    "token": {
        "flags": {},
        "name": "Tusken Raider",
        "displayName": 40,
        "img": "systems/sw5e/packs/Icons/monsters/236_-_Tusken_Raider/token.webp",
        "tint": null,
        "width": 1,
        "height": 1,
        "scale": 1,
        "mirrorX": false,
        "lockRotation": false,
        "rotation": 0,
        "vision": false,
        "dimSight": 5,
        "brightSight": 5,
        "dimLight": 0,
        "brightLight": 0,
        "sightAngle": 360,
        "lightAngle": 360,
        "lightAlpha": 1,
        "lightAnimation": {
            "speed": 5,
            "intensity": 5
        },
        "actorId": "buLS7XWNBgBtann0",
        "actorLink": false,
        "disposition": -1,
        "displayBars": 40,
        "bar1": {
            "attribute": "attributes.hp"
        },
        "bar2": {
            "attribute": "attributes.bar2"
        },
        "randomImg": false
    },
    "items": [
        {
            "_id": "OTg5YmI1MzFhMDdl",
            "name": "Aggressive",
            "type": "feat",
            "data": {
                "description": {
                    "value": "<p>As a bonus action, the tusken can move up to its speed toward a hostile creature that it can see.</p>",
                    "chat": "",
                    "unidentified": ""
                },
                "source": "",
                "activation": {
                    "type": "",
                    "cost": 0,
                    "condition": ""
                },
                "duration": {
                    "value": 0,
                    "units": ""
                },
                "target": {
                    "value": "",
                    "units": "",
                    "type": ""
                },
                "range": {
                    "value": "",
                    "long": "",
                    "units": ""
                },
                "uses": {
                    "value": 0,
                    "max": 0,
                    "per": ""
                },
                "consume": {
                    "type": "",
                    "target": null,
                    "amount": null
                },
                "ability": "",
                "actionType": "",
                "attackBonus": 0,
                "chatFlavor": "",
                "critical": null,
                "damage": {
                    "parts": [],
                    "versatile": ""
                },
                "formula": "",
                "save": {
                    "ability": "",
                    "dc": null,
                    "scaling": "power"
                },
                "requirements": "",
                "recharge": {
                    "value": 0,
                    "charged": false
                }
            },
            "sort": 10000,
            "flags": {},
            "img": "systems/sw5e/packs/Icons/monsters/236_-_Tusken_Raider/avatar.webp",
            "effects": []
        },
        {
            "_id": "YzdlNmRkMjNhOTk2",
            "name": "Gaffi Stick",
            "type": "weapon",
            "data": {
                "description": {
                    "value": "<p><p><strong></strong><em>Melee Weapon Attack </em>+4, Reach 5 ft., One target. <em>Hit : </em>7 (1d10+2) kinetic damage</p></p>",
                    "chat": "",
                    "unidentified": ""
                },
                "source": "",
                "quantity": 1,
                "weight": 1,
                "price": 0,
                "equipped": true,
                "rarity": "",
                "identified": true,
                "activation": {
                    "type": "action",
                    "cost": 1,
                    "condition": ""
                },
                "duration": {
                    "value": 0,
                    "units": ""
                },
                "target": {
                    "value": "",
                    "units": "",
                    "type": ""
                },
                "range": {
                    "value": 5,
                    "long": "",
                    "units": "ft"
                },
                "uses": {
                    "value": 0,
                    "max": 0,
                    "per": ""
                },
                "consume": {
                    "type": "",
                    "target": null,
                    "amount": null
                },
                "ability": "str",
                "actionType": "mwak",
                "attackBonus": 0,
                "chatFlavor": "",
                "critical": null,
                "damage": {
                    "parts": [
                        [
                            "1d10+2",
                            "kinetic"
                        ]
                    ],
                    "versatile": ""
                },
                "formula": "",
                "save": {
                    "ability": "",
                    "dc": null,
                    "scaling": "power"
                },
                "armor": {
                    "value": 10
                },
                "hp": {
                    "value": 0,
                    "max": 0,
                    "dt": null,
                    "conditions": ""
                },
                "weaponType": "natural",
                "properties": {
                    "amm": false,
                    "hvy": false,
                    "fin": false,
                    "fir": false,
                    "foc": false,
                    "lgt": false,
                    "rch": false,
                    "rel": false,
                    "ret": false,
                    "spc": false,
                    "thr": false,
                    "two": false,
                    "ver": false
                },
                "proficient": true,
                "attunement": 0
            },
            "sort": 20000,
            "flags": {},
            "img": "systems/sw5e/packs/Icons/monsters/236_-_Tusken_Raider/avatar.webp",
            "effects": []
        },
        {
            "_id": "NWM3ZjlkNTJlMWYz",
            "name": "Cycler Rifle",
            "type": "weapon",
            "data": {
                "description": {
                    "value": "<p><p><strong></strong><em>Ranged Weapon Attack </em>+3, Range 150/600 ft., One target. <em>Hit : </em>6 (1d10+1) kinetic damage</p></p>",
                    "chat": "",
                    "unidentified": ""
                },
                "source": "",
                "quantity": 1,
                "weight": 1,
                "price": 0,
                "equipped": true,
                "rarity": "",
                "identified": true,
                "activation": {
                    "type": "action",
                    "cost": 1,
                    "condition": ""
                },
                "duration": {
                    "value": 0,
                    "units": ""
                },
                "target": {
                    "value": "",
                    "units": "",
                    "type": ""
                },
                "range": {
                    "value": 150,
                    "long": 600,
                    "units": "ft"
                },
                "uses": {
                    "value": 0,
                    "max": 0,
                    "per": ""
                },
                "consume": {
                    "type": "",
                    "target": null,
                    "amount": null
                },
                "ability": "dex",
                "actionType": "rwak",
                "attackBonus": 0,
                "chatFlavor": "",
                "critical": null,
                "damage": {
                    "parts": [
                        [
                            "1d10+1",
                            "kinetic"
                        ]
                    ],
                    "versatile": ""
                },
                "formula": "",
                "save": {
                    "ability": "",
                    "dc": null,
                    "scaling": "power"
                },
                "armor": {
                    "value": 10
                },
                "hp": {
                    "value": 0,
                    "max": 0,
                    "dt": null,
                    "conditions": ""
                },
                "weaponType": "natural",
                "properties": {
                    "amm": false,
                    "hvy": false,
                    "fin": false,
                    "fir": false,
                    "foc": false,
                    "lgt": false,
                    "rch": false,
                    "rel": false,
                    "ret": false,
                    "spc": false,
                    "thr": false,
                    "two": false,
                    "ver": false
                },
                "proficient": true,
                "attunement": 0
            },
            "sort": 30000,
            "flags": {},
            "img": "systems/sw5e/packs/Icons/monsters/236_-_Tusken_Raider/avatar.webp",
            "effects": []
        }
    ],
    "effects": []
}