{
    "_id": "rqODPMwm1QdZJEMD",
    "name": "Viper Probe Droid",
    "permission": {
        "default": 0,
        "ZTMzMzlmOTEwY2U4": 3
    },
    "type": "npc",
    "data": {
        "abilities": {
            "str": {
                "value": 11,
                "proficient": 0,
                "min": 3,
                "mod": 0,
                "save": 0,
                "prof": 0,
                "saveBonus": 0,
                "checkBonus": 0
            },
            "dex": {
                "value": 15,
                "proficient": 0,
                "min": 3,
                "mod": 2,
                "save": 2,
                "prof": 0,
                "saveBonus": 0,
                "checkBonus": 0
            },
            "con": {
                "value": 12,
                "proficient": 0,
                "min": 3,
                "mod": 1,
                "save": 1,
                "prof": 0,
                "saveBonus": 0,
                "checkBonus": 0
            },
            "int": {
                "value": 17,
                "proficient": 0,
                "min": 3,
                "mod": 3,
                "save": 3,
                "prof": 0,
                "saveBonus": 0,
                "checkBonus": 0
            },
            "wis": {
                "value": 14,
                "proficient": 0,
                "min": 3,
                "mod": 2,
                "save": 2,
                "prof": 0,
                "saveBonus": 0,
                "checkBonus": 0
            },
            "cha": {
                "value": 7,
                "proficient": 1,
                "min": 3,
                "mod": -2,
                "save": 0,
                "prof": 2,
                "saveBonus": 0,
                "checkBonus": 0
            }
        },
        "attributes": {
            "ac": {
                "value": "14",
                "min": 0,
                "formula": "armor plating"
            },
            "hp": {
                "value": 37,
                "min": 0,
                "max": 37,
                "temp": 0,
                "tempmax": 0,
                "formula": "5d10+10"
            },
            "init": {
                "value": 0,
                "bonus": 0,
                "mod": 2,
                "prof": 0,
                "total": 2
            },
            "powercasting": "none",
            "force": {
                "known": {
                    "value": 0,
                    "max": 0
                },
                "points": {
                    "value": 0,
                    "min": 0,
                    "max": 0,
                    "temp": 0,
                    "tempmax": 0
                },
                "level": 0
            },
            "tech": {
                "known": {
                    "value": 0,
                    "max": 0
                },
                "points": {
                    "value": 0,
                    "min": 0,
                    "max": 0,
                    "temp": 0,
                    "tempmax": 0
                },
                "level": 0
            },
            "movement": {
                "burrow": 0,
                "climb": 0,
                "fly": 40,
                "swim": 0,
                "walk": 5,
                "units": "ft",
                "hover": false
            },
            "prof": 2,
            "powerdc": 10,
            "bar1": {
                "value": 37,
                "min": 0,
                "max": 37
            },
            "bar2": {
                "value": 14,
                "min": 0,
                "max": 0
            },
            "senses": {
                "darkvision": 120
            }
        },
        "details": {
            "biography": {
                "value": "<blockquote><p><i>\"We have thousands of probe droids searching the galaxy. I want proof, not leads!\"</i></p><p><span style=\"font-size: 13px\">- Admiral Kendal Ozzel</span></p></blockquote><table class=\"userscript-table userscript-table-bordered\" style=\"width: 615.455px\"><tbody><tr><td style=\"line-height: 1.42857\"><u>Manufacturer</u></td><td style=\"line-height: 1.42857\">Arakyd Industries</td></tr><tr><td style=\"line-height: 1.42857\"><u>Class</u></td><td style=\"line-height: 1.42857\">Probe droid</td></tr><tr><td style=\"line-height: 1.42857\"><u>Degree</u></td><td style=\"line-height: 1.42857\">4th degree droid</td></tr><tr><td style=\"line-height: 1.42857\"><u>Height</u><br></td><td style=\"line-height: 1.42857\">1,6 meters</td></tr></tbody></table><p>The Viper probe droid, commonly referred to as the probot or Imperial probe droid, was a deep-space exploration and reconnaissance probe droid produced by Arakyd Industries. The Viper model was based on the success of Galalloy Industries' early probe droids. The design of the probot also relied heavily on the work of Viper Sensor Intelligence Systems, a corporation acquired by Arakyd during the Clone Wars. Though they were used almost exclusively by the military, they were considered class two exploration droids.</p><h3>Specifications</h3><blockquote><p><i>\"'Fraid there's not much left.\"</i></p><p><span style=\"font-size: 13px\"><i>\"What was it?\"</i></span></p><p><i>\"A droid of some kind. I didn't hit it that hard. It must've had a self-destruct.\"</i></p><p>- Han Solo and Princess Leia</p></blockquote><p>The lightly-armored Viper droid measured 1.6 meters in height with six manipulator arms extending from a central pod and several retractable sensor arms for gathering samples. High resolution receivers and sensors covered the domed head—including motion, acoustic, sonic, and seismic sensors, a radiation meter, magnetic imager, and holocamera. It had an atmosphere sensor capable of determining a planet's atmosphere class within one half-hour. It moved on a repulsorlift generator which was equipped to operate over any terrain. One of the arms was high-torque, and the droid was equipped with a floodlight on its head. In addition, when making transmissions, the probe droid emitted a audio encrypted imperial computer code set of an unknown serial number.<br></p><p>Information was relayed back to its superiors via a high-frequency HoloNet transceiver. Its repulsorlift engines carried the droid across terrain at up to 40 km/h, while the arms gathered samples. Vipers were delivered to their targets through single-use custom built hyperspace pods. They were commonly deployed along the perimeters of key strategic star systems and hyperlanes to act as automated guardians.<br></p><p>Typically, a Viper probe droid cost 14,500 credits. They were capable of being deployed from Galactic Empire Command centers.<br></p><h3>History</h3><blockquote><p><i>\"Go and report. You have much to see. Burn brightly.\"</i></p><p><span style=\"font-size: 13px\">- IG-88, to the last Viper probe droid constructed on Mechis III</span></p></blockquote><p>Arakyd probe droids were originally designed for use by the Galactic Republic in survey and exploration duty, but when the Republic was transformed into the Galactic Empire, Arakyd modified their probots with military-level sensors and equipment, and marketed them as Viper probe droids. This was not the first time Arakyd probots had been upgraded for warfare, however, as the Confederacy of Independent Systems had employed a number of upgraded probots during the invasion of Kashyyyk during the Clone Wars.[6] Viper probots in service with the Empire were upgraded under the direct supervision of Darth Vader, and featured a blaster cannon, a self-destruct mechanism, and, in some cases, deflector shields.</p><p>Many thousands of the Imperial Viper probe droids were manufactured on Mechis III, and were in production when the rogue assassin droid IG-88 took control of the planet's automated factories. IG-88 included a secondary set of programming into the Viper droids to relay any obtained intelligence back to Mechis III, as well as to the Empire. Thus, they simultaneously served as the eyes and ears of the Droid Revolution. The Imperial Intelligence's Analysis Bureau also used them as remote surveillance droids posted largely in the Outer Rim Territories. In conflict zones, probots often worked alongside the Imperial Navy to monitor traffic and provide early warnings of attack. They could also be programmed to engage pursuit mode, whereupon the Viper would track an enemy vessel and report back on its location and destination.</p><p>Arakyd's success with the military model of the Viper yielded the C-Viper probe droid variant designed for planetary law enforcement organizations, the Infiltrator probe droid for sabotage missions, and the Hunter-Killer probot.<br></p><p>Shortly after the Battle of Tatooine, the Empire dispatched various probe droids to Tatooine in an attempt to recover the stolen plans for the Death Star. Six months after the Battle of Yavin, the Galactic Empire sent a detachment of probe droids to root out Rebel Commander Luke Skywalker. They were destroyed by Skywalker and Rogue Squadron. Probe droids were also used to scout ahead for Imperial strike forces, including during the Reytha campaign and the battle at Corellia, or were sent on search missions like at Chorax. Several were also dispatched to Dantooine as security measures while the Imperials arrived on the planet to detain the defecting Imperial officer Tycho Celchu.<br></p><p><b>Locating Echo Base</b></p><blockquote><p><i>\"I think we've got something, sir. The report is only a fragment from a probe droid in the Hoth system, but it's the best lead we've had.\"</i></p><p><span style=\"font-size: 13px\">- Captain Firmus Piett, to Admiral Kendal Ozzel</span></p></blockquote><p>Following the Battle of Yavin, the Empire committed thousands of these modified probe droids to scour the galaxy for hidden Alliance to Restore the Republic bases, specifically the Alliance High Command headquarters. They even went as far as to provide bounty hunters with remote request devices to search out targets moving from planet to planet.<br></p><p>It was an Arakyd Viper, launched from the Imperial II-class Star Destroyer Stalker,[10] that landed on the ice planet Hoth and discovered the Rebellion's Echo Base. Upon landing on the frozen world, the probe droid appeared to the casual onlooker, and even the base's sensor readings, as one of many meteorites streaking to Hoth's surface. During a routine patrol of the Hoth wastes, Luke Skywalker intended to inspect the crash site, but was attacked by a wampa ice creature, and never learned what had really crashed to the ground. Thus, the Hoth probe droid was free to continue on its programmed mission.</p><p>Immediately upon emerging from its hyperspace pod, the probe detected a faint comm signal on non-Imperial bandwidths. This indicated to the droid the presence of an unregistered, and possibly Rebel, settlement. Since it had not yet gathered enough conclusive evidence to report, the droid moved away from the nearby signal in order that it might avoid contact until such time as self-preservation no longer became necessary.</p><p>Soon after moving away from its first contact, the probe droid vectored in on the detected signal's probable destination point, triangulating from its last known position. A long time passed where the droid made no contact with the signal whatsoever, so it continued to search. During the night blizzard that threatened the lives of Skywalker and Han Solo, the probe detected and destroyed a wampa with its powerful blaster cannon. Only with the most advanced Imperial sensor technology was the probe able to detect a wampa in a blizzard whiteout. As the blizzard raged into the night, the probe activated its modified power-intensive particle shield to protect it from the thick snow hazard.</p><p>In the early hours of the next morning, the probe ceased operation entirely, shunting its energy to its shield. The droid reappeared when the sun rose, cresting the rise of a snow bank in Echo Base's Zone 12. There, it detected the presence of a large deflector shield generator. It immediately began audio-visual recording of the contact. Following its programming, the droid then beamed, on omnisignal unicode, a transmission via its HoloNet transceiver concerning its find to Vader's personal flagship, the Star Dreadnought Executor. This information was privately received simultaneously by IG-88 back on Mechis III. Vader decided from this information that the Hoth system was indeed the location of the Rebel base, and he ordered his Death Squadron there in preparation of a full-scale ground assault.<br></p><p>With the initial contact reported, the probe continued on its mission. It proceeded to meticulously map out the Echo Base defenses, including the surrounding trenches, artillery emplacements, and even the size, model, and location of the v-150 anti-orbital ion cannon, as well as observing troop movements and positions. This information was received by General Maximilian Veers. He and his commanders used this invaluable tactical information to plan the attack, a testament to the Empire's incredible preparedness during the Battle of Hoth.<br></p><blockquote><p><i>\"Princess, we have a visitor. We've picked up something outside the base in Zone Twelve, moving east.\"</i></p><p><span style=\"font-size: 13px\">- General Carlist Rieekan, to Princess Leia Organa</span></p></blockquote><p>Before the probe had a chance to implement its \"sabotage and disruption\" programming, the Echo Base command center received a transmission from Echo Station 3-8. The scout outpost had detected a metal object skimming through the icy wastes. The probe droid was discovered. The probe then proceeded to completely destroy the outpost and the scout within it with its blaster, turning it into a smoldering ruin. Solo and the Wookiee Chewbacca were dispatched to deal with the spy machine. The probe detected the approach of its two enemy assailants, but it was no match for them. The probe was soon trapped despite its evasive maneuvers. After a quick game of \"decoy,\" Solo blasted the confused probe. Solo's shots were only meant to disable the probe's motor functions, intending to take the droid intact, but its override programming kicked in and the probe immediately self-destructed.</p><p>Although the probe attempted to destroy itself, its self-destruct programming had apparently been at least marginally affected by either the frigid Hoth temperatures or the damage that was inflicted on it upon entering the Hoth system. The probe was almost destroyed entirely, though enough of it was left for Solo to retrieve and bring back to the base for memory scan. The base technicians and Alliance historian Voren Na'al were able to piece together some of the probe's memory circuits and learn many details concerning its particular mission experiences. Na'al used much of this data to help compile his subsequent reports on the history of the Rebellion during this period. Other probe droids were used during the actual Battle to locate Rebel installations.</p><p>In 14 ABY the Jedi Jaden Korr encountered probe droids used by the Imperial Remnant on his scouting mission on Hoth.<br></p>",
                "public": ""
            },
            "alignment": "Unaligned",
            "species": "",
            "type": {
                "value": "droid",
                "subtype": "",
                "swarm": "",
                "custom": ""
            },
            "environment": "",
            "cr": 1,
            "powerForceLevel": 0,
            "powerTechLevel": 0,
            "xp": {
                "value": 200
            },
            "source": "Roll 20",
            "race": "",
            "class": ""
        },
        "traits": {
            "size": "lg",
            "di": {
                "value": [],
                "custom": ""
            },
            "dr": {
                "value": [
                    "necrotic",
                    "poison",
                    "psychic"
                ],
                "custom": ""
            },
            "dv": {
                "value": [],
                "custom": "Ion"
            },
            "ci": {
                "value": [],
                "custom": "Poison, Disease"
            },
            "languages": {
                "value": [],
                "custom": "—"
            }
        },
        "currency": {
            "gc": 0,
            "pp": 0,
            "gp": 0,
            "ep": 0,
            "sp": 0,
            "cp": 0
        },
        "skills": {
            "acr": {
                "value": 0,
                "ability": "dex",
                "bonus": 0,
                "mod": 2,
                "passive": 12,
                "prof": 0,
                "total": 2
            },
            "ani": {
                "value": 0,
                "ability": "wis",
                "bonus": 0,
                "mod": 2,
                "passive": 12,
                "prof": 0,
                "total": 2
            },
            "ath": {
                "value": 0,
                "ability": "str",
                "bonus": 0,
                "mod": 0,
                "passive": 10,
                "prof": 0,
                "total": 0
            },
            "dec": {
                "value": 0,
                "ability": "cha",
                "bonus": 0,
                "mod": -2,
                "passive": 8,
                "prof": 0,
                "total": -2
            },
            "ins": {
                "value": 0,
                "ability": "wis",
                "bonus": 0,
                "mod": 2,
                "passive": 12,
                "prof": 0,
                "total": 2
            },
            "itm": {
                "value": 0,
                "ability": "cha",
                "bonus": 0,
                "mod": -2,
                "passive": 8,
                "prof": 0,
                "total": -2
            },
            "inv": {
                "value": 1,
                "ability": "int",
                "bonus": 0,
                "mod": 3,
                "passive": 15,
                "prof": 2,
                "total": 5
            },
            "lor": {
                "value": 0,
                "ability": "int"
            },
            "med": {
                "value": 0,
                "ability": "wis",
                "bonus": 0,
                "mod": 2,
                "passive": 12,
                "prof": 0,
                "total": 2
            },
            "nat": {
                "value": 0,
                "ability": "int",
                "bonus": 0,
                "mod": 3,
                "passive": 13,
                "prof": 0,
                "total": 3
            },
            "pil": {
                "value": 0,
                "ability": "int"
            },
            "prc": {
                "value": 1,
                "ability": "wis",
                "bonus": 0,
                "mod": 2,
                "passive": 14,
                "prof": 2,
                "total": 4
            },
            "prf": {
                "value": 0,
                "ability": "cha",
                "bonus": 0,
                "mod": -2,
                "passive": 8,
                "prof": 0,
                "total": -2
            },
            "per": {
                "value": 0,
                "ability": "cha",
                "bonus": 0,
                "mod": -2,
                "passive": 8,
                "prof": 0,
                "total": -2
            },
            "slt": {
                "value": 0,
                "ability": "dex",
                "bonus": 0,
                "mod": 2,
                "passive": 12,
                "prof": 0,
                "total": 2
            },
            "ste": {
                "value": 0,
                "ability": "dex",
                "bonus": 0,
                "mod": 2,
                "passive": 12,
                "prof": 0,
                "total": 2
            },
            "sur": {
                "value": 0,
                "ability": "wis",
                "bonus": 0,
                "mod": 2,
                "passive": 12,
                "prof": 0,
                "total": 2
            },
            "tec": {
                "value": 0,
                "ability": "int"
            }
        },
        "powers": {
            "power1": {
                "max": 0,
                "fvalue": 0,
                "fmax": 0,
                "foverride": null,
                "tvalue": 0,
                "tmax": 0,
                "toverride": null
            },
            "power2": {
                "max": 0,
                "fvalue": 0,
                "fmax": 0,
                "foverride": null,
                "tvalue": 0,
                "tmax": 0,
                "toverride": null
            },
            "power3": {
                "max": 0,
                "fvalue": 0,
                "fmax": 0,
                "foverride": null,
                "tvalue": 0,
                "tmax": 0,
                "toverride": null
            },
            "power4": {
                "max": 0,
                "fvalue": 0,
                "fmax": 0,
                "foverride": null,
                "tvalue": 0,
                "tmax": 0,
                "toverride": null
            },
            "power5": {
                "max": 0,
                "fvalue": 0,
                "fmax": 0,
                "foverride": null,
                "tvalue": 0,
                "tmax": 0,
                "toverride": null
            },
            "power6": {
                "max": 0,
                "fvalue": 0,
                "fmax": 0,
                "foverride": null,
                "tvalue": 0,
                "tmax": 0,
                "toverride": null
            },
            "power7": {
                "max": 0,
                "fvalue": 0,
                "fmax": 0,
                "foverride": null,
                "tvalue": 0,
                "tmax": 0,
                "toverride": null
            },
            "power8": {
                "max": 0,
                "fvalue": 0,
                "fmax": 0,
                "foverride": null,
                "tvalue": 0,
                "tmax": 0,
                "toverride": null
            },
            "power9": {
                "max": 0,
                "fvalue": 0,
                "fmax": 0,
                "foverride": null,
                "tvalue": 0,
                "tmax": 0,
                "toverride": null
            },
            "pact": {
                "value": 0,
                "max": 0,
                "override": null,
                "level": 0
            },
            "power0": {
                "value": 0,
                "max": 0
            }
        },
        "bonuses": {
            "mwak": {
                "attack": "",
                "damage": ""
            },
            "rwak": {
                "attack": "",
                "damage": ""
            },
            "mpak": {
                "attack": "",
                "damage": ""
            },
            "rpak": {
                "attack": "",
                "damage": ""
            },
            "abilities": {
                "check": "",
                "save": "",
                "skill": ""
            },
            "power": {
                "forceLightDC": "",
                "forceDarkDC": "",
                "forceUnivDC": "",
                "techDC": ""
            }
        },
        "resources": {
            "legact": {
                "value": 0,
                "max": 0
            },
            "legres": {
                "value": 0,
                "max": 0
            },
            "lair": {
                "value": false,
                "initiative": 0
            }
        }
    },
    "sort": 100001,
    "flags": {
        "sw5e": {
            "dataVersion": "1.2.4"
        }
    },
    "img": "systems/sw5e/packs/Icons/monsters/195_-_Viper_Probe_Droid/avatar.webp",
    "token": {
        "flags": {},
        "name": "Viper Probe Droid",
        "displayName": 40,
        "img": "systems/sw5e/packs/Icons/monsters/195_-_Viper_Probe_Droid/token.webp",
        "tint": null,
        "width": 2,
        "height": 2,
        "scale": 1,
        "mirrorX": false,
        "lockRotation": false,
        "rotation": 0,
        "vision": false,
        "dimSight": 10,
        "brightSight": 10,
        "dimLight": 0,
        "brightLight": 0,
        "sightAngle": 360,
        "lightAngle": 360,
        "lightAlpha": 1,
        "lightAnimation": {
            "speed": 5,
            "intensity": 5
        },
        "actorId": "rqODPMwm1QdZJEMD",
        "actorLink": false,
        "disposition": -1,
        "displayBars": 40,
        "bar1": {
            "attribute": "attributes.hp"
        },
        "bar2": {
            "attribute": "attributes.bar2"
        },
        "randomImg": false
    },
    "items": [
        {
            "_id": "ZDIyMWVmNTUxNGJi",
            "name": "Circuitry",
            "type": "feat",
            "data": {
                "description": {
                    "value": "<p>The droid has disadvantage on saving throws against effects that would deal ion or lightning damage.</p>",
                    "chat": "",
                    "unidentified": ""
                },
                "source": "",
                "activation": {
                    "type": "",
                    "cost": 0,
                    "condition": ""
                },
                "duration": {
                    "value": 0,
                    "units": ""
                },
                "target": {
                    "value": "",
                    "units": "",
                    "type": ""
                },
                "range": {
                    "value": "",
                    "long": "",
                    "units": ""
                },
                "uses": {
                    "value": 0,
                    "max": 0,
                    "per": ""
                },
                "consume": {
                    "type": "",
                    "target": null,
                    "amount": null
                },
                "ability": "",
                "actionType": "",
                "attackBonus": 0,
                "chatFlavor": "",
                "critical": null,
                "damage": {
                    "parts": [],
                    "versatile": ""
                },
                "formula": "",
                "save": {
                    "ability": "",
                    "dc": null,
                    "scaling": "power"
                },
                "requirements": "",
                "recharge": {
                    "value": 0,
                    "charged": false
                }
            },
            "sort": 10000,
            "flags": {},
            "img": "systems/sw5e/packs/Icons/monsters/195_-_Viper_Probe_Droid/avatar.webp",
            "effects": []
        },
        {
            "_id": "NWRlNmM1YTBjYTU2",
            "name": "Keen Hearing and Sight",
            "type": "feat",
            "data": {
                "description": {
                    "value": "<p>The probe droid has advantage on Wisdom (Perception) checks that rely on hearing or sight.</p>",
                    "chat": "",
                    "unidentified": ""
                },
                "source": "",
                "activation": {
                    "type": "",
                    "cost": 0,
                    "condition": ""
                },
                "duration": {
                    "value": 0,
                    "units": ""
                },
                "target": {
                    "value": "",
                    "units": "",
                    "type": ""
                },
                "range": {
                    "value": "",
                    "long": "",
                    "units": ""
                },
                "uses": {
                    "value": 0,
                    "max": 0,
                    "per": ""
                },
                "consume": {
                    "type": "",
                    "target": null,
                    "amount": null
                },
                "ability": "",
                "actionType": "",
                "attackBonus": 0,
                "chatFlavor": "",
                "critical": null,
                "damage": {
                    "parts": [],
                    "versatile": ""
                },
                "formula": "",
                "save": {
                    "ability": "",
                    "dc": null,
                    "scaling": "power"
                },
                "requirements": "",
                "recharge": {
                    "value": 0,
                    "charged": false
                }
            },
            "sort": 20000,
            "flags": {},
            "img": "systems/sw5e/packs/Icons/monsters/195_-_Viper_Probe_Droid/avatar.webp",
            "effects": []
        },
        {
            "_id": "ZWU0OWU1OTgwZjIx",
            "name": "Blaster Cannon",
            "type": "weapon",
            "data": {
                "description": {
                    "value": "<p><p><strong></strong><em>Ranged Weapon Attack </em>+4, Range 60/240 ft., One target. <em>Hit : </em>7 (1d10+2) energy damage</p></p>",
                    "chat": "",
                    "unidentified": ""
                },
                "source": "",
                "quantity": 1,
                "weight": 1,
                "price": 0,
                "equipped": true,
                "rarity": "",
                "identified": true,
                "activation": {
                    "type": "action",
                    "cost": 1,
                    "condition": ""
                },
                "duration": {
                    "value": 0,
                    "units": ""
                },
                "target": {
                    "value": "",
                    "units": "",
                    "type": ""
                },
                "range": {
                    "value": 60,
                    "long": 240,
                    "units": "ft"
                },
                "uses": {
                    "value": 0,
                    "max": 0,
                    "per": ""
                },
                "consume": {
                    "type": "",
                    "target": null,
                    "amount": null
                },
                "ability": "dex",
                "actionType": "rwak",
                "attackBonus": 0,
                "chatFlavor": "",
                "critical": null,
                "damage": {
                    "parts": [
                        [
                            "1d10+2",
                            "energy"
                        ]
                    ],
                    "versatile": ""
                },
                "formula": "",
                "save": {
                    "ability": "",
                    "dc": null,
                    "scaling": "power"
                },
                "armor": {
                    "value": 10
                },
                "hp": {
                    "value": 0,
                    "max": 0,
                    "dt": null,
                    "conditions": ""
                },
                "weaponType": "natural",
                "properties": {
                    "amm": false,
                    "hvy": false,
                    "fin": false,
                    "fir": false,
                    "foc": false,
                    "lgt": false,
                    "rch": false,
                    "rel": false,
                    "ret": false,
                    "spc": false,
                    "thr": false,
                    "two": false,
                    "ver": false
                },
                "proficient": true,
                "attunement": 0
            },
            "sort": 30000,
            "flags": {},
            "img": "systems/sw5e/packs/Icons/monsters/195_-_Viper_Probe_Droid/avatar.webp",
            "effects": []
        },
        {
            "_id": "Mzk5Y2MxYmJhMDM0",
            "name": "Self-Destruct",
            "type": "feat",
            "data": {
                "description": {
                    "value": "<p><p><strong></strong>.</p><p>When the probe droid is reduced to half of its hit point maximum, it attempts to self-destruct. Each creature within 20 feet of it must make a DC 13 Dexterity saving throw, taking 6d6 fire damage on a failed save, or half as much on a successful one.</p></p>",
                    "chat": "",
                    "unidentified": ""
                },
                "source": "",
                "activation": {
                    "type": "action",
                    "cost": 1,
                    "condition": ""
                },
                "duration": {
                    "value": 0,
                    "units": ""
                },
                "target": {
                    "value": "",
                    "units": "",
                    "type": ""
                },
                "range": {
                    "value": "",
                    "long": "",
                    "units": ""
                },
                "uses": {
                    "value": 0,
                    "max": 0,
                    "per": ""
                },
                "consume": {
                    "type": "",
                    "target": null,
                    "amount": null
                },
                "ability": "",
                "actionType": "",
                "attackBonus": 0,
                "chatFlavor": "",
                "critical": null,
                "damage": {
                    "parts": [],
                    "versatile": ""
                },
                "formula": "",
                "save": {
                    "ability": "dex",
                    "dc": 10,
                    "scaling": "power"
                },
                "requirements": "",
                "recharge": {
                    "value": 0,
                    "charged": false
                }
            },
            "sort": 40000,
            "flags": {},
            "img": "systems/sw5e/packs/Icons/monsters/195_-_Viper_Probe_Droid/avatar.webp",
            "effects": []
        }
    ],
    "effects": []
}