{
    "_id": "kNiT2BD3eIgE1zys",
    "name": "Force Push/Pull",
    "permission": {
        "default": 0,
        "00LEX91CfLcf3HGf": 3
    },
    "type": "power",
    "data": {
        "description": {
            "value": "<p>You gain the minor ability to move or manipulate creatures and objects with the Force. You can exert fine control on objects with your telekinetic grip, such as manipulating a simple tool, opening a door or a container, stowing or retrieving an item from an open container, or pouring the contents from a vial. Alternatively, you can push or pull a creature or object you can see.</p>\n<p>You use the Force to move a Medium or smaller creature or object not being worn or carried within range. The target must make a Strength saving throw. An object automatically fails this saving throw. On a failed save, the creature or object moves a number of feet in a direction of your choice based on its size. A Tiny creature or object can be moved up to 20 feet, a Small creature or object can be moved up to 10 feet, and a Medium creature or object can be moved up to 5 feet. If at the end of this movement the creature or object strikes another creature or object, they both take 1d4 kinetic damage.</p>\n<p>This power improves when you reach higher levels. At 5th level, you can move a Tiny creature or object up to 30 feet, a Small creature or object up to 20 feet, a Medium creature or object up to 10 feet, and the power’s damage increases to 2d4 kinetic damage. At 11th level, you can move a Small creature or object up to 30 feet, a Medium creature up to 20 feet, and the power’s damage increases to 3d4 kinetic damage. At 17th level, you can move a Medium creature to up 30 feet, and the power’s damage increases to 4d4 kinetic damage.</p>",
            "chat": "",
            "unidentified": ""
        },
        "source": "PHB",
        "activation": {
            "type": "action",
            "cost": 1,
            "condition": ""
        },
        "duration": {
            "value": null,
            "units": "inst"
        },
        "target": {
            "value": 1,
            "units": "",
            "type": "creature"
        },
        "range": {
            "value": 60,
            "long": null,
            "units": "ft"
        },
        "uses": {
            "value": 0,
            "max": "0",
            "per": ""
        },
        "ability": "",
        "actionType": "save",
        "attackBonus": 0,
        "chatFlavor": "",
        "critical": null,
        "damage": {
            "parts": [
                [
                    "1d4",
                    "kinetic"
                ]
            ],
            "versatile": ""
        },
        "formula": "",
        "save": {
            "ability": "str",
            "dc": null,
            "scaling": "power"
        },
        "level": 0,
        "school": "uni",
        "components": {
            "value": "",
            "vocal": false,
            "somatic": false,
            "material": false,
            "ritual": false,
            "concentration": false
        },
        "materials": {
            "value": "",
            "consumed": false,
            "cost": 0,
            "supply": 0
        },
        "preparation": {
            "mode": "prepared",
            "prepared": false
        },
        "scaling": {
            "mode": "atwill",
            "formula": "1d4"
        },
        "armorproperties": {
            "parts": []
        },
        "weaponproperties": {
            "parts": []
        },
        "consume": {
            "type": "",
            "target": "",
            "amount": null
        }
    },
    "flags": {},
    "img": "systems/sw5e/packs/Icons/Force%20Powers/Force%20Push.webp",
    "effects": []
}